<html><head><meta http-equiv="Content-Type" content="text/html; charset="UTF-8"/><title></title></head>
<body><table><tr><td><b><a name="201692">F201692</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Parameterwert geberlos unzul&auml;ssig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Parameter kann mit diesem Wert nicht parametriert werden, wenn die Bewegungs&uuml;berwachungsfunktionen in p9506 geberlos angew&auml;hlt sind.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
Parameternummer mit dem falschen Wert.<br />
Siehe auch: p9501 (SI Motion Freigabe sichere Funktionen (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Den im St&ouml;rwert angegebenen Parameter korrigieren.<br />
- Gegebenenfalls die geberlosen Bewegungs&uuml;berwachungsfunktionen abw&auml;hlen (p9506).<br />
Siehe auch: p9501 (SI Motion Freigabe sichere Funktionen (Control Unit))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201693">A201693 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Safety-Parametrierung ge&auml;ndert Warmstart&#47;POWER ON erforderlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Es wurden Safety-Parameter ge&auml;ndert, die erst nach einem Warmstart oder POWER ON wirksam werden.<br />
Warnwert (r2124, dezimal interpretieren):<br />
Parameternummer des Safety-Parameters, aufgrund dessen &Auml;nderung ein Warmstart oder POWER ON notwendig ist.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Warmstart durchf&uuml;hren (p0009 = 30, p0976 = 2, 3).<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Hinweis:<br />
Vor der Durchf&uuml;hrung des Abnahmetests muss ein POWER ON bei allen Komponenten durchgef&uuml;hrt werden.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201694">F201694 (A)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion CU: Firmware-Version Motor Module&#47;Hydraulic Module &auml;lter Control Unit</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Firmware-Version des Motor Modules&#47;Hydraulic Modules ist &auml;lter als die Version der Control Unit.<br />
Es ist m&ouml;glich, dass Safety-Funktionen nicht verf&uuml;gbar sind (r9771&#47;r9871).<br />
Hinweis:<br />
Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
Diese Meldung kann auch auftreten, wenn nach automatischem Firmware-Update noch kein POWER ON durchgef&uuml;hrt wurde (Warnung A01007).<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Firmware des Motor Modules&#47;Hydraulic Modules auf neuere Version hochr&uuml;sten.<br />
Siehe auch: r9390 (SI Motion Version sichere Bewegungsüberwachungen (Motor Module)), r9590 (SI Motion Version sichere Bewegungsüberwachungen (Control Unit))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201695">A201695 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Sensor Module wurde getauscht</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Ein Sensor Module, das f&uuml;r die sicheren Bewegungs&uuml;berwachungen verwendet wird, wurde getauscht. Eine Quittierung des Hardware-Tausches ist erforderlich. Anschlie&szlig;end ist ein Abnahmetest durchzuf&uuml;hren.<br />
Hinweis:<br />
Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Folgende Schritte mit dem Inbetriebnahme-Tool STARTER durchf&uuml;hren:<br />
- Schaltfl&auml;che &quot;Hardware-Tausch quittieren&quot; in der Safety-Maske bet&auml;tigen.<br />
- Funktion &quot;RAM nach ROM kopieren&quot; ausf&uuml;hren.<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Alternativ folgende Schritte in der Expertenliste des Inbetriebnahme-Tools durchf&uuml;hren:<br />
- Kopierfunktion f&uuml;r Node-Identifier auf dem Antrieb starten (p9700 = 1D hex).<br />
- Hardware-CRC auf dem Antrieb best&auml;tigen (p9701 = EC hex).<br />
- Alle Parameter speichern (p0977 = 1).<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Anschlie&szlig;end einen Abnahmetest durchf&uuml;hren (siehe Funktionshandbuch Safety Integrated).<br />
Bei SINUMERIK gilt:<br />
Der Tausch von Komponenten mit Safety-Funktionen wird durch das HMI unterst&uuml;tzt (Bedienbereich &quot;Diagnose&quot; --&gt; Softkey &quot;Alarmliste&quot; --&gt; Softkey &quot;SI HW best&auml;tigen&quot; usw.).<br />
Die genaue Vorgehensweise ist in folgender Literatur zu finden:<br />
SINUMERIK Funktionshandbuch Safety Integrated<br />
Siehe auch: p9700 (SI Motion Kopierfunktion), p9701 (SI Motion Datenänderung bestätigen)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201696">A201696 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Teststopp f&uuml;r Bewegungs&uuml;berwachungen im Hochlauf angew&auml;hlt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Zwangsdynamisierung (Teststopp) f&uuml;r die sicheren Bewegungs&uuml;berwachungsfunktionen ist unzul&auml;ssigerweise bereits im Hochlauf angew&auml;hlt.<br />
Deshalb wird der Test erst nach erneuter Anwahl der Zwangsdynamisierung durchgef&uuml;hrt.<br />
Hinweis:<br />
Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
Siehe auch: p9705 (SI Motion Teststopp Signalquelle)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zwangsdynamisierung f&uuml;r die sicheren Bewegungs&uuml;berwachungen abw&auml;hlen und erneut anw&auml;hlen.<br />
Achtung:<br />
F&uuml;r die Anwahl des Teststopps d&uuml;rfen Eing&auml;nge des TM54F nicht verwendet werden.<br />
Hinweis:<br />
Die Signalquelle zur Anwahl der Zwangsdynamisierung wird &uuml;ber Binektoreingang p9705 eingestellt.<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201697">A201697 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Teststopp f&uuml;r Bewegungs&uuml;berwachungen erforderlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die in p9559 eingestellte Zeit zur Zwangsdynamisierung (Teststopp) f&uuml;r die sicheren Bewegungs&uuml;berwachungsfunktionen ist &uuml;berschritten. Eine neue Zwangsdynamisierung ist erforderlich.<br />
Nach der n&auml;chsten Anwahl der Zwangsdynamisierung wird die Meldung zur&uuml;ckgenommen und die &Uuml;berwachungszeit zur&uuml;ckgesetzt.<br />
Hinweis:<br />
- Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
- W&auml;hrend eines Hochlaufs werden die Abschaltpfade nicht automatisch gepr&uuml;ft, deshalb steht die Warnung nach dem Hochlauf immer an.<br />
- Der Test muss innerhalb des festgelegten maximalen Zeitintervalls (p9559, maximal 9000 Stunden) durchgef&uuml;hrt werden, um die normativen Anforderungen nach einer rechtzeitigen Fehleraufdeckung und die Bedingungen der Berechnung der Ausfallrate der Sicherheitsfunktionen (PFH-Wert) zu erf&uuml;llen. Ein Betrieb &uuml;ber diesen maximalen Zeitraum hinaus ist zul&auml;ssig, wenn sichergestellt werden kann, dass die Zwangsdynamisierung durchgef&uuml;hrt wird, bevor sich Personen in den Gefahrenbereich begeben und auf das Funktionieren der Sicherheitsfunktionen angewiesen sind.<br />
Siehe auch: p9559 (SI Motion Zwangsdynamisierung Timer (Control Unit)), r9765 (SI Motion Zwangsdynamisierung Restzeit (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zwangsdynamisierung der sicheren Bewegungs&uuml;berwachungen durchf&uuml;hren.<br />
Die Signalquelle zur Anwahl der Zwangsdynamisierung wird &uuml;ber Binektoreingang p9705 eingestellt.<br />
Achtung:<br />
F&uuml;r die Anwahl der Zwangsdynamisierung d&uuml;rfen Eing&auml;nge des TM54F nicht verwendet werden.<br />
Hinweis:<br />
SI: Safety Integrated<br />
Siehe auch: p9705 (SI Motion Teststopp Signalquelle)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201698">A201698 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Inbetriebnahmemodus aktiv</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Inbetriebnahme der Funktion &quot;Safety Integrated&quot; ist angew&auml;hlt.<br />
Diese Meldung wird nach Beendigung der Safety-Inbetriebnahme zur&uuml;ckgenommen.<br />
Hinweis:<br />
- Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
- W&auml;hrend des Safety-Inbetriebnahmemodus ist die Funktion &quot;STO&quot; intern angew&auml;hlt.<br />
Siehe auch: p0010<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Keine notwendig.<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201699">A201699 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Teststopp f&uuml;r STO erforderlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die in p9659 eingestellte Zeit zur Zwangsdynamisierung (Teststopp) f&uuml;r die Funktion &quot;STO&quot; ist &uuml;berschritten. Eine neue Zwangsdynamisierung ist erforderlich.<br />
Nach der n&auml;chsten Abwahl der Funktion &quot;STO&quot; wird die Meldung zur&uuml;ckgenommen und die &Uuml;berwachungszeit zur&uuml;ckgesetzt.<br />
Hinweis:<br />
- Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
- Der Test muss innerhalb des festgelegten maximalen Zeitintervalls (p9659) durchgef&uuml;hrt werden, um die normativen Anforderungen nach einer rechtzeitigen Fehleraufdeckung und die Bedingungen der Berechnung der Ausfallrate der Sicherheitsfunktionen (PFH-Wert) zu erf&uuml;llen. Ein Betrieb &uuml;ber diesen maximalen Zeitraum hinaus ist zul&auml;ssig, wenn sichergestellt werden kann, dass die Zwangsdynamisierung durchgef&uuml;hrt wird, bevor sich Personen in den Gefahrenbereich begeben und auf das Funktionieren der Sicherheitsfunktionen angewiesen sind.<br />
Siehe auch: p9659 (SI Zwangsdynamisierung Timer), r9660 (SI Zwangsdynamisierung Restzeit)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>STO anw&auml;hlen und wieder abw&auml;hlen.<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
STO: Safe Torque Off (Sicher abgeschaltetes Moment) &#47; SH: Safe standstill (Sicherer Halt)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201700">C201700</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP A ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP A stillgesetzt (STO &uuml;ber den Safety-Abschaltpfad der Control Unit).<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung vom zweiten &Uuml;berwachungskanal.<br />
- STO nicht aktiv nach parametrierter Zeit (p9557) nach Teststopp-Anwahl.<br />
- Folgereaktion der Meldung C01706 &quot;SI Motion CU: SAM&#47;SBR Grenze &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01701 &quot;SI Motion CU: STOP B ausgel&ouml;st&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf dem zweiten &Uuml;berwachungskanal beheben.<br />
- Diagnose bei der anstehenden Meldung C01706 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01714 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01701 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01715 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01716 durchf&uuml;hren.<br />
- Wert in p9557 (soweit vorhanden) &uuml;berpr&uuml;fen, eventuell den Wert vergr&ouml;&szlig;ern und POWER ON durchf&uuml;hren.<br />
- Abschaltpfad der Control Unit &uuml;berpr&uuml;fen (DRIVE-CLiQ-Kommunikation &uuml;berpr&uuml;fen falls vorhanden).<br />
- Motor Module bzw. Power Module bzw. Hydraulic Module tauschen.<br />
- Control Unit tauschen.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SAM: Safe Acceleration Monitor (Sichere &Uuml;berwachung auf Beschleunigung)<br />
SBR: Safe Brake Ramp (Sichere Bremsrampen&uuml;berwachung)<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201701">C201701</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP B ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
 (AUS3)</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP B stillgesetzt (Abbremsen an der AUS3-R&uuml;cklauframpe).<br />
Als Folge dieser St&ouml;rung wird nach Ablauf der in p9556 parametrierten Zeit oder Unterschreiten der in p9560 parametrierten Drehzahlschwelle die Meldung C01700 &quot;STOP A ausgel&ouml;st&quot; ausgegeben.<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung vom zweiten &Uuml;berwachungskanal.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01711 &quot;SI Motion CU: Defekt in einem &Uuml;berwachungskanal&quot;.<br />
- Folgereaktion der Meldung C01707 &quot;SI Motion CU: Toleranz f&uuml;r Sicheren Betriebshalt &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf dem zweiten &Uuml;berwachungskanal beheben.<br />
- Diagnose bei der anstehenden Meldung C01714 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01711 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01707 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01715 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01716 durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201706">C201706</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): SAM&#47;SBR Grenze &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Bewegungs&uuml;berwachungsfunktionen mit Geber (p9506 = 0) oder geberlos mit eingestellter &Uuml;berwachung auf Beschleunigung (SAM, p9506 = 3):<br />
- Nach dem Einleiten von STOP B (SS1) oder STOP C (SS2) hat die Geschwindigkeit die eingestellte Toleranz &uuml;berschritten.<br />
Bewegungs&uuml;berwachungsfunktionen geberlos mit eingestellter Bremsrampen&uuml;berwachung (SBR, p9506 = 1):<br />
- Nach dem Einleiten von STOP B (SS1) oder SLS-Umschaltung auf die niedrigere Geschwindigkeitsstufe hat die Geschwindigkeit die eingestellte Toleranz &uuml;berschritten.<br />
Der Antrieb wird durch die Meldung C01700 &quot;SI Motion: STOP A ausgel&ouml;st&quot; stillgesetzt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Das Bremsverhalten &uuml;berpr&uuml;fen und gegebenenfalls die Parametrierung der Funktion &quot;SAM&quot; bzw. &quot;SBR&quot; anpassen.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SAM: Safe Acceleration Monitor (Sichere &Uuml;berwachung auf Beschleunigung)<br />
SBR: Safe Brake Ramp (Sichere Rampen&uuml;berwachung)<br />
SI: Safety Integrated<br />
Siehe auch: p9548, p9581, p9582, p9583<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201707">C201707</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Toleranz f&uuml;r Sicheren Betriebshalt &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Istposition hat sich weiter als die Stillstandstoleranz von der Sollposition entfernt.<br />
Der Antrieb wird durch die Meldung C01701 &quot;SI Motion: STOP B ausgel&ouml;st&quot; stillgesetzt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Pr&uuml;fen, ob weitere Safety-St&ouml;rungen anstehen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
- &Uuml;berpr&uuml;fen ob die Stillstandstoleranz zur Genauigkeit und Regeldynamik der Achse passt.<br />
- POWER ON durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
Siehe auch: p9530<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201708">C201708</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP C ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>STOP2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP C stillgesetzt (Abbremsen an der AUS3-R&uuml;cklauframpe).<br />
Nach Ablauf der parametrierten Zeit wird &quot;Sicherer Betriebshalt&quot; (SOS) aktiviert.<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung von &uuml;bergeordneter Steuerung.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
Siehe auch: p9552 (SI Motion Übergangszeit STOP C auf SOS (SBH) (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf der Steuerung beheben.<br />
- Diagnose bei der anstehenden Meldung C01714&#47;C01715&#47;C01716 durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201709">C201709</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP D ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP D stillgesetzt (Bremsen auf der Bahn).<br />
Nach Ablauf der parametrierten Zeit wird &quot;Sicherer Betriebshalt&quot; (SOS) aktiviert.<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung von &uuml;bergeordneter Steuerung.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
Siehe auch: p9553 (SI Motion Übergangszeit STOP D auf SOS (SBH) (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf der Steuerung beheben.<br />
- Diagnose bei der anstehenden Meldung C01714&#47;C01715&#47;C01716 durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201710">C201710</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP E ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP E stillgesetzt (R&uuml;ckzugsbewegung).<br />
Nach Ablauf der parametrierten Zeit wird &quot;Sicherer Betriebshalt&quot; (SOS) aktiviert.<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung von &uuml;bergeordneter Steuerung.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
Siehe auch: p9554 (SI Motion Übergangszeit STOP E auf SOS (SBH) (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf der Steuerung beheben.<br />
- Diagnose bei der anstehenden Meldung C01714&#47;C01715&#47;C01716 durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201711">C201711</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Defekt in einem &Uuml;berwachungskanal</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb hat beim kreuzweisen Vergleich der beiden &Uuml;berwachungskan&auml;le einen Unterschied zwischen Eingangsdaten oder Ergebnissen der &Uuml;berwachungen festgestellt und STOP F ausgel&ouml;st. Eine der &Uuml;berwachungen funktioniert nicht mehr zuverl&auml;ssig, d. h. es ist kein sicherer Betrieb mehr m&ouml;glich.<br />
Ist mindestens eine &Uuml;berwachungsfunktion aktiv, so wird nach Ablauf der parametrierten Zeitstufe die Meldung C01701 &quot;SI Motion: STOP B ausgel&ouml;st&quot; ausgegeben.<br />
Der Meldungswert, der zum STOP F gef&uuml;hrt hat, wird in r9725 angezeigt.<br />
Wird der Antrieb zusammen mit einer SINUMERIK betrieben, sind die Meldungswerte in der Meldung 27001 der SINUMERIK beschrieben, au&szlig;er folgender Meldungswerte, die nur im SINAMICS auftreten k&ouml;nnen:<br />
1007: Kommunikation mit PLC fehlerhaft (Lebenszeichen).<br />
1008: Kommunikation mit PLC fehlerhaft (CRC).<br />
Die nachfolgend beschriebenen Meldungswerte betreffen den Kreuzvergleich zwischen beiden &Uuml;berwachungskan&auml;len (antriebsintegrierte Sicherheitsfunktionen).<br />
Die Meldungswerte k&ouml;nnen auch in folgenden F&auml;llen auftreten, falls die explizit genannte Ursache nicht zutrifft:<br />
- Unterschiedlich parametrierte Taktzeiten (p9500&#47;p9300 bzw. p9511&#47;p9311).<br />
- Unterschiedlich parametrierte Achstypen (p9502&#47;p9302).<br />
- Zu schnelle Taktzeiten (p9500&#47;p9300, p9511&#47;p9311).<br />
- Bei Meldungswerten 3, 44 ... 57, 232 und 1-Geber-System, unterschiedlich eingestellte Geberparameter.<br />
- Bei Meldungswerten 3, 44 ... 57, 232 und 2-Geber-System, nicht korrekt eingestellte Geberparameter.<br />
- Fehlerhafte Synchronisation.<br />
Meldungswert (r9749, dezimal interpretieren):<br />
0 bis 999: Nummer des kreuzweise verglichenen Datums, das zu dieser St&ouml;rung gef&uuml;hrt hat.<br />
Meldungswerte, die nachfolgend nicht aufgelistet werden, sind nur f&uuml;r Siemens-interne Fehlerdiagnose.<br />
0: Stoppanforderung vom anderen &Uuml;berwachungskanal.<br />
1: Zustandsabbild der &Uuml;berwachungsfunktionen SOS, SLS, SAM&#47;SBR, SDI, SLA oder SLP (Ergebnisliste 1) (r9710[0], r9710[1]).<br />
2: Zustandsabbild der &Uuml;berwachungsfunktion SCA oder n &lt; nx (Ergebnisliste 2) (r9711[0], r9711[1]).<br />
3: Differenz des Lageistwert (r9713[0&#47;1]) zwischen den beiden &Uuml;berwachungskan&auml;len ist gr&ouml;&szlig;er als die Toleranz in p9542&#47;p9342. Bei freigegebener Istwertsynchronisation (p9501.3&#47;p9301.3) ist die Differenz der Geschwindigkeit (basierend auf Lageistwert) gr&ouml;&szlig;er als die Toleranz in p9549&#47;p9349.<br />
4: Synchronisation des kreuzweisen Datenvergleichs zwischen den beiden Kan&auml;len fehlerhaft.<br />
5: Freigabe sichere Funktionen (p9501&#47;p9301). Safety-&Uuml;berwachungstakt zu klein (p9500&#47;p9300).<br />
6: Grenzwert f&uuml;r SLS1 (p9531[0]&#47;p9331[0]).<br />
7: Grenzwert f&uuml;r SLS2 (p9531[1]&#47;p9331[1]).<br />
8: Grenzwert f&uuml;r SLS3 (p9531[2]&#47;p9331[2]).<br />
9: Grenzwert f&uuml;r SLS4 (p9531[3]&#47;p9331[3]).<br />
10: Stillstandstoleranz (p9530&#47;p9330).<br />
11: Oberer Grenzwert f&uuml;r SLP1 (p9534[0]&#47;p9334[0]).<br />
12: Unterer Grenzwert f&uuml;r SLP1 (p9535[0]&#47;p9335[0]).<br />
13: Oberer Grenzwert f&uuml;r SLP2 (p9534[1]&#47;p9334[1]).<br />
14: Unterer Grenzwert f&uuml;r SLP2 (p9535[1]&#47;p9335[1]).<br />
15: Oberer Grenzwert f&uuml;r SCA, Nocken 1 Plusposition (p9536[0]&#47;p9336[0]+p9540&#47;p9340)<br />
16: Unterer Grenzwert f&uuml;r SCA, Nocken 1 Plusposition (p9536[0]&#47;p9336[0])<br />
17: Oberer Grenzwert f&uuml;r SCA, Nocken 1 Minusposition (p9537[0]&#47;p9337[0]+p9540&#47;p9340)<br />
18: Unterer Grenzwert f&uuml;r SCA, Nocken 1 Minusposition (p9537[0]&#47;p9337[0])<br />
19...30: Grenzwerte SCA, Nocken 2 bis 4. Siehe oben St&ouml;rwerte 15 bis 18 f&uuml;r den Nocken 1<br />
31: Positionstoleranz (p9542&#47;p9342) bzw. (p9549&#47;p9349) bei freigegebener Istwertsynchronisation (p9501.3&#47;p9301.3).<br />
32: Positionstoleranz beim sicheren Referenzieren(p9544&#47;p9344).<br />
33: Zeit Geschwindigkeitsumschaltung (p9551&#47;p9351).<br />
35: Verz&ouml;gerungszeit STOP A (p9556&#47;p9356).<br />
36: Pr&uuml;fungszeit STO (p9557&#47;p9357).<br />
37: &Uuml;bergangszeit STOP C nach SOS (p9552&#47;p9352).<br />
38: &Uuml;bergangszeit STOP D nach SOS (p9553&#47;p9353).<br />
39: &Uuml;bergangszeit STOP E nach SOS (p9554&#47;p9354).<br />
40: Stoppreaktion bei SLS (p9561&#47;p9361).<br />
41: Stoppreaktion bei SLP1 (p9562[0]&#47;p9362[0]).<br />
42: Abschaltdrehzahl STO (p9560&#47;p9360).<br />
43: Speichertest Stoppreaktion (STOP A).<br />
44 ... 57: Allgemein<br />
M&ouml;gliche Ursache 1 (bei Inbetriebnahme bzw. Parameter&auml;nderung)<br />
Der Toleranzwert f&uuml;r die &Uuml;berwachungsfunktion ist zwischen den beiden &Uuml;berwachungskan&auml;len unterschiedlich.<br />
M&ouml;gliche Ursache 2 (bei laufendem Betrieb)<br />
Die Grenzwerte basieren auf dem aktuellen Istwert (r9713[0&#47;1]). Bei einer Abweichung der sicheren Istwerte zwischen den beiden &Uuml;berwachungskan&auml;len sind auch die im definierten Abstand liegenden Grenzwerte unterschiedlich (d. h. entspricht Meldungswert 3). Dies ist feststellbar durch Kontrolle der sicheren Istpositionen.<br />
Zul&auml;ssige Abweichung zwischen den beiden &Uuml;berwachungskan&auml;len: p9542&#47;p9342.<br />
44: Lageistwert (r9713[0&#47;1]) + Grenzwert SLS1 (p9531[0]&#47;p9331[0]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
45: Lageistwert (r9713[0&#47;1]) - Grenzwert SLS1 (p9531[0]&#47;p9331[0]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
46: Lageistwert (r9713[0&#47;1]) + Grenzwert SLS2 (p9531[1]&#47;p9331[1]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
47: Lageistwert (r9713[0&#47;1]) - Grenzwert SLS2 (p9531[1]&#47;p9331[1]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
48: Lageistwert (r9713[0&#47;1]) + Grenzwert SLS3 (p9531[2]&#47;p9331[2]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
49: Lageistwert (r9713[0&#47;1]) - Grenzwert SLS3 (p9531[2]&#47;p9331[2]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
50: Lageistwert (r9713[0&#47;1]) + Grenzwert SLS4 (p9531[3]&#47;p9331[3]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
51: Lageistwert (r9713[0&#47;1]) - Grenzwert SLS4 (p9531[3]&#47;p9331[3]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
52: Stillstandsposition + Toleranz (p9530&#47;9330).<br />
53: Stillstandsposition - Toleranz (p9530&#47;9330).<br />
54: Lageistwert (r9713[0&#47;1]) + Grenzwert nx (p9546&#47;p9346) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300) + Toleranz (p9542&#47;p9342).<br />
55: Lageistwert (r9713[0&#47;1]) + Grenzwert nx (p9546&#47;p9346) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
56: Lageistwert (r9713[0&#47;1]) - Grenzwert nx (p9546&#47;p9346) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
57: Lageistwert (r9713[0&#47;1]) - Grenzwert nx (p9546&#47;p9346) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300) - Toleranz (p9542&#47;p9342).<br />
58: Aktuelle Stillsetzanforderung.<br />
75: Geschwindigkeitsgrenze nx (p9546, p9346).<br />
Bei freigegebener Funktion &quot;n &lt; nx: Hysterese und Filterung&quot; (p9501.16 = 1) kommt dieser Meldungswert auch bei unterschiedlicher Hysteresetoleranz (p9547&#47;p9347).<br />
76: Stoppreaktion bei SLS1 (p9563[0]&#47;p9363[0]).<br />
77: Stoppreaktion bei SLS2 (p9563[1]&#47;p9363[1]).<br />
78: Stoppreaktion bei SLS3 (p9563[2]&#47;p9363[2]).<br />
79: Stoppreaktion bei SLS4 (p9563[3]&#47;p9363[3]).<br />
80: Modulowert f&uuml;r SP bei Rundachsen (p9505&#47;p9305).<br />
81: Geschwindigkeitstoleranz f&uuml;r SAM (p9548&#47;p9348).<br />
82: SGEs f&uuml;r SLS-Korrekturfaktor.<br />
83: Abnahmetesttimer (p9558&#47;p9358).<br />
84: &Uuml;bergangszeit STOP F (p9555&#47;p9355).<br />
85: &Uuml;bergangszeit Busausfall (p9580&#47;p9380).<br />
86: Kennung 1-Geber-System (p9526&#47;p9326).<br />
87: Geberzuordnung zweiter Kanal (p9526&#47;p9326).<br />
88: SCA (SN) Freigabe (p9503&#47;p9303).<br />
89: Gebergrenzfrequenz.<br />
90: Oberer Grenzwert f&uuml;r SCA, Nocken 5 Plusposition (p9536[4]&#47;p9336[4]+p9540&#47;p9340).<br />
91: Unterer Grenzwert f&uuml;r SCA, Nocken 5 Plusposition (p9536[4]&#47;p9336[4]).<br />
92: Oberer Grenzwert f&uuml;r SCA, Nocken 5 Minusposition (p9537[4]&#47;p9337[4]+p9540&#47;p9340).<br />
93: Unterer Grenzwert f&uuml;r SCA, Nocken 5 Minusposition (p9537[4]&#47;p9337[4]).<br />
94...224: Grenzwerte SCA, Nocken 6 bis 30. Siehe oben St&ouml;rwerte 90 bis 93 f&uuml;r den Nocken 5.<br />
225...229: Zustandsbilder der &Uuml;berwachungsfunktion SCA (Ergebnislisten 3...7).<br />
230: Filterzeitkonstante f&uuml;r n &lt; nx.<br />
231: Hysteresetoleranz f&uuml;r n &lt; nx.<br />
232: Gegl&auml;tteter Geschwindigkeitsistwert.<br />
233: Grenzwert nx &#47; Safety-&Uuml;berwachungstakt + Hysteresetoleranz.<br />
234: Grenzwert nx &#47; Safety-&Uuml;berwachungstakt.<br />
235: -Grenzwert nx &#47; Safety-&Uuml;berwachungstakt.<br />
236: -Grenzwert nx &#47; Safety-&Uuml;berwachungstakt - Hysteresetoleranz.<br />
237: SGA n &lt; nx.<br />
238: Geschwindigkeitsgrenzwert f&uuml;r SAM (p9568&#47;p9368 od. p9346&#47;p9346).<br />
239: Beschleunigung f&uuml;r SBR (p9581&#47;p9381 und p9583&#47;p9383).<br />
240: Kehrwert der Beschleunigung f&uuml;r SBR (p9581&#47;p9381 und p9583&#47;p9383).<br />
241: Verz&ouml;gerungszeit f&uuml;r SBR (p9582&#47;p9382).<br />
242: Funktionsspezifikation (p9506&#47;p9306).<br />
243: Funktionskonfiguration (p9507&#47;p9307).<br />
244: Istwerterfassung geberlos Filterzeit (p9587&#47;p9387).<br />
245: Minimalstrom Istwerterfassung geberlos (p9588&#47;p9388).<br />
246: Spannungstoleranz Beschleunigung (p9589&#47;p9389).<br />
247: SDI Toleranz (p9564&#47;p9364).<br />
248: SDI positiv obere Grenze (7FFFFFFF hex).<br />
249: Lageistwert (r9713[0&#47;1]) - SDI Toleranz (p9564&#47;p9364).<br />
250: Lageistwert (r9713[0&#47;1]) + SDI Toleranz (p9564&#47;p9364).<br />
251: SDI negativ untere Grenze (80000001 hex).<br />
252: SDI Stoppreaktion (p9566&#47;p9366).<br />
253: SDI Verz&ouml;gerungszeit (p9565&#47;p9365).<br />
254: Einstellung der Auswerteverz&ouml;gerung bei Istwerterfassung nach Impulsfreigabe (p9586&#47;p9386).<br />
255: Einstellung Verhalten w&auml;hrend Impulsl&ouml;schung (p9509&#47;p9309).<br />
256: Zustandsabbild der &Uuml;berwachungsfunktionen SOS, SLS, SLP, Teststopp, SBR, SDI (Ergebnisliste 1 Erw) (r9710).<br />
257: Sicherheitsfunktionen bei Bewegungs&uuml;berwachungen ohne Anwahl (p9512&#47;p9312) unterschiedlich.<br />
258: Fehlertoleranz Istwerterfassung geberlos (p9585&#47;p9385).<br />
259: Skalierungsfaktor f&uuml;r sichere Position &uuml;ber PROFIsafe (p9574&#47;p9374) oder PROFIsafe-Telegramm (p9611&#47;p9811) unterschiedlich.<br />
260: Modulowert inklusive Skalierung (p9505&#47;p9305 und p9574&#47;p9374) bei SP mit 16 Bit.<br />
261: Skalierungsfaktor f&uuml;r die Beschleunigung f&uuml;r SBR unterschiedlich.<br />
262: Skalierungsfaktor f&uuml;r den Kehrwert der Beschleunigung f&uuml;r SBR unterschiedlich.<br />
263: Stoppreaktion bei SLP2 (p9562[1]&#47;p9362[1]).<br />
264: Positionstoleranz inklusive Skalierung (p9542&#47;p9342 und p9574&#47;p9374) bei SP mit 16 Bit.<br />
265: Zustandsabbild aller &Auml;nderungsfunktionen (Ergebnisliste 1) (r9710).<br />
266: Die Umschaltgeschwindigkeit auf SOS ist unterschiedlich (p9567&#47;p9367).<br />
267: Die &Uuml;bergangszeit auf SOS nach Stillstand ist unterschiedlich (p9569&#47;p9369).<br />
268: SLP Verz&ouml;gerungszeit ist unterschiedlich (p9577&#47;p9377).<br />
269: Faktor zur Erh&ouml;hung der Positionstoleranz beim Getriebeumschalten (p9543&#47;9343).<br />
270: Maske f&uuml;rs SGE-Abbild: alle Funktionen, die bei aktueller Parametrierung nicht unterst&uuml;tzt&#47;freigegeben sind (p9501&#47;p9301, p9601&#47;p9801 und p9506&#47;p9306).<br />
271: Maske f&uuml;rs SGE-Abbild: Abw&auml;hlen aller BIts f&uuml;r die Funktion &quot;Sichere Getriebeumschaltung&quot;.<br />
272: Aktivierung der erh&ouml;hten Positionstoleranz bei der Funktion &quot;Sichere Getriebeumschaltung&quot; unterschiedlich (p9568&#47;p9368 od. p9346&#47;p9346 od. &quot;0&quot;).<br />
273: Geschwindigkeitsgrenzwert f&uuml;r die Abflachung der Rampe bei SAM&#47;SBR unterschiedlich.<br />
274: SGA SCA, Nocken 1 bis 15.<br />
275: SGA SCA, Nocken 16 bis 30.<br />
276: Grenzwert f&uuml;r SLA1 (p9578&#47;p9378).<br />
277: Stoppreaktion bei SLA1 (p9579&#47;p9379).<br />
278: Oberer Grenzwert f&uuml;r SLA1.<br />
279: Unterer Grenzwert f&uuml;r SLA1.<br />
280: Oberer Grenzwert f&uuml;r SLA1 (Feinaufl&ouml;sung).<br />
281: Unterer Grenzwert f&uuml;r SLA1(Feinaufl&ouml;sung).<br />
282: SLA Filterzeit.<br />
283: Beschleunigungsistwert (Feinaufl&ouml;sung).<br />
1000: Kontrolltimer abgelaufen. Es sind zu viele Signalver&auml;nderungen an den sicherheitsgerichteten Eing&auml;ngen aufgetreten.<br />
1001: Initialisierungsfehler des Kontrolltimers.<br />
1002:<br />
Anwenderzustimmung nach Ablauf des Timers unterschiedlich.<br />
Die Anwenderzustimmung ist nicht konsistent. Der Status der Anwenderzustimmung ist nach Ablauf einer Zeit von 4 s in beiden &Uuml;berwachungskan&auml;len unterschiedlich.<br />
1003:<br />
Referenztoleranz &uuml;berschritten.<br />
Bei gesetzter Anwenderzustimmung ist die Differenz zwischen dem neu ermittelten Referenzpunkt nach Hochlauf (Absolutwertgeber) oder Referenzpunktfahrt (abstandscodiertes bzw. inkrementelles Messsystem) und der sicheren Istposition (gespeicherter Wert + Verfahrweg) gr&ouml;&szlig;er als die Referenztoleranz (p9544). In diesem Fall wird die Anwenderzustimmung weggenommen.<br />
1004:<br />
Plausibilit&auml;tsfehler bei Anwenderzustimmung.<br />
1. Bei bereits gesetzter Anwenderzustimmung wurde nochmals das Setzen angesto&szlig;en. In diesem Fall wird die Anwenderzustimmung weggenommen.<br />
2. Die Anwenderzustimmung wurde gesetzt, obwohl die Achse noch nicht referenziert war.<br />
1005:<br />
- Bei sicheren Bewegungs&uuml;berwachungen geberlos: Impulse bereits gel&ouml;scht bei Teststopp-Anwahl.<br />
- Bei sicheren Bewegungs&uuml;berwachungen mit Geber: STO bereits aktiv bei Teststopp-Anwahl.<br />
1011: Abnahmeteststatus zwischen den &Uuml;berwachungskan&auml;len unterschiedlich.<br />
1012: Plausibilit&auml;tsverletzung des Geberistwerts.<br />
1014: Fehler bei der Synchronisation des SGA f&uuml;r die Funktion &quot;Sicherer Nocken&quot;.<br />
1015: Das Getriebeschalten (Bit 27 im PROFIsafe-Telegramm) dauert l&auml;nger als 2 min.<br />
1020: Ausfall der zyklischen Kommunikation zwischen den &Uuml;berwachungskan&auml;len.<br />
1021: Ausfall der zyklischen Kommunikation zwischen &Uuml;berwachungskanal und Sensor Module.<br />
1022: Lebenszeichenfehler f&uuml;r DRIVE-CLiQ-Geber &Uuml;berwachungskanal 1.<br />
1023: Fehler bei Wirksamkeitstests im DRIVE-CLiQ-Geber.<br />
1024: Lebenszeichenfehler f&uuml;r HTL&#47;TTL-Geber.<br />
1032: Lebenszeichenfehler f&uuml;r DRIVE-CLiQ-Geber &Uuml;berwachungskanal 2.<br />
1033: Fehler bei der Pr&uuml;fung des Offsets zwischen POS1 und POS2 f&uuml;r DRIVE-CLiQ-Geber &Uuml;berwachungskanal 1.<br />
1034: Fehler bei der Pr&uuml;fung des Offsets zwischen POS1 und POS2 f&uuml;r DRIVE-CLiQ-Geber &Uuml;berwachungskanal 2.<br />
1035: Offset zwischen POS1 und POS2 f&uuml;r DRIVE-CLiQ-Geber auf einem der &Uuml;berwachungskan&auml;le hat sich seit der letzten Inbetriebnahme ge&auml;ndert.<br />
1039: &Uuml;berlauf bei der Positionsberechnung.<br />
1041: Strombetrag zu gering (geberlos).<br />
1042: Plausibilit&auml;tsfehler Strom&#47;Spannung.<br />
1043: Zu viele Beschleunigungsvorg&auml;nge.<br />
1044: Plausibilit&auml;tsfehler Stromistwerte.<br />
5000 ... 5140:<br />
PROFIsafe-Meldungswerte.<br />
Bei diesen Meldungswerten werden Failsafe-Ansteuersignale (Failsafe Values) an die Sicherheitsfunktionen &uuml;bertragen.<br />
5000, 5014, 5023, 5024, 5030 ... 5032, 5042, 5043, 5052, 5053, 5068, 5072, 5073, 5082 ... 5087, 5090, 5091, 5122 ... 5125, 5132 ... 5135, 5140:<br />
Ein interner Softwarefehler ist aufgetreten (Nur f&uuml;r Siemens-interne Fehlerdiagnose).<br />
5012: Fehler bei der Initialisierung des PROFIsafe-Treibers.<br />
5013: Das Ergebnis der Initialisierung ist auf beiden Controllern unterschiedlich.<br />
5022: Fehler bei der Auswertung der F-Parameter. Die Werte der &uuml;bertragenen F-Parameter stimmen nicht mit den erwarteten Werten im PROFIsafe-Treiber &uuml;berein.<br />
5025: Das Ergebnis der F-Parametrierung ist auf beiden Controllern unterschiedlich.<br />
5026: CRC-Fehler bei den F-Parametern. Der &uuml;bertragene CRC-Wert der F-Parameter stimmt nicht mit dem im PST berechneten Wert &uuml;berein.<br />
5065: Beim Empfangen des PROFIsafe-Telegramms wurde ein Kommunikationsfehler festgestellt.<br />
5066: Beim Empfangen des PROFIsafe-Telegramms wurde ein Zeit&uuml;berwachungsfehler festgestellt.<br />
6000 ... 6166:<br />
PROFIsafe-Meldungswerte (PROFIsafe-Treiber f&uuml;r PROFIBUS DP V1&#47;V2 und PROFINET).<br />
Bei diesen Meldungswerten werden Failsafe-Ansteuersignale (Failsafe Values) an die Sicherheitsfunktionen &uuml;bertragen. Ist &quot;Stopp B nach Ausfall der PROFIsafe Kommunikation&quot; (p9612) parametriert, wird die &Uuml;bertragung der Failsafe Values verz&ouml;gert.<br />
Die Bedeutung der einzelnen Meldungswerte ist in der Safety-St&ouml;rung F01611 beschrieben.<br />
7000: Differenz der sicheren Position gr&ouml;&szlig;er als die parametrierte Toleranz (p9542&#47;p9342).<br />
7001: Skalierungswert f&uuml;r die sichere Position in der 16-Bit-Darstellung zu klein (p9574&#47;p9374).<br />
7002: Taktz&auml;hler f&uuml;r die &Uuml;bertragung der sicheren Position in beiden &Uuml;berwachungskan&auml;len unterschiedlich.<br />
7003: Fehler bei der Bereitstellung der Daten f&uuml;r die Funktion &quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot;.<br />
7004: PROFIsafe-Takt nicht richtig auf den DP-Takt einsynchronisiert.<br />
Siehe auch: p9555 (SI Motion Übergangszeit STOP F auf STOP B (Control Unit)), r9725 (SI Motion Diagnose STOP F)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Allgemein gilt:<br />
Die &Uuml;berwachungstakte in beiden Kan&auml;len und die Achstypen sind auf Gleichheit zu &uuml;berpr&uuml;fen und gegebenenfalls gleich einzustellen. Tritt der Fehler trotzdem weiterhin auf, kann eine Vergr&ouml;&szlig;erung der &Uuml;berwachungstakte eine Abhilfe sein.<br />
Zu Meldungswert = 0:<br />
- In diesem &Uuml;berwachungskanal wurde kein Fehler festgestellt. Fehlermeldung des anderen &Uuml;berwachungskanal beachten (bei MM: C30711).<br />
Zu Meldungswert = 3:<br />
Inbetriebnahmephase:<br />
- Geberparameter pr&uuml;fen und gegebenenfalls korrigieren (p9516&#47;p9316, p9517&#47;p9317, p9518&#47;p9318, p9520&#47;p9320, p9521&#47;p9321, p9522&#47;p9322, p9526&#47;p9326).<br />
Im Betrieb:<br />
- Kontrolle des mechanischen Aufbaus und der Gebersignale.<br />
- Wenn Regelung mit Flankenmodulation parametriert ist (p1802[x] = 9): Flankenmodulation f&uuml;r die geberlose Istwerterfassung parametrieren (p9507.5 = p9307.5 = 1).<br />
Zu Meldungswert = 4:<br />
- Die &Uuml;berwachungstakte in beiden Kan&auml;len sind auf Gleichheit zu &uuml;berpr&uuml;fen und gegebenenfalls gleich einzustellen. In Kombination mit Meldungswert 5 vom anderen &Uuml;berwachungskanal (bei MM: C30711) m&uuml;ssen die &Uuml;berwachungstakte gr&ouml;&szlig;er eingestellt werden.<br />
Zu Meldungswert = 11 ... 14:<br />
- Die Grenzwerte in p9534&#47;p9334 oder p9535&#47;p9335 sind ungleich oder zu hoch eingestellt. Werte korrigieren.<br />
Zu Meldungswert = 15 ... 30 und 90 ... 229:<br />
- Die Nockenpositionen f&uuml;r die Funktion SCA in p9536&#47;p9336, p9537&#47;p9337 oder die Nockentoleranz p9540&#47;p9340 sind ungleich. Werte korrigieren. Die Nockentoleranz p9540&#47;p9340 vergr&ouml;&szlig;ern.<br />
Zu Meldungswert = 232:<br />
- Hysteresetoleranz (p9547&#47;p9347) vergr&ouml;&szlig;ern. Eventuell die Filterung gr&ouml;&szlig;er einstellen (p9545&#47;p9345).<br />
Zu Meldungswert = 274, 275:<br />
- Die Nockentoleranz p9540&#47;p9340 und&#47;oder die Positionstoleranz p9542&#47;p9342 vergr&ouml;&szlig;ern.<br />
Zu Meldungswert = 278, 279:<br />
- Kontrolle, ob beide Kan&auml;le die gleiche Beschleunigungsgrenze eingestellt haben. Unterschiedliches Ergebnis ist abh&auml;ngig, ob SLA freigegeben und nicht angew&auml;hlt oder freigegeben und angew&auml;hlt ist. Hier ist ein anderer Meldungswert m&ouml;glich.<br />
Zu Meldungswert = 1 ... 999:<br />
- Wenn der Meldungswert unter Ursache aufgelistet ist: &Uuml;berpr&uuml;fen der kreuzweise verglichenen Parameter, auf die sich der Meldungswert bezieht.<br />
- Safety-Parameter kopieren.<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Software des Motor Modules hochr&uuml;sten.<br />
- Software der Control Unit hochr&uuml;sten.<br />
- Korrektur der Geberbewertung. Die Istwerte sind aufgrund von mechanischen Fehlern (Keilriemen, Fahren auf mechanische Begrenzung, Verschlei&szlig; und zu enge Fenstereinstellung, Geberfehler, ...) unterschiedlich.<br />
Hinweis:<br />
Bei SINAMICS Firmware-Version &gt;= 4.7 wird die KDV-Liste bei Einstellung von p9567 &gt; 0 vergr&ouml;&szlig;ert. Dies kann bei nicht kompatibler Firmware-Version der SINUMERIK zum Fehler beim kreuzweisen Datenvergleich f&uuml;hren (wird mit Meldungswert &gt;= 237 angezeigt). Gegebenenfalls muss p9567 = 0 eingestellt werden oder die Firmware-Version der SINUMERIK hochger&uuml;stet werden.<br />
Zu Meldungswert = 1000:<br />
- Untersuchen des zum sicherheitsgerichteten Eingang zugeh&ouml;rigen Signals (Kontaktprobleme).<br />
Zu Meldungswert = 1001:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Software des Motor Modules hochr&uuml;sten.<br />
- Software der Control Unit hochr&uuml;sten.<br />
Zu Meldungswert = 1002:<br />
- Sichere Quittierung durchf&uuml;hren, Anwenderzustimmung auf beiden &Uuml;berwachungskan&auml;len gleichzeitig setzen (innerhalb von 4 s).<br />
Zu Meldungswert = 1003:<br />
- Achsmechanik kontrollieren. Gegebenenfalls wurde die Achse im ausgeschalteten Zustand verschoben und die zuletzt abgespeicherte Istposition stimmt nicht mehr mit der neuen Istposition beim n&auml;chsten Hochlauf &uuml;berein.<br />
- Toleranz f&uuml;r Istwertvergleich beim Referenzieren erh&ouml;hen (p9544).<br />
Anschlie&szlig;end Istwerte kontrollieren, POWER ON durchf&uuml;hren und Anwenderzustimmung wieder setzen.<br />
Zu Meldungswert = 1004:<br />
Bei 1. gilt: Sichere Quittierung durchf&uuml;hren. Anwenderzustimmung erneut setzen.<br />
Bei 2. gilt: Sichere Quittierung durchf&uuml;hren. Anwenderzustimmung erst setzen, wenn die Achse referenziert ist.<br />
Zu Meldungswert = 1005:<br />
- Bei sicheren Bewegungs&uuml;berwachungen geberlos: Pr&uuml;fen der Bedingungen f&uuml;r Impulsfreigabe.<br />
- Bei sicheren Bewegungs&uuml;berwachungen mit Geber: Pr&uuml;fen der Bedingungen f&uuml;r STO abw&auml;hlen.<br />
Hinweis:<br />
Bei einem Power Module ist der Teststopp generell bei Impulsfreigabe durchzuf&uuml;hren (unabh&auml;ngig von geberlos oder mit Geber).<br />
Zu Meldungswert = 1007:<br />
- Pr&uuml;fen der PLC auf korrekten Betriebszustand (Run-Zustand, Grundprogramm).<br />
Zu Meldungswert = 1008:<br />
- Pr&uuml;fen, ob falsche oder &uuml;berschneidende Adressbereiche im SINUMERIK-Maschinendatum MD10393 eingestellt sind.<br />
Zu Meldungswert = 1011:<br />
- F&uuml;r Diagnose siehe Parameter (r9571).<br />
Zu Meldungswert = 1012:<br />
- Firmware-Version des Sensor Modules auf eine neuere Version hochr&uuml;sten.<br />
- Bei 1-Geber-System gilt: Geberparameter auf Gleichheit pr&uuml;fen (p9515&#47;p9315, p9519&#47;p9319, p9523&#47;p9323, p9524&#47;p9324, p9525&#47;p9325, p9529&#47;p9329).<br />
- Bei 1-Geber-System und 2-Geber-System gilt: Um die Geberparameter aus p04xx korrekt zu kopieren, muss p9700 = 46 und p9701 = 172 eingestellt werden.<br />
- F&uuml;r DQI-Geber gilt: Gegebenenfalls die Firmware-Version der Control Unit auf eine neuere Version hochr&uuml;sten f&uuml;r die der DQI-Geber freigegeben ist.<br />
- Der parametrierte Geber entspricht dem angeschlossenen Geber nicht, Geber umtauschen.<br />
- EMV-gerechten Schaltschrankaufbau und Leitungsverlegung pr&uuml;fen.<br />
- POWER ON bei allen Komponenten (Aus-&#47;Einschalten) oder Warmstart (p0009 = 30, p0976 = 2, 3) durchf&uuml;hren.<br />
- Hardware tauschen.<br />
Zu Meldungswert = 1014:<br />
- Istwerte des Gebers kontrollieren. Gegebenenfalls Positionstoleranz (p9542) und&#47;oder Nockentoleranz (p9540) erh&ouml;hen.<br />
Zu Meldungswert = 1020, 1021, 1024:<br />
- Pr&uuml;fen der Kommunikationsverbindung.<br />
- Gegebenenfalls die &Uuml;berwachungstakte gr&ouml;&szlig;er einstellen (p9500, p9511).<br />
- POWER ON bei allen Komponenten (Aus-&#47;Einschalten) oder Warmstart (p0009 = 30, p0976 = 2, 3) durchf&uuml;hren.<br />
- Hardware tauschen.<br />
Zu Meldungswert = 1033, 1034:<br />
- Gegebenenfalls die Firmware-Version der Control Unit auf eine neuere Version hochr&uuml;sten f&uuml;r die der DQI-Geber freigegeben ist.<br />
Zu Meldungswert = 1035, wenn einer der Safety-Geber getauscht wurde:<br />
- Hardware-Tausch best&auml;tigen (p9700 = 29, p9701 = 236 oder p9702 = 29).<br />
- Alle Parameter speichern (p0977 = 1 bzw. p0971 = 1 oder &quot;RAM nach ROM kopieren&quot;).<br />
- St&ouml;rung quittieren (z. B. Binektoreingang p2103).<br />
Zu Meldungswert = 1039:<br />
- &Uuml;berpr&uuml;fen der Umrechnungsfaktoren wie Spindelsteigung oder Getriebefaktoren.<br />
Zu Meldungswert = 1041:<br />
- &Uuml;berpr&uuml;fen ob gen&uuml;gend Strom im Motor (&gt; r9785[0]) vorhanden ist.<br />
- Minimalstrom reduzieren (p9588).<br />
- Bei Synchronmotoren den Betrag von p9783 erh&ouml;hen.<br />
- &Uuml;berpr&uuml;fen, ob die Funktion &quot;Geregelter Betrieb mit HF-Signalinjektion&quot; aktiviert ist (p1750.5 = 1) und gegebenenfalls deaktivieren.<br />
Zu Meldungswert = 1042:<br />
- Hochlaufgeber Hochlaufzeit&#47;R&uuml;cklaufzeit erh&ouml;hen (p1120&#47;p1121).<br />
- Strom-&#47;Drehzahlregelung auf korrekte Einstellung pr&uuml;fen (Momentenbildender&#47;Feldbildender Strom und Drehzahlistwert darf nicht schwingen).<br />
- Dynamik des Sollwertes reduzieren.<br />
- Strom und Spannungsbetrag pr&uuml;fen und so das Verhalten der Regelung einstellen, dass diese gr&ouml;&szlig;er als 3% der Umrichternnendaten im Betriebsfall bzw. im Fehlerfall sind.<br />
- Minimalstrom erh&ouml;hen (p9588)<br />
Zu Meldungswert = 1043:<br />
- Spannungstoleranz erh&ouml;hen (p9589). Beim Betrieb eines Reluktanzmotors sind die Reglereinstellungen meistens dynamischer gew&auml;hlt. Wenn es bei Werkseinstellung von p9589 zu dieser Meldung kommt, dann ist als Abhilfe die Beschleunigungsgrenze zu erh&ouml;hen (p9589 = 500 ... 1000 %). Dies liefert erfahrungsgem&auml;&szlig; ein robustes Verhalten.<br />
- Hochlaufgeber Hochlaufzeit&#47;R&uuml;cklaufzeit erh&ouml;hen (p1120&#47;p1121).<br />
- Strom-&#47;Drehzahlregelung auf korrekte Einstellung pr&uuml;fen (Momentenbildender&#47;Feldbildender Strom und Drehzahlistwert darf nicht schwingen).<br />
- Dynamik des Sollwertes reduzieren.<br />
Zu Meldungswert = 5000, 5014, 5023, 5024, 5030, 5031, 5032, 5042, 5043, 5052, 5053, 5068, 5072, 5073, 5082 ... 5087, 5090, 5091, 5122 ... 5125, 5132 ... 5135, 5140:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Motor Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
- Firmware auf neuere Version hochr&uuml;sten.<br />
- Technical Support kontaktieren.<br />
- Control Unit austauschen.<br />
Zu Meldungswert = 5012:<br />
- Einstellung der PROFIsafe-Adresse der Control Unit (p9610) und des Motor Modules (p9810) pr&uuml;fen. Die PROFIsafe-Adresse darf nicht 0 oder FFFF sein!<br />
Zu Meldungswert = 5013, 5025:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Einstellung der PROFIsafe-Adresse der Control Unit (p9610) und des Motor Modules (p9810) pr&uuml;fen.<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Motor Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Zu Meldungswert = 5022:<br />
- Einstellung der Werte der F-Parameter am PROFIsafe-Slave pr&uuml;fen (F_SIL, F_CRC_Length, F_Par_Version, F_Source_Add, F_Dest_add, F_WD_Time).<br />
Zu Meldungswert = 5026:<br />
- Einstellung der Werte der F-Parameter und den daraus errechneten F-Parameter-CRC (CRC1) am PROFIsafe-Slave pr&uuml;fen und aktualisieren.<br />
Zu Meldungswert = 5065:<br />
- Projektierung und -Kommunikation am PROFIsafe-Slave pr&uuml;fen (lfdNr&#47;CRC).<br />
- Einstellung des Wertes f&uuml;r F-Parameter F_WD_Time am PROFIsafe-Slave pr&uuml;fen und eventuell vergr&ouml;&szlig;ern.<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Motor Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Zu Meldungswert = 5066:<br />
- Einstellung des Wertes f&uuml;r F-Parameter F_WD_Time am PROFIsafe-Slave pr&uuml;fen und eventuell vergr&ouml;&szlig;ern.<br />
- Diagnoseinformation im F-Host auswerten.<br />
- PROFIsafe-Verbindung &uuml;berpr&uuml;fen.<br />
Zu Meldungswert = 6000 ... 6999:<br />
Siehe Beschreibung der Meldungswerte bei Safety-St&ouml;rung F01611.<br />
Zu Meldungswert = 7000:<br />
- Parametrierte Toleranz vergr&ouml;&szlig;ern (p9542&#47;p9342).<br />
- Istposition von CU (r9713[0] und zweitem Kanal r9713[1] ermitteln und die Differenz auf Plausibilit&auml;t pr&uuml;fen.<br />
- Differenz der Istposition von CU (r9713[0] und zweitem Kanal r9713[1] bei einem 2-Geber-System reduzieren.<br />
Zu Meldungswert = 7001:<br />
- Skalierungswert f&uuml;r die sichere Position in der 16-Bit-Darstellung erh&ouml;hen (p9574&#47;p9374).<br />
- Gegebenenfalls den Verfahrbereich reduzieren.<br />
Zu Meldungswert = 7002:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Motor Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Zu Meldungswert = 7003, 7004:<br />
- Gegebenenfalls die Einstellungen der Zeiten f&uuml;r Tdp, Ti und To anpassen oder &Uuml;berwachungstakt p9500 vergr&ouml;&szlig;ern (Regel Tdp = 2 x n x p9500, n= 1, 2, 3, ... ).<br />
Siehe auch: p9300 (SI Motion Überwachungstakt (Motor Module)), p9500 (SI Motion Überwachungstakt (Control Unit))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201712">C201712</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Defekt bei F-IO-Verarbeitung</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb hat beim kreuzweisen Vergleich der beiden &Uuml;berwachungskan&auml;le einen Unterschied zwischen Parametern oder Ergebnissen der F-IO-Verarbeitung festgestellt und STOP F ausgel&ouml;st. Eine der &Uuml;berwachungen funktioniert nicht mehr zuverl&auml;ssig, d. h. es ist kein sicherer Betrieb mehr m&ouml;glich.<br />
Die Safety-Meldung C01711 mit Meldungswert 0 wird wegen der Ausl&ouml;sung eines STOP F zus&auml;tzlich angezeigt.<br />
Ist mindestens eine &Uuml;berwachungsfunktion aktiv, so wird nach Ablauf der parametrierten Zeitstufe die Safety-Meldung C01701 &quot;SI Motion: STOP B ausgel&ouml;st&quot; ausgegeben.<br />
Meldungswert (r9749, dezimal interpretieren):<br />
Nummer des kreuzweise verglichenen Datums, das zu dieser Meldung gef&uuml;hrt hat.<br />
1: SI Diskrepanz &Uuml;berwachungszeit Eing&auml;nge (p10002, p10102).<br />
2: SI Quittierung internes Ereignis Eingangsklemme (p10006, p10106).<br />
3: SI STO Eingangsklemme (p10022, p10122).<br />
4: SI SS1 Eingangsklemme (p10023, p10123).<br />
5: SI SS2 Eingangsklemme (p10024, p10124).<br />
6: SI SOS Eingangsklemme (p10025, p10125).<br />
7: SI SLS Eingangsklemme (p10026, p10126).<br />
8: SI SLS_Limit(1) Eingangsklemme (p10027, p10127).<br />
9: SI SLS_Limit(2) Eingangsklemme (p10028, p10128).<br />
10: SI Safe State Signalauswahl (p10039, p10139).<br />
11 SI F-DI Eingangsmodus (p10040, p10140).<br />
12: SI F-DO 0 Signalquellen (p10042, p10142).<br />
13: Zustand der statisch inaktiven Signalquellen unterschiedlich (p10006, p10022 ... p10031).<br />
14: SI Diskrepanz &Uuml;berwachungszeit Ausg&auml;nge (p10002, p10102).<br />
15: SI Quittierung Internes Ereignis (p10006, p10106).<br />
16: SI Test Sensor R&uuml;ckmeldung Auswahl Testmodus f&uuml;r Teststop (p10046, p10146, p10047, p10147) .<br />
17: SI Wartezeit f&uuml;r Teststop an DOs (p10001).<br />
18 ... 25: SI Test Sensor R&uuml;ckmeldung (p10046, p10146, p10047, p10147). Erwartungshaltung internes R&uuml;cklesesignal, gebildet durch den ausgew&auml;hlten Teststop-Modus.<br />
26 ... 33: SI Test Sensor R&uuml;ckmeldung (p10046, p10146, p10047, p10147). Erwartungshaltung externes R&uuml;cklesesignal, gebildet durch den ausgew&auml;hlten Teststop-Modus.<br />
34 ... 41: SI Test Sensor R&uuml;ckmeldung (p10046, p10146, p10047, p10147). Erwartungshaltung zweites internes R&uuml;cklesesignal, gebildet durch den ausgew&auml;hlten Teststop-Modus.<br />
42: Internes Datum f&uuml;r Verarbeitung des zweiten internen R&uuml;cklesesignals, gebildet durch den ausgew&auml;hlten Teststop-Modus (p10047, p10147).<br />
43: Internes Datum f&uuml;r Verarbeitung des internen R&uuml;cklesesignals, gebildet durch den ausgew&auml;hlten Teststop-Modus (p10047, p10147).<br />
44: Internes Datum f&uuml;r Verarbeitung des externen R&uuml;cklesesignals, gebildet durch den ausgew&auml;hlten Teststop-Modus (p10047, p10147).<br />
45: Internes Datum f&uuml;r Initialisierungszustand des Teststop-Moduls, abh&auml;ngig von Teststop-Parametern.<br />
46: SI Digitaleing&auml;nge Entprellzeit (p10017, p10117).<br />
47: Auswahl F-DI f&uuml;r PROFIsafe (p10050, p10150).<br />
48: Maske der verwendeten F-DIs (p10006, p10022 ... p10031).<br />
49: SI SDI Positiv Eingangsklemme (p10030, p10130).<br />
50: SI SDI Negativ Eingangsklemme (p10031, p10131).<br />
51: SI SLP Eingangsklemme (p10032, p10132).<br />
52: SI SLP Select Eingangsklemme (p10033, p10133).<br />
53: Internes Datum f&uuml;r Freifahrlogik (p10009, p100109).<br />
54: SI F-DI f&uuml;r Freifahren SLP (p10009, p100109).<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Parametrierung in den betroffenen Parametern kontrollieren und gegebenenfalls korrigieren.<br />
- Gleichheit durch Kopieren der SI-Daten auf den zweiten Kanal sicherstellen und danach einen Abnahmetest durchf&uuml;hren.<br />
- &Uuml;berwachungstakt in p9500 und p9300 auf Gleichheit kontrollieren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Siehe auch: p9300 (SI Motion Überwachungstakt (Motor Module)), p9500 (SI Motion Überwachungstakt (Control Unit))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201714">C201714</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Sicher begrenzte Geschwindigkeit &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb hat sich schneller bewegt als durch den Geschwindigkeitsgrenzwert (p9531) vorgegeben. Der Antrieb wird durch die projektierte Stopreaktion stillgesetzt (p9563).<br />
Meldungswert (r9749, dezimal interpretieren):<br />
100: SLS1 &uuml;berschritten.<br />
200: SLS2 &uuml;berschritten.<br />
300: SLS3 &uuml;berschritten.<br />
400: SLS4 &uuml;berschritten.<br />
1000: Gebergrenzfrequenz &uuml;berschritten.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Verfahrprogramm auf der Steuerung &uuml;berpr&uuml;fen.<br />
- Grenzwerte f&uuml;r SLS &uuml;berpr&uuml;fen und gegebenenfalls anpassen (p9531).<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SLS: Safely-Limited Speed (Sicher begrenzte Geschwindigkeit) &#47; SG: Safely reduced speed (Sicher reduzierte Geschwindigkeit)<br />
Siehe auch: p9531, p9563<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201715">C201715</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Sicher begrenzte Position &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Achse ist &uuml;ber eine parametrierte Position hinausgefahren, die durch die Funktion &quot;SLP&quot; &uuml;berwacht wird.<br />
Meldungswert (r9749, dezimal interpretieren):<br />
10: SLP1 verletzt.<br />
20: SLP2 verletzt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Verfahrprogramm auf der Steuerung &uuml;berpr&uuml;fen.<br />
- Grenzen f&uuml;r die Funktion &quot;SLP&quot; &uuml;berpr&uuml;fen und gegebenenfalls anpassen (p9534, p9535).<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
Voraussetzung:<br />
- Funktion &quot;SLP&quot; abw&auml;hlen und Achse in den erlaubten Positionsbereich freifahren.<br />
Sichere Quittierung &uuml;ber eine der folgenden M&ouml;glichkeiten durchf&uuml;hren:<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SLP: Safely-Limited Position (Sicher begrenzte Position) &#47; SE: Safe software limit switches (Sicherer Software-Endschalter)<br />
Siehe auch: p9534, p9535<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201716">C201716</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Es wurde die Toleranz bei der Funktion &quot;Sichere Bewegungsrichtung&quot; &uuml;berschritten. Der Antrieb wird durch die projektierte Stopreaktion stillgesetzt (p9566).<br />
Meldungswert (r9749, dezimal interpretieren):<br />
0: Die Toleranz f&uuml;r die Funktion &quot;Sichere Bewegungsrichtung positiv&quot; &uuml;berschritten.<br />
1: Die Toleranz f&uuml;r die Funktion &quot;Sichere Bewegungsrichtung negativ&quot; &uuml;berschritten.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Verfahrprogramm auf der Steuerung &uuml;berpr&uuml;fen.<br />
- Toleranz f&uuml;r die Funktion &quot;SDI&quot; &uuml;berpr&uuml;fen und gegebenenfalls anpassen (p9564).<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
Voraussetzung:<br />
- Funktion &quot;SDI&quot; abw&auml;hlen und gegebenenfalls wieder anw&auml;hlen.<br />
Sichere Quittierung &uuml;ber eine der folgenden M&ouml;glichkeiten durchf&uuml;hren:<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SDI: Safe Direction (Sichere Bewegungsrichtung)<br />
SI: Safety Integrated<br />
Siehe auch: p9564, p9565, p9566<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201717">C201717</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): SLA Begrenzung &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Es wurde die Beschleunigungsgrenze bei der Funktion &quot;Sicher begrenzte Beschleunigung&quot; &uuml;berschritten. Der Antrieb wird durch die projektierte Stoppreaktion stillgesetzt (p9579).<br />
Meldungswert (r9749, dezimal interpretieren):<br />
0: Die &Uuml;berwachung der grob aufgel&ouml;sten Beschleunigung hat die Beschleunigungsgrenze verletzt.<br />
1: Die &Uuml;berwachung der fein aufgel&ouml;sten und gegebenenfalls gefilterten Beschleunigung hat die Beschleunigungsgrenze verletzt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Verfahrprogramm auf der Steuerung &uuml;berpr&uuml;fen.<br />
- Beschleunigungsgrenze f&uuml;r die Funktion &quot;SLA&quot; &uuml;berpr&uuml;fen und gegebenenfalls anpassen (p9578).<br />
- Sichere Quittierung durchf&uuml;hren.<br />
Zu Meldungswert = 0:<br />
Analyse der Ursachen mit r9714[0] und r9714[3] durchf&uuml;hren.<br />
Zu Meldungswert = 1:<br />
Analyse der Ursachen mit r9789[0], r9789[1] und r9789[2] durchf&uuml;hren.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SLA: Safely-Limited Acceleration (Sicher begrenzte Beschleunigung)<br />
Siehe auch: p9578 (SI Motion SLA Beschleunigungsgrenze (CU)), p9579 (SI Motion SLA Stoppreaktion (Control Unit))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201730">C201730</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Bezugssatz f&uuml;r dynamische sicher begrenzte Geschwindigkeit ung&uuml;ltig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der &uuml;ber PROFIsafe &uuml;bertragene Bezugssatz ist negativ.<br />
Ein Bezugssatz wird zur Bildung eines bezogenen Geschwindigkeitsgrenzwertes auf Basis der Bezugsgr&ouml;&szlig;e &quot;Geschwindigkeitsgrenzwert SLS1&quot; (p9531[0]) verwendet.<br />
Der Antrieb wird durch die projektierte Stopreaktion stillgesetzt (p9563[0]).<br />
Meldungswert (r9749, dezimal interpretieren):<br />
Angeforderter, ung&uuml;ltiger Bezugssatz.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Im PROFIsafe-Telegramm das Eingangsdatum S_SLS_LIMIT_IST korrigieren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- PROFIsafe.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SLS: Safely-Limited Speed (Sicher begrenzte Geschwindigkeit) &#47; SG: Safely reduced speed (Sicher reduzierte Geschwindigkeit)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201745">C201745</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Bremsmoment beim Bremsentest &uuml;berpr&uuml;fen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>POWER ON ( (SOFORT, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>&Uuml;ber den Parameter p2003 wurde die Normierung des Bremsmoments f&uuml;r den Bremsentest ver&auml;ndert.<br />
F&uuml;r den Bremsentest muss erneut ein Abnahmetest durchgef&uuml;hrt werden. Damit wird festgestellt, ob der Bremsentest noch mit dem korrekten Bremsmoment durchgef&uuml;hrt wird.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Abnahmetest f&uuml;r den sicheren Bremsentest wiederholen, wenn der Bremsentest verwendet wird.<br />
Siehe auch: p2003<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201750">C201750</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Hardware-Fehler sicherer Geber</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Geber, der f&uuml;r die sicheren Bewegungs&uuml;berwachungen verwendet wird, liefert einen Hardware-Fehler.<br />
Meldungswert (r9749, dezimal interpretieren):<br />
Geberstatuswort 1, Geberstatuswort 2, die zu der Meldung gef&uuml;hrt haben.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Anschluss des Gebers &uuml;berpr&uuml;fen.<br />
- Geber tauschen.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis zum Gebertausch bei Fremdmotor:<br />
Zum Quittieren dieser Safety-Meldung muss die Seriennummer des Gebers kopiert werden.<br />
Das kann &uuml;ber p0440 = 1 oder p1990 = 1 ausgef&uuml;hrt werden.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201751">C201751</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Wirksamkeitstest-Fehler sicherer Geber</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der DRIVE-CLiQ-Geber f&uuml;r die sicheren Bewegungs&uuml;berwachungen liefert einen Fehler bei den Wirksamkeitstests.<br />
Meldungswert (r9749, dezimal interpretieren):<br />
Nur f&uuml;r Siemens-interne Fehlerdiagnose.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Anschluss des Gebers &uuml;berpr&uuml;fen.<br />
- Geber tauschen.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201752">C201752</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Referenzposition ung&uuml;ltig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die &uuml;bertragene Referenzposition ist ung&uuml;ltig<br />
Meldungswert (r9749, dezimal interpretieren):<br />
1: Direkte &Uuml;bernahme der Referenzposition (p9573=89) ist nicht m&ouml;glich.<br />
2: &Uuml;bernahme der Referenzposition in der Bewegung ist nicht m&ouml;glich.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Achse&#47;Geber entparken.<br />
- Geberfehler quittieren.<br />
- Getriebestufenumschaltung deaktivieren.<br />
- Beim Referenzieren &uuml;ber Safety Control Channel (SCC) die Funktion &quot;Referenzieren &uuml;ber SCC&quot; freigeben (p9501.27&#47;9301.27).<br />
Diese Meldung kann wie folgt quittiert werden:<br />
- Antriebsintegrierte Bewegungs&uuml;berwachungen: &Uuml;ber Terminal Module 54F (TM54F) oder PROFIsafe<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201780">A201780</a></b></td>
<td><b>&lt;Ortsangabe&gt;SBT Bei Anwahl ist Bremse geschlossen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Bei Anwahl des Bremsentests oder Start des Bremsentests waren nicht alle Bremsen offen.<br />
Warnwert (r2124, bin&auml;r interpretieren):<br />
Bit 0 = 1:<br />
Die interne Bremse ist geschlossen.<br />
Bit 1 = 1:<br />
Die externe Bremse ist geschlossen (p10230.5, p10235.5, p10202).<br />
Hinweis:<br />
Die Warnung wird auch gemeldet, wenn in p10202 keine Bremsen konfiguriert sind.<br />
SBT: Safe Brake Test (Sicherer Bremsentest)<br />
Siehe auch: p10202, p10230, p10235<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Alle Bremsen &ouml;ffnen und Anwahl des Bremsentests wiederholen (p10230.0, p10235.0).<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201781">A201781</a></b></td>
<td><b>&lt;Ortsangabe&gt;SBT &Ouml;ffnungszeit der Bremse &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Maximalzeit (11 s) zum &Ouml;ffnen der Bremse w&auml;hrend des Bremsentests wurde &uuml;berschritten.<br />
M&ouml;gliche Ursachen:<br />
- Der Antrieb ist w&auml;hrend des Bremsentests in St&ouml;rung gegangen und somit wurde die Bremse durch den Antrieb geschlossen.<br />
- Bei einer externen Bremse wurde die R&uuml;ckmeldung &quot;Bremse geschlossen&quot; zu lange gemeldet (p10230.5, p10235).<br />
Warnwert (r2124, bin&auml;r interpretieren):<br />
Bit 0 = 1:<br />
Interne Bremse konnte nicht ge&ouml;ffnet werden.<br />
Bit 1 = 1:<br />
Externe Bremse konnte nicht ge&ouml;ffnet werden.<br />
Hinweis:<br />
SBT: Safe Brake Test (Sicherer Bremsentest)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Sichere Quittierung durchf&uuml;hren.<br />
- Bremsentest erneut starten (p10230.1, p10235.1).<br />
Siehe auch: p10230, p10235<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201782">A201782</a></b></td>
<td><b>&lt;Ortsangabe&gt;SBT Bremsentest Ansteuerung fehlerhaft</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Bremsentest wurde wegen fehlerhafter Ansteuerung abgebrochen.<br />
Warnwert (r2124, bin&auml;r interpretieren):<br />
Warnwert 0:<br />
Der Bremsentest wurde aufgrund eines Fehlers abgebrochen (Brems&ouml;ffnungszeit oder Bremsschlie&szlig;zeit &uuml;berschritten).<br />
Bit 0:<br />
Der sichere Bremsentest wurde durch R&uuml;cksetzen der Anwahl des Bremsentests abgebrochen.<br />
Bit 1:<br />
Der sichere Bremsentest wurde durch R&uuml;cksetzen des Starts des Bremsentests abgebrochen.<br />
Bit 2:<br />
Die Bremse, die beim Start des Bremsentests angew&auml;hlt wurde, ist nicht in p10202 konfiguriert.<br />
Beim Start des Bremsentests durch die Teststopp-Anwahl ist Bremse 1 nicht als interne Bremse konfiguriert.<br />
Es liegt ein Konfigurationsfehler des Bremsentests vor. In diesem Fall wird zus&auml;tzlich Warnung A01785 ausgegeben.<br />
Hinweis:<br />
SBT: Safe Brake Test (Sicherer Bremsentest)<br />
Siehe auch: p10202 (SI Motion SBT Bremse Auswahl)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Parametrierung des Bremsentests &uuml;berpr&uuml;fen (p10202).<br />
- &Uuml;berpr&uuml;fen, ob die Warnung A01785 ansteht und gegebenenfalls auswerten.<br />
- Sichere Quittierung durchf&uuml;hren.<br />
- Bremsentest gegebenenfalls erneut starten.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201783">A201783</a></b></td>
<td><b>&lt;Ortsangabe&gt;SBT Schlie&szlig;zeit der Bremse &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Maximalzeit (11 s) zum Schlie&szlig;en der Bremse w&auml;hrend des Bremsentests wurde &uuml;berschritten.<br />
Warnwert (r2124, bin&auml;r interpretieren):<br />
Bit 0 = 1:<br />
Interne Bremse konnte nicht geschlossen werden.<br />
Bit 1 = 1:<br />
Externe Bremse konnte nicht geschlossen werden.<br />
Hinweis:<br />
SBT: Safe Brake Test (Sicherer Bremsentest)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Bei Verwendung einer externen Bremse pr&uuml;fen, ob das R&uuml;ckmeldesignal &quot;Bremse geschlossen&quot; korrekt mit dem Steuerwort des Bremsentests verschaltet ist (p10230.5, p10235.5).<br />
- Bei Verwendung einer internen Bremse mit externer R&uuml;ckmeldung pr&uuml;fen, ob das R&uuml;ckmeldesignal korrekt mit der erweiterten Bremsenansteuereung verschaltet.<br />
- Sichere Quittierung durchf&uuml;hren.<br />
- Bremsentest erneut starten (p10230.1, p10235.1).<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201784">A201784</a></b></td>
<td><b>&lt;Ortsangabe&gt;SBT Bremsentest mit Fehler abgebrochen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der sichere Bremsentest wurde aufgrund eines Fehlers abgebrochen.<br />
Warnwert (r2124, bin&auml;r interpretieren):<br />
Bit 17 = 1: Fehler im Ablauf des Bremsentests (Ursache siehe Bit 0 ... 10).<br />
Bit 18 = 1: Die interne Bremse ist geschlossen. Sie muss beim Test der externen Bremse ge&ouml;ffnet sein (p10202).<br />
Bit 19 = 1: Die externe Bremse ist geschlossen. Sie muss beim Test der internen Bremse ge&ouml;ffnet sein (p10202).<br />
Bit 20 = 1: Es sind nicht alle Bremsen ge&ouml;ffnet (p10202).<br />
Bit 21 = 1: Achsposition w&auml;hrend des Bremsentests aufgrund parkender Achse ung&uuml;ltig.<br />
Bit 22 = 1: Interner Softwarefehler.<br />
Bit 23 = 1: Der zul&auml;ssige Positionsbereich der Achse bei geschlossener Bremse wurde verletzt (p10212&#47;p10222).<br />
Bit 24 = 1: Die getestete interne Bremse wurde w&auml;hrend des aktiven Bremsentests ge&ouml;ffnet.<br />
Bit 25 = 1: Die getestete externe Bremse wurde w&auml;hrend des aktiven Bremsentests ge&ouml;ffnet.<br />
Bit 26 = 1: W&auml;hrend des aktiven Bremsentests hat das Testmoment sein Toleranzband (20 %) verlassen.<br />
Ursache zu Warnwert Bit 17:<br />
Bit 0 = 1: Betrieb bei Anwahl des Bremsentests nicht freigegeben (r0899.2 = 0).<br />
Bit 1 = 1: Externer Fehler aufgetreten (z. B. gestarteter Bremsentest wird durch Anwender abgebrochen).<br />
Bit 2 = 1: Eine Bremse ist bei Anwahl des Bremsentests geschlossen.<br />
Bit 3 = 1: Eine Bremse ist bei Ermittlung des Lastmoments geschlossen.<br />
Bit 4 = 1: Es ist ein Fehler mit einer Stoppreaktion aufgetreten (z. B. AUS1, AUS2, AUS3) oder die Impulsfreigabe wurde zur&uuml;ckgenommen (z. B. STO angew&auml;hlt oder Betrieb nicht mehr freigegeben).<br />
Bit 5 = 1: Die Solldrehzahl der Achse ist bei Anwahl des Bremsentests zu hoch.<br />
Bit 6 = 1: Die Istdrehzahl (r0063) der Achse ist zu hoch (z. B. Bremse h&auml;lt nicht w&auml;hrend des Bremsentests).<br />
Bit 7 = 1: Falscher Modus im Drehzahlregler (z. B. geberlose Drehzahlregelung oder U&#47;f-Betrieb).<br />
Bit 8 = 1: Regelung nicht freigegeben oder Funktionsgenerator aktiv.<br />
Bit 9 = 1: Regelung schaltet nicht auf Bremsentest um (z. B. weil keine PI-Drehzahlregelung parametriert ist).<br />
Bit 10 = 1: Momentengrenze erreicht (r1407.7, r1408.8).<br />
Hinweis:<br />
SBT: Safe Brake Test (Sicherer Bremsentest)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Ursache des Fehlers beheben.<br />
- Sichere Quittierung durchf&uuml;hren.<br />
- Bremsentest gegebenenfalls erneut starten.<br />
Zu Bit 17 = 1 mit Bit 6 = 1 oder Bit 23 = 1:<br />
Wenn die Bremsenschlie&szlig;zeit der Motorhaltebremse (p1217) zu gering eingestellt ist, wird die Bremse beim Start des Bremsentests zu sp&auml;t geschlossen. Die Bremsenschlie&szlig;zeit ist anzupassen (p1217).<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201785">A201785</a></b></td>
<td><b>&lt;Ortsangabe&gt;SBT Bremsentest Konfigurationsfehler</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Fehler bei der Parametrierung des Bremsentests.<br />
Der Bremsentest kann in dieser Konfiguration nicht oder nicht fehlerfrei gestartet werden.<br />
Warnwert (r2124, dezimal interpretieren):<br />
1:<br />
Es sind keine Bewegungs&uuml;berwachungsfunktionen freigegeben.<br />
2:<br />
Es wurden zwei interne Bremsen konfiguriert (p10202).<br />
4:<br />
Es wurde keine Bremsen konfiguriert (p10202).<br />
8:<br />
Der Bremsentest ist f&uuml;r eine interne Bremse konfiguriert, aber die sichere Bremsenansteuerung ist nicht freigegeben (p9602&#47;p9802).<br />
Hinweis:<br />
Ab Firmware-Version 5.1 ist SBT ohne SBC auch f&uuml;r die interne Bremse erlaubt.<br />
16:<br />
Der sichere Bremsentest und Safety ohne Geber ist gleichzeitig freigegeben (p9306&#47;p9506). Dies ist nicht zul&auml;ssig.<br />
32:<br />
Der sichere Bremsentest und Vektor U&#47;f-Steuerung ist freigegeben. Der sichere Bremsentest ist in dieser Regelungsart nicht m&ouml;glich.<br />
Hinweis:<br />
SBC: Safe Brake Control (Sichere Bremsenansteuerung)<br />
SBT: Safe Brake Test (Sicherer Bremsentest)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Parametrierung des Bremsentests &uuml;berpr&uuml;fen.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201786">F201786</a></b></td>
<td><b>&lt;Ortsangabe&gt;SCC Signalquelle ge&auml;ndert</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Signalquelle in p10235 oder p10250 wurde ge&auml;ndert.<br />
Die neue Signalquelle ist sofort wirksam.<br />
Hinweis:<br />
SCC: Safety Control Channel<br />
Siehe auch: p10235 (SI Safety Control Channel Steuerwort S_STW3B), p10250 (SI Safety Control Channel Steuerwort S_STW1B)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Fehler quittieren.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201787">F201787</a></b></td>
<td><b>&lt;Ortsangabe&gt;SBT Motortyp unterschiedlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der f&uuml;r den sicheren Bremsentest eingestellte Motortyp (p10204) stimmt nicht mit dem &uuml;ber Funktionsmodul eingestellten Motortyp (r0108.12) &uuml;berein.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Den f&uuml;r den sicheren Bremsentest eingestellten Motortyp anpassen.<br />
Hinweis:<br />
Alle Parameter f&uuml;r den Bremsentest, deren Einheit vom Motortyp abh&auml;ngt, sind zu &uuml;berpr&uuml;fen.<br />
Siehe auch: p10204, p10209<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201788">A201788</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI: Automatischer Teststopp wartet auf STO-Abwahl &uuml;ber Bewegungs&uuml;berwachungen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der automatische Teststopp (Zwangsdynamisierung) konnte nach dem Hochlauf noch nicht durchgef&uuml;hrt werden.<br />
M&ouml;gliche Ursachen:<br />
- Die Funktion STO ist &uuml;ber sichere Bewegungs&uuml;berwachungen angew&auml;hlt.<br />
- Es steht eine Safety-Meldung an, die zum STO gef&uuml;hrt hat.<br />
Hinweis:<br />
STO: Safe Torque Off (Sicher abgeschaltetes Moment)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- STO &uuml;ber sichere Bewegungs&uuml;berwachungen abw&auml;hlen.<br />
- Ursache f&uuml;r anstehende Safety-Meldungen beheben und Meldungen quittieren.<br />
Hinweis:<br />
Nach Beseitigung der Ursache wird der automatische Teststopp durchgef&uuml;hrt.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201789">A201789</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI: Automatischer Teststopp und Bremsentest bei Teststopp-Anwahl nicht erlaubt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Parametrierung des automatischen Teststopps (p9507.6&#47;p9307.6) und des Bremsentests bei Teststopp-Anwahl (p10203 = 2) ist unzul&auml;ssig.<br />
Der Teststopp wird im Hochlauf nicht automatisch durchgef&uuml;hrt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Parametrierung korrigieren.<br />
- Parameter p10203 ungleich 2 einstellen oder den automatischen Teststopp deaktivieren.<br />
Hinweis:<br />
Um den automatischen Teststopp durchzuf&uuml;hren ist ein Warmstart oder POWER ON notwendig.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201794">A201794 (N)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Modulowert bei Sichere Position &uuml;ber PROFIsafe pr&uuml;fen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Parametrierung des Modulowertes bei Sichere Position &uuml;ber PROFIsafe (p9505) kann zu einem Sprung des Lageistwerts bei &Uuml;berlauf des darstellbaren Bereichs f&uuml;hren.<br />
Darstellbarer Bereich:<br />
- 32-Bit-Wert: +&#47;-2048 Umdrehungen<br />
- 16-Bit-Wert: +&#47;-2048 Umdrehungen (abh&auml;ngig von p9574)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Parametrierung korrigieren.<br />
Setzen Sie p9505 gleich 2^n Umdrehungen und gleich ganze Umdrehungen (also Vielfaches von 360 &deg;).<br />
Hinweis:<br />
Diese Warnung ist ausblendbar f&uuml;r den Fall, dass der m&ouml;gliche Sprung des Lageistwerts f&uuml;r die jeweilige Applikation tolerierbar ist bzw. kein Problem darstellt, weil beispielsweise der parametrierte Modulobereich &quot;fast ganzzahlig&quot; in den darstellbaren Bereich von +&#47;-2048 Umdrehungen passt.<br />
Zum Umparametrieren der Warnung auf &quot;NO REPORT&quot; darf sie allerdings nicht gerade anstehen. Somit ist folgende Sequenz f&uuml;r die Umparametrierung notwendig:<br />
- p9505 korrigieren auf &quot;2^n&quot;.<br />
- Warnung umparametrieren mit Hilfe von p2118 und p2119.<br />
- p9505 wieder auf den gew&uuml;nschten Wert einstellen.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201795">A201795</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Wartezeit nach Verlassen der Sicheren Impulsl&ouml;schung abgelaufen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die geberlose Istwerterfassung bei den Erweiterten Funktionen ohne Anwahl konnte nach Verlassen der Sicheren Impulsl&ouml;schung innerhalb der Wartezeit von 5 Sekunden nicht aktiviert werden.<br />
Es wurde wieder in den Zustand &quot;Sichere Impulsl&ouml;schung&quot; gewechselt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Fehlende Freigaben pr&uuml;fen, die ein in Betrieb setzen der Antriebsregelung verhindern (r0046).<br />
- Eventuell anstehende Fehlermeldungen der geberlosen Istwerterfassung auswerten und beseitigen.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201796">A201796 (F, N)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Warten auf Kommunikation</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wartet auf den Kommunikationsaufbau f&uuml;r die Ausf&uuml;hrung der sicheren Funktionen.<br />
Hinweis:<br />
In diesem Zustand ist STO aktiv.<br />
Warnwert (r2124, dezimal interpretieren):<br />
1: Warten auf Kommunikationsaufbau mit SINUMERIK.<br />
2: Warten auf Kommunikationsaufbau mit TM54F.<br />
3: Warten auf Kommunikationsaufbau mit PROFIsafe F-Host.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Wird die Meldung nach l&auml;ngerer Zeit nicht automatisch zur&uuml;ckgenommen, sind abh&auml;ngig von der Kommunikation folgende &Uuml;berpr&uuml;fungen durchzuf&uuml;hren:<br />
Bei Kommunikation mit SINUMERIK gilt:<br />
- Weitere anstehende Meldungen zur PROFIBUS-Kommunikation pr&uuml;fen und beseitigen.<br />
- Korrekte Zuordnung der Achsen auf der &uuml;bergeordneten Steuerung zu den Antrieben im Antriebsger&auml;t pr&uuml;fen.<br />
- Freigabe der sicheren Bewegungs&uuml;berwachungsfunktionen f&uuml;r die korrespondierende Achse auf der &uuml;bergeordneten Steuerung pr&uuml;fen und gegebenenfalls setzen.<br />
Bei Kommunikation mit TM54F gilt:<br />
- Weitere anstehende Meldungen zur DRIVE-CLiQ-Kommunikation mit TM54F pr&uuml;fen und beseitigen.<br />
- Einstellung von p10010 &uuml;berpr&uuml;fen. Es m&uuml;ssen alle durch das TM54F angesteuerten Antriebsobjekte aufgelistet sein.<br />
Bei Kommunikation mit PROFIsafe F-Host gilt:<br />
- Weitere anstehende Meldungen zur PROFIsafe-Kommunikation auswerten.<br />
- Betriebszustand des F-Hosts &uuml;berpr&uuml;fen.<br />
- Kommunikationsverbindung zum F-Host &uuml;berpr&uuml;fen.<br />
- Kommunikationsverbindung zum Motor Module&#47;Hydraulic Module &uuml;berpr&uuml;fen. Es ist sicherzustellen, dass das Motor Module&#47;Hydraulic Module beim Hochlauf der Control Unit angeschlossen ist und sp&auml;testens mit der Control Unit auch eingeschaltet wird. Andernfalls muss beim nachtr&auml;glichen Stecken oder Einschalten des Motor Modules&#47;Hydraulic Modules ein POWER ON an der Control Unit durchgef&uuml;hrt werden.<br />
Hinweis:<br />
STO: Safe Torque Off (Sicher abgeschaltetes Moment)<br />
Siehe auch: p9601, p9801, p10010<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201797">C201797</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Achse nicht sicher referenziert</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die vor dem Ausschalten gespeicherte Stillstandsposition stimmt nicht mit der beim Einschalten festgestellten Istposition &uuml;berein.<br />
Meldungswert (r9749, dezimal interpretieren):<br />
1: Achse nicht sicher referenziert.<br />
2: Anwenderzustimmung fehlt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Ist kein sicheres automatisches Referenzieren m&ouml;glich, so muss der Anwender &uuml;ber Softkey f&uuml;r die neue Position eine Anwenderzustimmung geben. Damit wird diese Position als sicher gekennzeichnet.<br />
Hinweis:<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201798">C201798</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Teststopp f&uuml;r Bewegungs&uuml;berwachungen l&auml;uft</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Zwangsdynamisierung (Teststopp) f&uuml;r die sicheren Bewegungs&uuml;berwachungsfunktionen wird gerade durchgef&uuml;hrt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Keine notwendig.<br />
Die Meldung wird automatisch mit Beenden des Teststopps zur&uuml;ckgenommen.<br />
Hinweis:<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201799">C201799</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Abnahmetestmodus aktiv</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Abnahmetestmodus ist aktiv.<br />
Das bedeutet folgendes:<br />
- Die Sollwertgeschwindigkeitsbegrenzung ist deaktiviert (r9733).<br />
- Die Standard-Endschalter sind w&auml;hrend des Abnahmetests der Funktion SLP (SE) deaktiviert (bei EPOS intern, sonst &uuml;ber r10234).<br />
- Bei Sicherheitsfunktionen mit SINUMERIK gilt: Die POWER ON-Meldungen der sicheren Bewegungs&uuml;berwachungsfunktionen k&ouml;nnen w&auml;hrend des Abnahmetests mit den Quittierungsm&ouml;glichkeiten der &uuml;bergeordneten Steuerung quittiert werden.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Keine notwendig.<br />
Die Meldung wird mit Verlassen des Abnahmetestmodus zur&uuml;ckgenommen.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SLP: Safely-Limited Position (Sicher begrenzte Position) &#47; SE: Safe software limit switches (Sicherer Software-Endschalter)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201800">F201800 (A)</a></b></td>
<td><b>&lt;Ortsangabe&gt;DRIVE-CLiQ: Hardware&#47;Konfiguration fehlerhaft</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>Infeed: KEINE<br />
 (AUS1, AUS2)Servo: KEINE<br />
 (AUS1, AUS2, AUS3, IASC/DCBRK, STOP2)Vector: KEINE<br />
 (AUS1, AUS2, AUS3, IASC/DCBRK, STOP2)Hla: KEINE<br />
 (AUS1, AUS2, AUS3, STOP2)</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Es ist ein Fehler bei der DRIVE-CLiQ-Verbindung aufgetreten.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
100 ... 107:<br />
Die Kommunikation &uuml;ber DRIVE-CLiQ-Buchse X100 ... X107 ist nicht in den zyklischen Betrieb gewechselt. Die Ursache kann ein fehlerhafter Aufbau oder eine Konfiguration sein, die zu unm&ouml;glichem Bustiming f&uuml;hrt.<br />
10:<br />
Verlust der DRIVE-CLiQ-Verbindung. Die Ursache kann z. B. das Abziehen der DRIVE-CLiQ-Leitung von der Control Unit sein oder durch Kurzschluss bei Motoren mit DRIVE-CLiQ entstehen. Dieser Fehler ist erst bei zyklischer Kommunikation quittierbar.<br />
11:<br />
Wiederholte Fehler bei der Verbindungserkennung. Dieser Fehler ist erst bei zyklischer Kommunikation quittierbar.<br />
12:<br />
Eine Verbindung wurde erkannt aber der Austausch der Teilnehmerkennung funktioniert nicht. Die Ursache ist wahrscheinlich eine defekte Komponente. Dieser Fehler ist erst bei zyklischer Kommunikation quittierbar.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zu St&ouml;rwert = 100 ... 107:<br />
- Einheitliche Firmware-Version in den DRIVE-CLiQ-Komponenten sicherstellen.<br />
- Vermeidung langer Topologien bei kleinen Stromreglerabtastzeiten.<br />
Zu St&ouml;rwert = 10:<br />
- DRIVE-CLiQ-Leitungen an der Control Unit pr&uuml;fen.<br />
- M&ouml;glichen Kurzschluss bei Motoren mit DRIVE-CLiQ beseitigen.<br />
- POWER ON durchf&uuml;hren.<br />
Zu St&ouml;rwert = 11:<br />
- EMV-gerechten Schaltschrankaufbau und Leitungsverlegung pr&uuml;fen.<br />
Zu St&ouml;rwert = 12:<br />
- Betreffende Komponente austauschen.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201839">A201839</a></b></td>
<td><b>&lt;Ortsangabe&gt;DRIVE-CLiQ-Diagnose: Leitungsfehler zu Komponente</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Fehlerz&auml;hler (r9936[0...199]) f&uuml;r die &Uuml;berwachung der DRIVE-CLiQ-Verbindungen&#47;Leitungen hat sich erh&ouml;ht.<br />
Warnwert (r2124, dezimal interpretieren):<br />
Komponentennummer.<br />
Hinweis:<br />
Die Komponentennummer gibt die Komponente an, deren Zuleitung aus Richtung der Control Unit gest&ouml;rt ist.<br />
Die Warnung wird nach 5 s automatisch zur&uuml;ckgenommen, wenn keine weiteren &Uuml;bertragungsfehler aufgetreten sind.<br />
Siehe auch: r9936 (DRIVE-CLiQ-Diagnose Fehlerzähler Verbindung)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Entsprechende DRIVE-CLiQ-Leitung pr&uuml;fen.<br />
- EMV-gerechten Schaltschrankaufbau und Leitungsverlegung pr&uuml;fen.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201840">A201840</a></b></td>
<td><b>&lt;Ortsangabe&gt;SMI: Komponente ohne Motordaten gefunden</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Es wurde ein SMI&#47;DQI ohne Motordaten gefunden (z. B. SMI als Ersatzteil eingetauscht).<br />
Warnwert (r2124, dezimal interpretieren):<br />
Komponentennummer aus der Solltopologie.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>1. Die SMI&#47;DQI-Daten (Motor-&#47;Geberdaten) aus der Datensicherung wieder einspielen (p4690, p4691).<br />
2. POWER ON bei dieser Komponente durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Hinweis:<br />
DQI: DRIVE-CLiQ Sensor Integrated<br />
SMI: SINAMICS Sensor Module Integrated<br />
Siehe auch: p4690 (SMI-Ersatzteilfall Komponentennummer), p4691 (SMI-Ersatzteilfall Daten sichern/einspielen)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201900">A201900 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;PB&#47;PN: Konfigurationstelegramm fehlerhaft</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Ein Controller versucht mit einem fehlerhaften Konfiguriertelegramm eine Verbindung aufzubauen.<br />
Warnwert (r2124, dezimal interpretieren):<br />
1:<br />
Verbindungsaufbau zu mehr Antriebsobjekten als im Ger&auml;t projektiert. Die Antriebsobjekte f&uuml;r den Prozessdatenaustausch und ihre Reihenfolge werden in p0978 festgelegt.<br />
2:<br />
Zu viele PZD Datenworte f&uuml;r Output oder Input zu einem Antriebsobjekt. Die Anzahl der m&ouml;glichen PZD eines Antriebsobjektes wird durch die Anzahl der Indizes in r2050&#47;p2051 vorgegeben.<br />
3:<br />
Ungerade Byteanzahl f&uuml;r Input oder Output.<br />
4:<br />
Einstelldaten f&uuml;r Synchronisation nicht akzeptiert. Weitere Informationen siehe A01902.<br />
211:<br />
Unbekannter Parametrierblock.<br />
223:<br />
Taktsynchronisation f&uuml;r das in p8815[0] eingestellte PZD Interface ist unzul&auml;ssig.<br />
Es wird mehr als ein PZD Interface taktsynchron betrieben.<br />
253:<br />
PN Shared Device: Unzul&auml;ssige Mischkonfiguration von PROFIsafe und PZD.<br />
254:<br />
PN Shared Device: Unzul&auml;ssige Doppelbelegung eines Slots&#47;Subslots.<br />
255:<br />
PN: Konfiguriertes und vorhandenes Antriebsobjekt stimmen nicht &uuml;berein.<br />
256:<br />
PN: Konfiguriertes Telegramm nicht einstellbar.<br />
257:<br />
PN Shared Device: Zu viele PZD Datenworte f&uuml;r Output oder Input im gesamten Ger&auml;t.<br />
500:<br />
Unzul&auml;ssige PROFIsafe Konfiguration f&uuml;r das in p8815[1] eingestellte Interface.<br />
Es wird mehr als ein PZD Interface mit PROFIsafe betrieben.<br />
501:<br />
PROFIsafe Parameter fehlerhaft (z. B. F_Dest).<br />
502:<br />
PROFIsafe Telegramm nicht passend.<br />
503:<br />
PROFIsafe Verbindung wird abgelehnt solange keine taktsynchrone Verbindung besteht (p8969).<br />
Weitere Werte:<br />
Nur f&uuml;r Siemens-interne Fehlerdiagnose.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Busprojektierung auf der Master- und Slave-Seite &uuml;berpr&uuml;fen.<br />
Zu Warnwert = 1, 2:<br />
- Liste der Antriebsobjekte mit Prozessdatenaustausch pr&uuml;fen (p0978).<br />
Hinweis:<br />
Mit p0978[x] = 0 werden alle in der Liste folgenden Antriebsobjekte vom Prozessdatenaustausch ausgeschlossen.<br />
Zu Warnwert = 2:<br />
- Anzahl Datenworte f&uuml;r Output und Input zu einem Antriebsobjekt pr&uuml;fen.<br />
Zu Warnwert = 211:<br />
- Offline-Version &lt;= Online-Version sicherstellen.<br />
Zu Warnwert = 223, 500:<br />
- Einstellung in p8839 und p8815 &uuml;berpr&uuml;fen.<br />
- Auf gesteckte, aber nicht projektierte CBE20 &uuml;berpr&uuml;fen.<br />
- Sicherstellen, dass nur ein PZD Interface taktsynchron oder mit PROFIsafe betrieben wird.<br />
Zu Warnwert = 255:<br />
- Konfigurierte Antriebsobjekte pr&uuml;fen.<br />
Zu Warnwert = 256:<br />
- Konfiguriertes Telegramm pr&uuml;fen.<br />
Zu Warnwert = 257:<br />
- Pr&uuml;fen der Anzahl Datenworte f&uuml;r Output und Input zum ganzen Ger&auml;t.<br />
Zu Warnwert = 501:<br />
- Eingestellte PROFIsafe Adresse pr&uuml;fen (p9610).<br />
Zu Warnwert = 502:<br />
- Eingestelltes PROFIsafe Telegramm pr&uuml;fen (p60022, p9611).<br />
</td></tr>
</table><p></p></body></html>