<html><head><meta http-equiv="Content-Type" content="text/html; charset="UTF-8"/><title></title></head>
<body><table><tr><td><b><a name="201640">F201640 (N, A)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Komponententausch erkannt und Quittieren&#47;Speichern notwendig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>&quot;Safety Integrated&quot; hat einen Komponententausch erkannt.<br />
Ein fehlerfreier Betrieb des jeweiligen Antriebs ist nicht mehr m&ouml;glich.<br />
Bei aktiven Safety-Funktionen ist nach einem Komponententausch ein partieller Abnahmetest erforderlich.<br />
St&ouml;rwert (r0949, bin&auml;r interpretieren):<br />
Bit 0 = 1:<br />
Tausch der Control Unit wurde erkannt.<br />
Bit 1 = 1:<br />
Tausch des Motor Modules&#47;Hydraulic Modules wurde erkannt.<br />
Bit 2 = 1:<br />
Tausch des Power Modules wurde erkannt.<br />
Bit 3 = 1:<br />
Tausch des Sensor Modules Kanal 1 wurde erkannt.<br />
Bit 4 = 1:<br />
Tausch des Sensor Modules Kanal 2 wurde erkannt.<br />
Bit 5 = 1:<br />
Tausch des Sensors Kanal 1 wurde erkannt.<br />
Bit 6 = 1:<br />
Tausch des Sensors Kanal 2 wurde erkannt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Komponententausch quittieren (p9702 = 29).<br />
- Alle Parameter speichern (p0977 = 1 bzw. p0971 = 1 oder &quot;RAM nach ROM kopieren&quot;).<br />
- St&ouml;rung quittieren (z. B. Binektoreingang p2103).<br />
Hinweis:<br />
Zus&auml;tzlich zu der St&ouml;rung wird das Diagnosebit r9776.2 und r9776.3 gesetzt.<br />
Siehe auch: p9702 (SI Komponententausch bestätigen), r9776 (SI Diagnose)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201641">F201641 (N, A)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Komponententausch erkannt und Speichern notwendig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>&quot;Safety Integrated&quot; hat einen Komponententausch erkannt.<br />
Es wird keine weitere Fehlerreaktion ausgel&ouml;st und der Betrieb des jeweiligen Antriebs wird dadurch nicht eingeschr&auml;nkt.<br />
Bei aktiven Safety-Funktionen ist nach einem Komponententausch ein partieller Abnahmetest erforderlich.<br />
St&ouml;rwert (r0949, bin&auml;r interpretieren):<br />
Bit 0 = 1:<br />
Tausch der Control Unit wurde erkannt.<br />
Bit 1 = 1:<br />
Tausch des Motor Modules&#47;Hydraulic Modules wurde erkannt.<br />
Bit 2 = 1:<br />
Tausch des Power Modules wurde erkannt.<br />
Bit 3 = 1:<br />
Tausch des Sensor Modules Kanal 1 wurde erkannt.<br />
Bit 4 = 1:<br />
Tausch des Sensor Modules Kanal 2 wurde erkannt.<br />
Bit 5 = 1:<br />
Tausch des Sensors Kanal 1 wurde erkannt.<br />
Bit 6 = 1:<br />
Tausch des Sensors Kanal 2 wurde erkannt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Alle Parameter speichern (p0977 = 1 bzw. p0971 = 1 oder &quot;RAM nach ROM kopieren&quot;).<br />
- St&ouml;rung quittieren (z. B. Binektoreingang p2103).<br />
Siehe auch: r9776 (SI Diagnose)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201649">F201649</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Softwarefehler intern</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Ein interner Fehler in der Safety Integrated Software auf der Control Unit ist aufgetreten.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, hexadezimal interpretieren):<br />
Nur f&uuml;r Siemens-interne Fehlerdiagnose.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Inbetriebnahme der Funktion &quot;Safety Integrated&quot; wiederholen und POWER ON durchf&uuml;hren.<br />
- Firmware der Control Unit auf neuere Version hochr&uuml;sten.<br />
- Technical Support kontaktieren.<br />
- Control Unit austauschen.<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201650">F201650</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Abnahmetest erforderlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die antriebsintegrierte Funktion &quot;Safety Integrated&quot; auf &Uuml;berwachungskanal 1 erfordert einen Abnahmetest.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
130: Safety-Parameter f&uuml;r &Uuml;berwachungskanal 2 nicht vorhanden.<br />
Hinweis:<br />
Dieser St&ouml;rwert wird immer bei der Erstinbetriebnahme von Safety Integrated ausgegeben.<br />
1000: Soll- und Ist-Checksumme auf &Uuml;berwachungskanal 1 nicht identisch (Hochlauf).<br />
- Aufgrund der ge&auml;nderten Abtastzeit des Stromreglers (p0115[0]) wurde die Taktzeit f&uuml;r die Safety Integrated Basic Functions (r9780) angepasst.<br />
- Mindestens ein checksummengepr&uuml;ftes Datum ist defekt.<br />
- Safety-Parameter offline eingestellt und in die Control Unit geladen.<br />
2000: Soll- und Ist-Checksumme auf &Uuml;berwachungskanal 1 nicht identisch (Inbetriebnahmemodus).<br />
- Soll-Checksumme auf &Uuml;berwachungskanal 1 nicht richtig eingetragen (p9799 ungleich r9798).<br />
- Beim Deaktivieren der Sicherheitsfunktionen wurde p9501 oder p9503 nicht gel&ouml;scht.<br />
2001: Soll- und Ist-Checksumme auf &Uuml;berwachungskanal 2 nicht identisch (Inbetriebnahmemodus).<br />
- Soll-Checksumme auf &Uuml;berwachungskanal 2 nicht richtig eingetragen (p9899 ungleich r9898).<br />
- Beim Deaktivieren der Sicherheitsfunktionen p9501 oder p9503 nicht gel&ouml;scht.<br />
2002: Freigabe sichere Funktionen zwischen beiden &Uuml;berwachungskan&auml;len unterschiedlich (p9601 ungleich p9801).<br />
2003: Abnahmetest erforderlich aufgrund der &Auml;nderung eines Safety-Parameters.<br />
2004: Abnahmetest erforderlich wegen Download eines Projektes mit freigegebenen Safety-Funktionen.<br />
2005: Das Safety-Logbuch hat festgestellt, dass sich eine funktionale Safety-Checksum ge&auml;ndert hat. Es ist ein Abnahmetest erforderlich.<br />
2020: Fehler beim Speichern der Safety-Parameter f&uuml;r &Uuml;berwachungskanal 2.<br />
3003: Abnahmetest erforderlich aufgrund der &Auml;nderung eines auf die Hardware bezogenen Safety-Parameters.<br />
3005: Das Safety-Logbuch hat festgestellt, dass sich eine Hardware bezogene Safety-Checksum ge&auml;ndert hat. Es ist ein Abnahmetest erforderlich.<br />
9999: Folgereaktion einer anderen im Hochlauf aufgetretenen Safety-St&ouml;rung, die einen Abnahmetest erfordert.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zu St&ouml;rwert = 130:<br />
- Safety-Inbetriebnahme durchf&uuml;hren.<br />
Zu St&ouml;rwert = 1000:<br />
- Taktzeit f&uuml;r die Safety Integrated Basic Functions (r9780) &uuml;berpr&uuml;fen und Soll-Pr&uuml;fsumme anpassen (p9799).<br />
- Safety-Inbetriebnahme wiederholt durchf&uuml;hren.<br />
- Speicherkarte oder Control Unit tauschen.<br />
- Safety-Parameter beim betreffenden Antrieb mit STARTER aktivieren (Einstellungen &auml;ndern, Parameter kopieren, Einstellungen aktivieren).<br />
Zu St&ouml;rwert = 2000:<br />
- Safety-Parameter auf &Uuml;berwachungskanal 1 &uuml;berpr&uuml;fen und Soll-Pr&uuml;fsumme anpassen (p9799).<br />
Zu St&ouml;rwert = 2001:<br />
- Safety-Parameter auf &Uuml;berwachungskanal 2 &uuml;berpr&uuml;fen und Soll-Pr&uuml;fsumme anpassen (p9899).<br />
Zu St&ouml;rwert = 2002:<br />
- Freigabe der sicheren Funktionen auf beiden &Uuml;berwachungskan&auml;len &uuml;berpr&uuml;fen (p9601 = p9801).<br />
Zu St&ouml;rwert = 2003, 2004, 2005:<br />
- Abnahmetest durchf&uuml;hren und Abnahmeprotokoll erstellen.<br />
Die Vorgehensweise beim Abnahmetest sowie ein Beispiel f&uuml;r das Abnahmeprotokoll sind in folgender Literatur zu finden:<br />
SINAMICS S120 Funktionshandbuch Safety Integrated<br />
Die St&ouml;rung mit St&ouml;rwert 2005 ist nur bei abgew&auml;hlter Funktion &quot;STO&quot; quittierbar.<br />
Zu St&ouml;rwert = 2020:<br />
- Safety-Inbetriebnahme wiederholt durchf&uuml;hren.<br />
- Speicherkarte oder Control Unit tauschen.<br />
Zu St&ouml;rwert = 3003:<br />
- Funktionspr&uuml;fungen f&uuml;r die ge&auml;nderte Hardware durchf&uuml;hren und Abnahmeprotokoll erstellen.<br />
Die Vorgehensweise beim Abnahmetest sowie ein Beispiel f&uuml;r das Abnahmeprotokoll sind in folgender Literatur zu finden:<br />
SINAMICS S120 Funktionshandbuch Safety Integrated<br />
Zu St&ouml;rwert = 3005:<br />
- Funktionspr&uuml;fungen f&uuml;r die ge&auml;nderte Hardware durchf&uuml;hren und Abnahmeprotokoll erstellen.<br />
Die St&ouml;rung mit St&ouml;rwert 3005 ist nur bei abgew&auml;hlter Funktion &quot;STO&quot; quittierbar.<br />
Zu St&ouml;rwert = 9999:<br />
- Diagnose bei der anderen anstehenden Safety-St&ouml;rung durchf&uuml;hren.<br />
Hinweis:<br />
CU: Control Unit<br />
MM: Motor Module<br />
SI: Safety Integrated<br />
STO: Safe Torque Off (Sicher abgeschaltetes Moment)<br />
Siehe auch: p9799 (SI Soll-Prüfsumme SI-Parameter (Control Unit)), p9899 (SI Soll-Prüfsumme SI-Parameter (Motor Module))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201651">F201651</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Synchronisation Safety-Zeitscheiben fehlgeschlagen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Funktion &quot;Safety Integrated&quot; erfordert eine Synchronisation der Safety-Zeitscheiben zwischen Control Unit und Motor Module sowie zwischen Control Unit und &uuml;bergeordneter Steuerung. Diese Synchronisation ist fehlgeschlagen.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
121:<br />
- Bei freigegebenem SINUMERIK Safety Integrated wurde auf der CU&#47;NX ein antriebsseitiger Warmstart durchgef&uuml;hrt.<br />
- Bei freigegebenem SINUMERIK Safety Integrated wurde auf einem Antriebsobjekt der CU die Funktion &quot;Werkseinstellung herstellen&quot; angew&auml;hlt und ein antriebsseitiger Warmstart ausgel&ouml;st.<br />
Alle anderen Werte:<br />
- Nur f&uuml;r Siemens-interne Fehlerdiagnose.<br />
Siehe auch: p9510 (SI Motion taktsynchroner PROFIBUS-Master)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zu St&ouml;rwert = 121:<br />
- Gemeinsamen POWER ON&#47;Warmstart bei &uuml;bergeordneter Steuerung und SINAMICS durchf&uuml;hren.<br />
Generell:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Software des Motor Modules hochr&uuml;sten.<br />
- Software der Control Unit hochr&uuml;sten.<br />
- Software der &uuml;bergeordneten Steuerung hochr&uuml;sten.<br />
Hinweis:<br />
CU: Control Unit<br />
MM: Motor Module<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201652">F201652</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): &Uuml;berwachungstakt unzul&auml;ssig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Einer der Safety Integrated &Uuml;berwachungstakte ist unzul&auml;ssig.<br />
- Der antriebsintegrierte &Uuml;berwachungstakt kann aufgrund der im System geforderten Kommunikationsbedingungen nicht eingehalten werden.<br />
- Der &Uuml;berwachungstakt f&uuml;r die sicheren Bewegungs&uuml;berwachungen ist unzul&auml;ssig (p9500).<br />
- Der Istwerterfassungstakt f&uuml;r die sicheren Bewegungs&uuml;berwachungen ist unzul&auml;ssig (p9511).<br />
- Die Abtastzeit f&uuml;r den Stromregler kann nicht unterst&uuml;tzt werden (p0112, p0115[0]).<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
Bei nicht freigegebener Bewegungs&uuml;berwachung (p9601.2 = p9801.2 = 0, p9501 = 0) gilt:<br />
- Minimaleinstellung f&uuml;r den &Uuml;berwachungstakt (in &micro;s).<br />
Bei freigegebener Bewegungs&uuml;berwachung (p9601.2 = p9801.2 = 1 und&#47;oder p9501 &gt; 0) gilt:<br />
100:<br />
- Es konnte kein passender &Uuml;berwachungstakt gefunden werden.<br />
- Es wurde ein unzul&auml;ssiger Istwerterfassungstakt f&uuml;r S120M eingestellt (p9511).<br />
101:<br />
- Der &Uuml;berwachungstakt ist kein ganzzahliges Vielfaches vom Istwerterfassungstakt.<br />
102:<br />
- Beim &Uuml;bertragen des Istwerterfassungstaktes an das Hydraulic Module ist ein Fehler aufgetreten.<br />
103:<br />
- Beim &Uuml;bertragen des Istwerterfassungstaktes an das Sensor Module ist ein Fehler aufgetreten.<br />
104, 105:<br />
- Das Vierfache der Abtastzeit des Stromreglers (p0115[0]) ist gr&ouml;&szlig;er als 1 ms bei Betrieb mit nicht taktsynchronem PROFIBUS.<br />
- Das Vierfache der Abtastzeit des Stromreglers (p0115[0]) ist gr&ouml;&szlig;er als der DP-Takt bei Betrieb mit taktsynchronem PROFIBUS.<br />
- Der DP-Takt ist kein ganzzahliges Vielfaches der Abtastzeit des Stromreglers (p0115[0]).<br />
106:<br />
- Der &Uuml;berwachungstakt stimmt nicht mit dem &Uuml;berwachungstakt des TM54F &uuml;berein.<br />
107:<br />
- Der Istwerterfassungstakt (p9511) ist kleiner als das Vierfache der Abtastzeit des Stromreglers (p0115[0]).<br />
- Der Istwerterfassungstakt (p9511) ist kein ganzzahliges Vielfaches der Abtastzeit des Stromreglers (p0115[0]).<br />
108:<br />
- Der parametrierte Istwerterfassungstakt ist auf dieser Komponente nicht einstellbar.<br />
111:<br />
- Der &Uuml;berwachungstakt ist kein ganzzahliges Vielfaches der Abtastzeit des Stromreglers (p0115[0]).<br />
112:<br />
- Ein Istwerterfassungstakt p9511 = 0 ist in der vorliegenden Konfiguration nicht zul&auml;ssig.<br />
202:<br />
- Die Abtastzeit des Stromreglers ist auf Null eingestellt (p0115[0]).<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Bei freigegebener antriebsintegrierter SI-&Uuml;berwachung (p9601&#47;p9801 &gt; 0):<br />
- Firmware der Control Unit auf neuere Version hochr&uuml;sten.<br />
Bei freigegebener Bewegungs&uuml;berwachung (p9501 &gt; 0):<br />
- &Uuml;berwachungstakt korrigieren (p9500) und POWER ON durchf&uuml;hren.<br />
Zu St&ouml;rwert = 100:<br />
- F&uuml;r S120M den Istwerterfassungstakt p9511 = 0 einstellen.<br />
Zu St&ouml;rwert = 101:<br />
- Der Istwerterfassungstakt entspricht dem Lagereglertakt&#47;DP-Takt (Werkseinstellung).<br />
- Bei den antriebsintegrierten Bewegungs&uuml;berwachungsfunktionen (p9601&#47;p9801Bit 2 = 1) kann der Istwerterfassungstakt direkt in p9511&#47;p9311 parametriert werden.<br />
Zu St&ouml;rwert = 104, 105:<br />
- Einen eigenen Istwerterfassungstakt in p9511 einstellen.<br />
- Den Betrieb auf maximal zwei Vektorantriebe einschr&auml;nken. Bei Standardeinstellung in p0112, p0115 wird die Abtastzeit des Stromreglers automatisch auf 250 &micro;s reduziert. Wurden die Standardwerte ge&auml;ndert, so ist die Abtastzeit des Stromreglers (p0112, p0115) entsprechend einzustellen.<br />
- Den DP-Takt beim Betrieb mit taktsynchronem PROFIBUS soweit erh&ouml;hen, dass sich ein ganzzahliges Taktverh&auml;ltnis von DP-Takt zu Abtastzeit des Stromreglers von mindestens 4:1 ergibt. Empfohlen wird ein Taktverh&auml;ltnis von mindestens 8:1.<br />
- Bei Firmware-Version 2.5 sicherstellen, dass im Antrieb der Parameter p9510 = 1 eingestellt ist (taktsynchroner Betrieb).<br />
Zu St&ouml;rwert = 106:<br />
- Parameter f&uuml;r die &Uuml;berwachungstakte gleich einstellen (p10000 und p9500&#47;p9300).<br />
Zu St&ouml;rwert = 107:<br />
- Einen zum Stromreglertakt passenden Istwerterfassungstakt einstellen (p9511 &gt;= 4 * p0115[0], empfohlen wird 8 * p0115[0]).<br />
Hinweis:<br />
Ein zu klein eingestellter Istwerterfassungstakt (p9511) kann sporadisch zum Ausl&ouml;sen der Safety-Meldungen C01711&#47;C30711 mit Meldungswert 1020 oder 1021 f&uuml;hren.<br />
Zu St&ouml;rwert = 108:<br />
- Einen geeigneten Istwerterfassungstakt in p9511 einstellen.<br />
- Wird der DP-Takt beim Betrieb mit taktsynchronem PROFIBUS als Istwerterfassungstakt genutzt (p9511 = 0), so muss ein geeigneter DP-Takt projektiert werden. Dieser muss kleiner 8 ms eingestellt werden. Falls dies nicht m&ouml;glich ist, muss p9511 auf den gew&uuml;nschten Istwerterfassungstakt (&lt; 8 ms) eingestellt werden.<br />
- Bei SIMOTION D410-2 muss ein geeignetes Vielfaches des DP-Taktes parametriert werden (z. B. 1, 2, 3, 4, 5, 6, 8, 10). Sonst muss der Takt kleiner als 8 ms eingestellt werden.<br />
Zu St&ouml;rwert = 111:<br />
- Den &Uuml;berwachungstakt in p9500 als ein ganzzahliges Vielfaches der Abtastzeit des Stromreglers (p0115[0]) einstellen.<br />
Zu St&ouml;rwert = 112:<br />
- Den Istwerterfassungstakt p9511 auf den gew&uuml;nschten Wert (ungleich Null) einstellen.<br />
Zu St&ouml;rwert = 202:<br />
- Die Abtastzeit des Stromreglers auf einen sinnvollen Wert einstellen (p0115[0]).<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201653">F201653</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): PROFIBUS&#47;PROFINET-Projektierung fehlerhaft</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
 (AUS1, AUS2, AUS3)</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die PROFIBUS&#47;PROFINET-Projektierung f&uuml;r den Betrieb der Safety Integrated &Uuml;berwachungsfunktionen mit einer &uuml;bergeordneten Steuerung (SINUMERIK oder F-PLC) ist fehlerhaft.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt bei freigegebenen Safety-Funktionen zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
200: Es ist kein Safety-Slot f&uuml;r die Empfangsdaten von der Steuerung projektiert.<br />
210, 220: Der projektierte Safety-Slot f&uuml;r die Empfangsdaten von der Steuerung hat ein unbekanntes Format.<br />
230: Der projektierte Safety-Slot f&uuml;r die Empfangsdaten von der F-PLC hat die falsche L&auml;nge.<br />
231: Der projektierte Safety-Slot f&uuml;r die Empfangsdaten von der F-PLC hat die falsche L&auml;nge.<br />
240: Der projektierte Safety-Slot f&uuml;r die Empfangsdaten von der SINUMERIK hat die falsche L&auml;nge.<br />
250: In der &uuml;bergeordneten F-Steuerung ist ein PROFIsafe-Slot projektiert, im Antrieb ist PROFIsafe aber nicht freigegeben.<br />
300: Es ist kein Safety-Slot f&uuml;r die Sendedaten zur Steuerung projektiert.<br />
310, 320: Der projektierte Safety-Slot f&uuml;r die Sendedaten zur Steuerung hat ein unbekanntes Format.<br />
330: Der projektierte Safety-Slot f&uuml;r die Sendedaten zur F-PLC hat die falsche L&auml;nge.<br />
331: Der projektierte Safety-Slot f&uuml;r die Sendedaten zur F-PLC hat die falsche L&auml;nge.<br />
340: Der projektierte Safety-Slot f&uuml;r die Sendedaten zur SINUMERIK hat die falsche L&auml;nge.<br />
400: Die Telegrammnummer in der F-PLC stimmt nicht mit der Parametrierung im Antrieb &uuml;berein.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Allgemein gilt:<br />
- PROFIBUS&#47;PROFINET-Projektierung des Safety-Slots auf Masterseite &uuml;berpr&uuml;fen und gegebenenfalls korrigieren.<br />
- Software der Control Unit hochr&uuml;sten.<br />
Zu St&ouml;rwert = 250:<br />
- In der &uuml;bergeordneten F-Steuerung die PROFIsafe-Projektierung entfernen oder im Antrieb PROFIsafe freigeben.<br />
Zu St&ouml;rwert = 231, 331:<br />
- Im Antrieb das zur Einstellung auf der F-PLC und zur Einstellung in p60022 passende PROFIsafe-Telegramm parametrieren (p9611&#47;p9811).<br />
- In der F-PLC das zur Parametrierung (p9611&#47;p9811) passende PROFIsafe-Telegramm konfigurieren.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201654">A201654 (F, N)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): PROFIsafe-Projektierung abweichend</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Projektierung eines PROFIsafe-Telegramms in der &uuml;bergeordneten Steuerung (F-PLC) passt nicht zur Parametrierung im Antrieb.<br />
Hinweis:<br />
Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
Warnwert (r2124, dezimal interpretieren):<br />
1:<br />
In der &uuml;bergeordneten Steuerung ist ein PROFIsafe-Telegramm projektiert, aber im Antrieb ist PROFIsafe nicht freigegeben (p9601.3).<br />
2:<br />
Im Antrieb ist PROFIsafe parametriert, aber in der &uuml;bergeordneten Steuerung ist kein PROFIsafe-Telegramm konfiguriert.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Allgemein gilt:<br />
- PROFIsafe-Projektierung in der &uuml;bergeordneten Steuerung &uuml;berpr&uuml;fen und gegebenenfalls korrigieren.<br />
Zu Warnwert = 1:<br />
- In der &uuml;bergeordneten F-Steuerung die PROFIsafe-Projektierung entfernen oder im Antrieb PROFIsafe freigeben.<br />
Zu Warnwert = 2:<br />
- In der &uuml;bergeordneten F-Steuerung das zur Parametrierung passende PROFIsafe-Telegramm konfigurieren.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201655">F201655</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Abgleich der &Uuml;berwachungsfunktionen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Ein Fehler beim Abgleich der Safety Integrated &Uuml;berwachungsfunktionen von beiden &Uuml;berwachungskan&auml;len ist aufgetreten. Es konnte kein gemeinsamer Satz an unterst&uuml;tzten SI-&Uuml;berwachungsfunktionen ermittelt werden.<br />
- DRIVE-CLiQ-Kommunikation gest&ouml;rt oder ausgefallen.<br />
- Safety Integrated Softwarest&auml;nde von Control Unit und Motor Module&#47;Hydraulic Module inkompatibel.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, hexadezimal interpretieren):<br />
Nur f&uuml;r Siemens-interne Fehlerdiagnose.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Software des Motor Modules&#47;Hydraulic Modules hochr&uuml;sten.<br />
- Software der Control Unit hochr&uuml;sten.<br />
- EMV-gerechten Schaltschrankaufbau und Leitungsverlegung pr&uuml;fen.<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201656">F201656</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI CU: Parameter &Uuml;berwachungskanal 2 fehlerhaft</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Beim Zugriff auf die Safety Integrated Parameter f&uuml;r den &Uuml;berwachungskanal 2 im nichtfl&uuml;chtigen Speicher ist ein Fehler aufgetreten.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
129:<br />
- Safety-Parameter f&uuml;r den &Uuml;berwachungskanal 2 besch&auml;digt.<br />
- Antrieb mit freigegebenen Sicherheitsfunktionen m&ouml;glicherweise mit dem Inbetriebnahme-Tool offline kopiert und das Projekt heruntergeladen.<br />
131: Interner Softwarefehler des Motor Modules&#47;Hydraulic Modules.<br />
132: Kommunikationsst&ouml;rungen beim Hoch- bzw. Herunterladen der Safety-Parameter f&uuml;r den &Uuml;berwachungskanal 2.<br />
255: Interner Softwarefehler der Control Unit.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Neue Safety-Inbetriebnahme durchf&uuml;hren.<br />
- Software der Control Unit hochr&uuml;sten.<br />
- Software des Motor Modules&#47;Hydraulic Modules hochr&uuml;sten.<br />
- Speicherkarte oder Control Unit tauschen.<br />
Zu St&ouml;rwert = 129:<br />
- Safety-Inbetriebnahmemodus aktivieren (p0010 = 95).<br />
- PROFIsafe-Adresse anpassen (p9610).<br />
- Kopierfunktion f&uuml;r SI-Parameter starten (p9700 = D0 hex).<br />
- Daten&auml;nderung best&auml;tigen (p9701 = DC hex).<br />
- Safety-Inbetriebnahmemodus beenden (p0010 = 0).<br />
- Alle Parameter speichern (p0977 = 1 oder &quot;RAM nach ROM kopieren&quot;).<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Zu St&ouml;rwert = 132:<br />
- EMV-gerechten Schaltschrankaufbau und Leitungsverlegung pr&uuml;fen.<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201657">F201657</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): PROFIsafe-Telegrammnummer ung&uuml;ltig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>POWER ON</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die im Parameter p9611 eingestellte PROFIsafe-Telegrammnummer ist ung&uuml;ltig.<br />
Bei freigegebenem PROFIsafe (p9601.3 = 1) muss in p9611 eine Telegrammnummer gr&ouml;&szlig;er Null eingetragen sein.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
Siehe auch: p9611 (SI PROFIsafe-Telegrammauswahl (Control Unit)), p60022 (PROFIsafe Telegrammauswahl)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Einstellung der Telegrammnummer &uuml;berpr&uuml;fen (p9611).<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201658">F201658</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): PROFIsafe-Telegrammnummer ungleich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die PROFIsafe-Telegrammnummer in p9611 und p60022 ist unterschiedlich eingestellt.<br />
Bei p9611 ungleich 998 gilt:<br />
Die Telegrammnummer in den beiden Parametern muss identisch eingestellt sein.<br />
Bei p9611 = 998 gilt:<br />
Aufgrund der Kompatibilit&auml;t zu Firmware-Versionen &lt; 4.5 sind in p60022 nur die Werte 0 und 30 erlaubt.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
Siehe auch: p9611 (SI PROFIsafe-Telegrammauswahl (Control Unit)), p60022 (PROFIsafe Telegrammauswahl)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Die Telegrammnummer in beiden Parametern aufeinander abstimmen (p9611, p60022).<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201659">F201659</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Schreibauftrag f&uuml;r Parameter abgewiesen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Schreibauftrag f&uuml;r einen oder mehrere Safety Integrated Parameter auf der Control Unit (CU) wurde abgewiesen.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
1: Das Safety Integrated Passwort ist nicht gesetzt.<br />
2: Ein Zur&uuml;cksetzen der Antriebsparameter wurde angew&auml;hlt. Die Safety Integrated Parameter wurden jedoch nicht zur&uuml;ckgesetzt, da Safety Integrated gerade freigegeben ist.<br />
3: Der verschaltete STO-Eingang befindet sich im Simulationsmodus.<br />
10: Es wurde versucht, die Funktion STO freizugeben, obwohl diese nicht unterst&uuml;tzt werden kann.<br />
13: Es wurde versucht, die Funktion SS1 freizugeben, obwohl diese nicht unterst&uuml;tzt werden kann.<br />
14: Es wurde versucht, die PROFIsafe-Kommunikation freizugeben, obwohl diese nicht unterst&uuml;tzt werden kann oder die eingesetzte Version des PROFIsafe-Treibers auf beiden &Uuml;berwachungskan&auml;len unterschiedlich ist.<br />
15: Es wurde versucht, die antriebsintegrierten Bewegungs&uuml;berwachungen freizugeben, obwohl diese nicht unterst&uuml;tzt werden k&ouml;nnen.<br />
16: Es wurde versucht, die Funktion STO freizugeben, obwohl diese bei freigegebenem internen Spannungsschutz (p1231) nicht unterst&uuml;tzt werden kann.<br />
18: Es wurde versucht, die Funktion PROFIsafe f&uuml;r Basic Functions freizugeben, obwohl diese nicht unterst&uuml;tzt werden kann.<br />
23: Es wurde versucht, bei ESR die Verz&ouml;gerung des STO freizugeben, obwohl dies nicht unterst&uuml;tzt werden kann.<br />
25: Es wurde versucht, ein PROFIsafe-Telegramm zu parametrieren, obwohl dies nicht unterst&uuml;tzt werden kann.<br />
26: Es wurde versucht, bei der eingestellten Signalquelle f&uuml;r STO&#47;SS1 den Simulationsmodus einzuschalten.<br />
27: Es wurde versucht, Basic Functions mit Ansteuerung &uuml;ber TM54F zu aktivieren, obwohl diese nicht unterst&uuml;tzt werden.<br />
29: Es wurde versucht, die Fehlerreaktion f&uuml;r den PROFIsafe-Ausfall auf den STOP B zu parametrieren, obwohl dies nicht unterst&uuml;tzt werden kann.<br />
Siehe auch: p0970, p3900, p9612, r9771, r9871<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zu St&ouml;rwert = 1:<br />
- Safety Integrated Passwort setzen (p9761).<br />
Zu St&ouml;rwert = 2:<br />
- Safety Integrated sperren (p9501, p9601) oder Safety Parameter zur&uuml;cksetzen (p0970 = 5), dann Zur&uuml;cksetzen der Antriebsparameter erneut durchf&uuml;hren.<br />
Zu St&ouml;rwert = 3:<br />
- Simulationsmodus f&uuml;r den Digitaleingang beenden (p0795).<br />
Zu St&ouml;rwert = 10, 11, 12, 13, 14, 15, 17, 18, 19, 21, 22 , 23:<br />
- Pr&uuml;fen, ob St&ouml;rungen im Safety-Funktionsabgleich zwischen beiden &Uuml;berwachungskan&auml;len vorliegen (F01655, F30655) und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
- Hydraulic Module einsetzen, das die gew&uuml;nschte Funktion unterst&uuml;tzt.<br />
- Software des Hydraulic Modules hochr&uuml;sten.<br />
- Software der Control Unit hochr&uuml;sten.<br />
Zu St&ouml;rwert = 16:<br />
- Internen Spannungsschutz sperren (p1231).<br />
Zu St&ouml;rwert = 25:<br />
- Einstellung der Telegrammnummer korrigieren (p9611).<br />
Zu St&ouml;rwert = 26:<br />
- Simulationsmodus bei der eingestellten Signalquelle f&uuml;r STO&#47;SS1 (p9620) ausschalten (p0795).<br />
Zu St&ouml;rwert = 29:<br />
- Pr&uuml;fen, ob p9612 und p9812 gesetzt sind und gegebenenfalls die Einstellungen korrigieren.<br />
- Hydraulic Module einsetzen, das die gew&uuml;nschte Funktion unterst&uuml;tzt.<br />
- Software des Hydraulic Modules hochr&uuml;sten.<br />
- Software der Control Unit hochr&uuml;sten.<br />
Hinweis:<br />
CU: Control Unit<br />
ESR: Extended Stop and Retract (Erweitertes Stillsetzen und R&uuml;ckziehen)<br />
SI: Safety Integrated<br />
SS1: Safe Stop 1 (Sicherer Stopp 1)<br />
STO: Safe Torque Off (Sicher abgeschaltetes Moment) &#47; SH: Safe standstill (Sicherer Halt)<br />
Siehe auch: p9501, p9601, p9612, p9620, p9761<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201660">F201660</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Sichere Funktionen nicht unterst&uuml;tzt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Das Motor Module&#47;Hydraulic Module unterst&uuml;tzt die sicheren Funktionen nicht (z. B. Version des Motor Modules&#47;Hydraulic Modules nicht passend). Es ist keine Inbetriebnahme von Safety Integrated m&ouml;glich.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Motor Module&#47;Hydraulic Module einsetzen, das die sicheren Funktionen unterst&uuml;tzt.<br />
- Software des Motor Modules&#47;Hydraulic Modules hochr&uuml;sten.<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201663">F201663</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Kopieren der SI-Parameter abgelehnt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>In p9700 ist der Wert 87 oder 208 gespeichert oder wurde Offline eingetragen.<br />
Deshalb wird beim Hochlauf versucht, die Safety Integrated Parameter vom &Uuml;berwachungskanal 1 zum &Uuml;berwachungskanal 2 zu kopieren. Auf dem &Uuml;berwachungskanal 1 ist jedoch keine sichere Funktion angew&auml;hlt (p9501 = 0, p9601 = 0). Das Kopieren wird aus Sicherheitsgr&uuml;nden abgelehnt.<br />
Als Folge kann eine inkonsistente Parametrierung in beiden &Uuml;berwachungskan&auml;len entstehen und weitere Fehlermeldungen verursachen.<br />
Insbesondere wird bei inkonsistenter Freigabe der Sicherheitsfunktionen auf beiden &Uuml;berwachungskan&auml;len (p9601 = 0, p9801 &lt;&gt; 0) die St&ouml;rung F30625 ausgegeben.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
SI: Safety Integrated<br />
Siehe auch: p9700 (SI Motion Kopierfunktion)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- p9700 = 0 setzen.<br />
- p9501und p9601 kontrollieren und gegebenenfalls korrigieren.<br />
- Kopierfunktion nochmals starten durch Eintragen des entsprechenden Wertes in p9700.<br />
Alternativ mit dem Inbetriebnahme-Tool STARTER im Online-Betrieb folgende Schritte durchf&uuml;hren:<br />
- Maske &quot;Safety Integrated&quot; aufrufen (das Feld &quot;Auswahl Safety-Funktion&quot; steht auf &quot;Kein Safety Integrated&quot;).<br />
- Auf Schaltfl&auml;che &quot;Einstellungen &auml;ndern&quot; klicken.<br />
- Auf Schaltfl&auml;che &quot;Einstellungen aktivieren&quot; klicken (dadurch wird Safety Integrated auf beiden &Uuml;berwachungskan&auml;len gesperrt).<br />
- Alle Parameter speichern (p0977 = 1 oder &quot;RAM nach ROM kopieren&quot;).<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201664">F201664</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Kein automatisches Firmware-Update</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Beim Hochlauf wurde erkannt, dass die Funktion &quot;Firmware-Update automatisch&quot; (p7826 = 1) nicht aktiviert ist.<br />
Dies ist aber f&uuml;r das automatische Firmware-Update&#47;Downgrade erforderlich, um bei Freigabe der Safety-Funktionen eine nicht zul&auml;ssige Mischung der Versionen zu vermeiden.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
Siehe auch: p7826 (Firmware-Update automatisch)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Bei freigegebenen Sicherheitsfunktionen (p9501 &lt;&gt; 0 und&#47;oder p9601 &lt;&gt; 0):<br />
1. Die Funktion &quot;Firmware-Update automatisch&quot; aktivieren (p7826 = 1).<br />
2. Parameter sichern (p0977 = 1) und POWER ON durchf&uuml;hren.<br />
Beim Deaktivieren der Sicherheitsfunktionen (p9501 = 0, p9601 = 0) l&auml;sst sich die St&ouml;rung nach dem Verlassen des Safety-IBN-Modus quittieren.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201670">F201670</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Parametrierung Sensor Module ung&uuml;ltig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Parametrierung eines f&uuml;r Safety Integrated verwendeten Sensor Modules ist unzul&auml;ssig.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
1: Es wurde kein Geber f&uuml;r Safety Integrated parametriert.<br />
2: Es wurde ein Geber f&uuml;r Safety Integrated parametriert, der nicht &uuml;ber eine Spur A&#47;B (Sinus&#47;Cosinus) verf&uuml;gt.<br />
3: Der f&uuml;r Safety Integrated angew&auml;hlte Geberdatensatz ist noch nicht g&uuml;ltig.<br />
4: Bei der Kommunikation mit dem Geber ist ein Fehler aufgetreten.<br />
5: Anzahl der relevanten Bits in der Gebergroblage ung&uuml;ltig.<br />
6: Konfiguration DRIVE-CLiQ-Geber ung&uuml;ltig.<br />
7: Nicht sicherheitsrelevante Anteil von Gebergroblage bei linearem DRIVE-CLiQ-Geber ung&uuml;ltig.<br />
8: Parametrierte Safety Vergleichsalgorithmus nicht unterst&uuml;tzt.<br />
9: Verh&auml;ltnis zwischen Gitterteilung und Messschritt bei linearem DRIVE-CLiQ-Geber nicht bin&auml;r.<br />
10: Bei einem f&uuml;r Safety Integrated verwendeten Geber sind nicht alle Antriebsdatens&auml;tze (DDS) demselben Geberdatensatz (EDS) zugeordnet (p0187 ... p0189).<br />
11: Die Nullpunkteinstellung eines in Safety Integrated verwendeten linearen DRIVE-CLiQ-Gebers ist nicht Null.<br />
12: Der zweite Geber ist nicht parametriert (p9526 = 1 ist unzul&auml;ssig).<br />
13: Hydraulic Module: Ein zweiter Geber ist nicht parametriert und es wird kein DRIVE-CLiQ-Geber verwendet.<br />
14: SCSE-Geber wird in der Kombination mit einem HTL&#47;TTL-Geber oder einem anderen SCSE-Geber oder in einem 1-Geber-System verwendet.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zu St&ouml;rwert = 1, 2:<br />
- Geber einsetzen und parametrieren, der von Safety Integrated unterst&uuml;tzt wird (Geber mit Spur A&#47;B Sinus, p0404.4 = 1).<br />
Zu St&ouml;rwert = 3:<br />
- &Uuml;berpr&uuml;fen, ob die Ger&auml;te- oder Antriebs-Inbetriebnahme aktiv ist und gegebenenfalls diese verlassen (p0009 = p00010 = 0), Parameter sichern (p0971 = 1) und POWER ON durchf&uuml;hren.<br />
Zu St&ouml;rwert = 4:<br />
- &Uuml;berpr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Sensor Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Zu St&ouml;rwert = 5:<br />
- p9525 = 0 (unzul&auml;ssig). Die Geberparametrierung auf dem betroffenen Sensor Module &uuml;berpr&uuml;fen.<br />
Zu St&ouml;rwert = 6:<br />
- p9515.0 &uuml;berpr&uuml;fen (bei DRIVE-CLiQ-Geber gilt: p9515.0 = 1). Die Geberparametrierung auf dem betroffenen Sensor Module &uuml;berpr&uuml;fen.<br />
Zu St&ouml;rwert = 7:<br />
- p12033 bei einem f&uuml;r Safety Integrated verwendeten Geber ist nicht gleich 1. Linearen DRIVE-CLiQ-Geber einsetzen und parametrieren, bei dem p12033 = 1.<br />
Zu St&ouml;rwert = 8:<br />
- p9541 &uuml;berpr&uuml;fen. Geber einsetzen und parametrieren, der einen von Safety Integrated unterst&uuml;tzten Algorithmus implementiert.<br />
Zu St&ouml;rwert = 9:<br />
- p9514 und p9522 &uuml;berpr&uuml;fen. Geber einsetzen und parametrieren, bei dem das Verh&auml;ltnis p9514 zu p9522 bin&auml;r ist.<br />
Zu St&ouml;rwert = 10:<br />
- EDS-Zuordnung aller f&uuml;r Safety Integrated verwendeten Geber abgleichen (p0187 ... p0189).<br />
Zu St&ouml;rwert = 11:<br />
- Einen linearen DRIVE-CLiQ-Geber einsetzen und parametrieren, bei dem die Nullpunkteinstellung gleich 0 ist.<br />
Zu St&ouml;rwert = 12:<br />
- Einen Geber f&uuml;r den zweiten Kanal parametrieren (p9526 &gt; 1).<br />
Zu St&ouml;rwert = 13:<br />
- Einen zweiten Geber parametrieren oder einen DRIVE-CLiQ-Geber einsetzen.<br />
Zu St&ouml;rwert = 14:<br />
- Einen DRIVE-CLiQ-Geber f&uuml;r den Kanal 1 in Kombination mit einem SCSE-Geber f&uuml;r den Kanal 2 einsetzen.<br />
Hinweis:<br />
SCSE: Single Channel Safety Encoder (Einkanaliger Geber)<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201671">F201671</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Parametrierung Geber fehlerhaft</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Parametrierung des von Safety Integrated verwendeten Gebers ist ungleich der Parametrierung des Standardgebers.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
Parameternummer des nicht korrespondierenden Safety-Parameters.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Geberparametrierung zwischen dem Safety-Geber und dem Standardgeber abgleichen.<br />
Hinweis:<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201672">F201672</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Motor Module Software&#47;Hardware inkompatibel</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die vorhandene Hydraulic Module Software unterst&uuml;tzt die sichere Bewegungs&uuml;berwachung nicht oder ist zur Software auf der Control Unit inkompatibel oder die Kommunikation zwischen Control Unit und Hydraulic Module ist gest&ouml;rt.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
1:<br />
Die vorhandene Hydraulic Module Software unterst&uuml;tzt die sichere Bewegungs&uuml;berwachung nicht.<br />
2, 3, 6, 8:<br />
Die Kommunikation zwischen Control Unit und Hydraulic Module ist gest&ouml;rt.<br />
4, 5, 7:<br />
Die vorhandene Hydraulic Module Software ist zur Software auf der Control Unit inkompatibel.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Pr&uuml;fen, ob St&ouml;rungen im Safety-Funktionsabgleich zwischen der Control Unit und dem betroffenen Hydraulic Module vorliegen (F01655, F30655) und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Zu St&ouml;rwert = 1:<br />
- Hydraulic Module einsetzen, das sichere Bewegungs&uuml;berwachung unterst&uuml;tzt.<br />
Zu St&ouml;rwert = 2, 3, 6, 8:<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Hydraulic Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Zu St&ouml;rwert = 4, 5, 7:<br />
- Software des Hydraulic Modules hochr&uuml;sten.<br />
Hinweis:<br />
SI: Safety Integrated<br />
HM: Hydraulic Module<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201673">F201673</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Sensor Module Software&#47;Hardware inkompatibel</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die vorhandene Sensor Module Software bzw. Hardware unterst&uuml;tzt die sichere Bewegungs&uuml;berwachung mit der &uuml;bergeordneten Steuerung nicht.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
Nur f&uuml;r Siemens-interne Fehlerdiagnose.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Software des Sensor Modules hochr&uuml;sten.<br />
- Sensor Module einsetzen, das die sichere Bewegungs&uuml;berwachung unterst&uuml;tzt.<br />
Hinweis:<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201674">F201674</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Safety-Funktion von PROFIsafe-Telegramm nicht unterst&uuml;tzt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>POWER ON</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die in p9501 und p9601 freigegebene &Uuml;berwachungsfunktion wird vom aktuell eingestellten PROFIsafe-Telegramm (p9611) nicht unterst&uuml;tzt.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, bitweise interpretieren):<br />
Bit 4 = 1:<br />
SS2ESR &uuml;ber PROFIsafe wird nicht unterst&uuml;tzt (p9501.4).<br />
Bit 18 = 1:<br />
SS2E &uuml;ber PROFIsafe wird nicht unterst&uuml;tzt (p9501.18).<br />
Bit 24 = 1:<br />
&Uuml;bertragung SLS (SG)-Grenzwert &uuml;ber PROFIsafe wird nicht unterst&uuml;tzt (p9501.24).<br />
Bit 25 = 1:<br />
&Uuml;bertragung Sichere Position (SP) &uuml;ber PROFIsafe wird nicht unterst&uuml;tzt (p9501.25).<br />
Bit 26 = 1:<br />
Getriebestufenumschaltung &uuml;ber PROFIsafe wird nicht unterst&uuml;tzt (p9501.26).<br />
Bit 28 = 1:<br />
SCA &uuml;ber PROFIsafe wird nicht unterst&uuml;tzt (p9501.28).<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Betroffene &Uuml;berwachungsfunktion abw&auml;hlen (p9501, p9601).<br />
- Passendes PROFIsafe-Telegramm einstellen (p9611).<br />
Hinweis:<br />
SCA: Safe Cam (Sicherer Nocken)<br />
SI: Safety Integrated<br />
SLS: Safely-Limited Speed (Sicher begrenzte Geschwindigkeit) &#47; SG: Safely reduced speed (Sicher reduzierte Geschwindigkeit)<br />
SP: Safe Position (Sichere Position)<br />
SS2E: Safe Stop 2 External (Sicherer Stop 2 mit externem Stop, externer STOP D)<br />
SS2ESR: Safe Stop 2 Extended Stop and Retract (Sicherer Stop 2 Erweitertes Stillsetzen und R&uuml;ckziehen)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201675">F201675</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1: Einstellungen im PROFIBUS&#47;PROFINET-Controller unzul&auml;ssig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>F&uuml;r die Funktion &quot;Sichere Synchrone Position &uuml;ber PROFIsafe&quot; wurde eine fehlerhafte Einstellung in der Konfiguration erkannt.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem quittierbaren STOP A und kann wie folgt quittiert werden:<br />
- STO anw&auml;hlen und wieder abw&auml;hlen.<br />
- Internal Event Acknowledge (wenn die &quot;Erweiterte Meldungsquittierung&quot; aktiv ist, p9507.0 = 1).<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
1:<br />
&quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; ist freigegeben (p9501.29 = 1) und nicht nach der Regel Tdp = 2 x n x p9500 eingestellt (n = 1, 2, 3, ...).<br />
2:<br />
&quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; ist freigegeben (p9501.29 = 1) und es ist kein taktsynchroner Betrieb eingestellt.<br />
Hinweis:<br />
STO: Safe Torque Off (Sicher abgeschaltetes Moment)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zu St&ouml;rwert = 1:<br />
- Buszykluszeit Tdp und &Uuml;berwachungstakt p9500 nach der Regel Tdp = 2 x n x p9500 einstellen (n = 1, 2, 3, ...).<br />
Zu St&ouml;rwert = 2:<br />
- &quot;Taktsynchroner Betrieb&quot; auf dem PROFIBUS&#47;PROFINET-Controller einstellen.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201679">F201679</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI CU: Safety-Parametrierung und Topologie ge&auml;ndert Warmstart&#47;POWER ON erforderlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
 (AUS1, AUS3)</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>POWER ON</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Es wurden Safety-Parameter ge&auml;ndert, die erst nach einem Warmstart oder POWER ON wirksam werden (siehe Warnung A01693).<br />
Anschlie&szlig;end wurde ein Teilhochlauf mit ge&auml;nderter Konfiguration durchgef&uuml;hrt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Warmstart durchf&uuml;hren (p0009 = 30, p0976 = 2, 3).<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201680">F201680</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Pr&uuml;fsummenfehler sichere &Uuml;berwachungen</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die vom Antrieb errechnete und in r9728 eingetragene Ist-Pr&uuml;fsumme &uuml;ber die sicherheitsrelevanten Parameter stimmt nicht mit der bei der letzten Maschinenabnahme gespeicherten Soll-Pr&uuml;fsumme in p9729 &uuml;berein.<br />
Es wurden sicherheitsrelevante Parameter ge&auml;ndert oder es liegt ein Fehler vor.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
0: Pr&uuml;fsummenfehler bei SI-Parametern f&uuml;r Bewegungs&uuml;berwachung.<br />
1: Pr&uuml;fsummenfehler bei SI-Parametern f&uuml;r Istwerte.<br />
2: Pr&uuml;fsummenfehler bei SI-Parametern f&uuml;r Komponentenzuordnung.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Sicherheitsrelevante Parameter &uuml;berpr&uuml;fen und gegebenenfalls korrigieren.<br />
- Funktion &quot;RAM nach ROM kopieren&quot; ausf&uuml;hren.<br />
- POWER ON durchf&uuml;hren, falls Safety-Parameter ge&auml;ndert wurden, die POWER ON ben&ouml;tigen.<br />
- Abnahmetest durchf&uuml;hren.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201681">F201681</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Parameterwert falsch</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Parameter kann mit diesem Wert nicht parametriert werden.<br />
Hinweis:<br />
Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
yyyyxxxx dez: yyyy = Zusatzinformation, xxxx = Parameter<br />
yyyy = 0:<br />
Keine weiteren Informationen vorhanden.<br />
xxxx = 9500 und yyyy = 1:<br />
Der Parameter p9500 ist ungleich p9300 oder kein ganzzahliges Vielfaches der Stromreglerabtastzeit (p0115[0]).<br />
xxxx = 9500 und yyyy = 16:<br />
&quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; ist auf mehreren Achsen freigegeben (p9501.29 = 1) und der &Uuml;berwachungstakt p9500 ist bei diesen Achsen unterschiedlich eingestellt.<br />
Gegebenenfalls ist die maximal erlaubte Anzahl von Achsen f&uuml;r die Funktion &quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; &uuml;berschritten.<br />
xxxx = 9501:<br />
Freigabe der Funktion &quot;n &lt; nx Hysterese und Filterung&quot; (p9501.16) ist in Kombination mit der Funktion &quot;Erweiterte Funktionen ohne Anwahl&quot; (p9601.5) nicht erlaubt.<br />
xxxx = 9501 und yyyy = 8:<br />
Referenzieren &uuml;ber SCC (p9501.27 = 1) ist freigegeben ohne Freigabe einer absoluten Bewegungs&uuml;berwachungsfunktionen (p9501.1 oder p9501.2).<br />
xxxx = 9501 und yyyy = 10:<br />
Referenzieren &uuml;ber SCC (p9501.27 = 1) und EPOS (r0108.4 = 1) sind gleichzeitig<br />
freigegeben.<br />
xxxx = 9501 und yyyy = 11:<br />
Sichere Funktion SS2E (p9501.18 = 1) ist freigegeben ohne Freigabe von PROFIsafe.<br />
xxxx = 9501 und yyyy = 12:<br />
SCA (p9501.28 = 1) ist freigegeben ohne Freigabe von PROFIsafe.<br />
xxxx = 9501 und yyyy = 14:<br />
&quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; ist freigegeben (p9501.29 = 1) ohne Freigabe von &quot;Sichere Position &uuml;ber PROFIsafe&quot; (p9501.25).<br />
xxxx = 9501 und yyyy = 17:<br />
&quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; ist freigegeben (p9501.29 = 1) und &quot;Safety geberlos&quot; ist freigegeben (p9506).<br />
xxxx = 9501 und yyyy = 19:<br />
SLA (p9501.20 = 1) ist freigegeben mit geberloser Istwerterfassung (p9506 gleich 1 oder 3).<br />
xxxx = 9501 und yyyy = 20:<br />
SLA (p9501.20 = 1) ist freigegeben mit einem 2-Geber-System (p9526 ungleich 1).<br />
xxxx = 9511 und yyyy = 1:<br />
Der Parameter p9511 ist ungleich p9311.<br />
xxxx = 9511 und yyyy = 2:<br />
Es sind zwischen den Antriebsobjekten keine unterschiedlichen Werte in p9511 und p0115[0] erlaubt.<br />
xxxx = 9522:<br />
Die Getriebestufe wurde zu hoch eingestellt.<br />
xxxx = 9534 oder 9535:<br />
Die Grenzwerte von SLP sind betragsm&auml;&szlig;ig zu gro&szlig; eingestellt.<br />
xxxx = 9544:<br />
Bei Linearachsen ist der Maximalwert auf 1 mm begrenzt.<br />
xxxx = 9547:<br />
Der Parameter p9547 ist zu klein eingestellt.<br />
xxxx = 9573:<br />
Es wurde &quot;Referenzieren &uuml;ber safety control channel&quot; angefordert (p9573 = 263), ohne Freigabe der Funktion &quot;Referenzieren &uuml;ber SCC&quot; (p9501.27 = 0).<br />
xxxx = 9578:<br />
SLA ist freigegeben (p9501.20 = 1). Die Beschleunigungsgrenze ist zu klein (p9578). Die Beschleunigungsaufl&ouml;sung ist nicht mehr ausreichend (r9790).<br />
Die minimale Grenze ist das x-fache der Beschleunigungsaufl&ouml;sung:<br />
- Firmware-Version 5.1: 3 * r9790[0]<br />
- Firmware-Version 5.2 und h&ouml;her: 10 * r9790[1]<br />
xxxx = 9601 und yyyy = 1:<br />
Sind antriebsintegrierte Bewegungs&uuml;berwachungen (p9601.2 = 1) und erweiterte Funktionen ohne Anwahl (p9601.5 = 1) freigegeben, so ist PROFIsafe (p9601.3 = 1) nicht m&ouml;glich.<br />
xxxx = 9601 und yyyy = 2:<br />
Erweiterte Funktionen ohne Anwahl (p9601.5 = 1) sind freigegeben ohne Freigabe antriebsintegrierter Bewegungs&uuml;berwachungen (p9601.2).<br />
xxxx = 9601 und yyyy = 5:<br />
Die &Uuml;bertragung des SLS-Grenzwertes &uuml;ber PROFIsafe (p9501.24) ist freigegeben ohne Freigabe von PROFIsafe.<br />
xxxx = 9601 und yyyy = 6:<br />
Die &Uuml;bertragung der Sicheren Position &uuml;ber PROFIsafe (p9501.25) ist freigegeben ohne Freigabe von PROFIsafe.<br />
xxxx = 9601 und yyyy = 7:<br />
Die sichere Umschaltung der Getriebestufen (p9501.26) ist freigegeben ohne Freigabe von PROFIsafe.<br />
xxxx = 9601 und yyyy = 18:<br />
SLA (p9501.20 = 1) ist freigegeben ohne Freigabe von PROFIsafe.<br />
xxxx = 9601 und yyyy = 21:<br />
SS2ESR (p9501.4 = 1) ist freigegeben ohne Freigabe von PROFIsafe.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Parameter korrigieren (gegebenenfalls auch auf dem anderen &Uuml;berwachungskanal, p9801):<br />
Zu xxxx = 9500 und yyyy = 1:<br />
- p9500 &quot;SI Motion &Uuml;berwachungstakt&quot; als ein ganzzahliges Vielfaches von p0115[0] &quot;Abtastzeit des Stromreglers&quot; einstellen.<br />
- Parameter 9300 und 9500 abgleichen, Parameter sichern (p0971 = 1) und POWER ON durchf&uuml;hren.<br />
Zu xxxx = 9500 und yyyy = 16:<br />
Funktion &quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; sperren (p9501.29 = 0) oder den &Uuml;berwachungstakt p9500 auf allen Achsen mit freigegebener Funktion gleich einstellen.<br />
Zu xxxx = 9501:<br />
- Parameter p9501.16 und p9301.16 korrigieren oder erweiterte Funktionen ohne Anwahl (p9601.5) abw&auml;hlen.<br />
Zu xxxx = 9501 und yyyy = 8:<br />
Referenzieren &uuml;ber SCC (p9501.27) sperren oder eine absolute Bewegungs&uuml;berwachungsfunktionen freigeben (p9501.1 oder p9501.2).<br />
Zu xxxx = 9501 und yyyy = 10:<br />
Referenzieren &uuml;ber SCC (p9501.27) oder EPOS (r0108.4) sperren.<br />
Zu xxxx = 9501 und yyyy = 11:<br />
SS2E (p9501.18) sperren oder PROFIsafe freigeben.<br />
Zu xxxx = 9501 und yyyy = 12:<br />
SCA (p9501.28) sperren oder PROFIsafe freigeben.<br />
Zu xxxx = 9501 und yyyy = 14:<br />
Funktion &quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; sperren (p9501.29 = 0) oder &quot;Sichere Position &uuml;ber PROFIsafe&quot; freigeben (p9501.25).<br />
Zu xxxx = 9501 und yyyy = 17:<br />
Funktion &quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot; sperren (p9501.29 = 0) oder &quot;Safety mit Geber&quot; einstellen (p9506).<br />
Zu xxxx = 9501 und yyyy = 19:<br />
SLA (p9501.20) sperren oder Istwerterfassung mit Geber einschalten (p9506 gleich 0 oder 2).<br />
Zu xxxx = 9501 und yyyy = 20:<br />
SLA (p9501.20) sperren oder 1-Geber-System einschalten (p9526 gleich 5).<br />
Zu xxxx = 9511:<br />
Parameter p9311 und p9511 abgleichen, Parameter sichern (p0971 = 1) und POWER ON durchf&uuml;hren.<br />
Zu xxxx = 9517:<br />
Der Parameter p9516.0 ist auch zu pr&uuml;fen.<br />
Zu xxxx = 9522:<br />
Die entsprechenden Parameter korrigieren.<br />
Zu xxxx = 9534 oder 9535:<br />
Die Grenzwerte von SLP betragsm&auml;&szlig;ig reduzieren.<br />
Zu xxxx = 9544:<br />
Parameter korrigieren (bei Linearachsen ist der Maximalwert auf 1 mm begrenzt).<br />
Zu xxxx = 9547:<br />
Bei freigegebener Hysterese&#47;Filterung (p9501.16 = 1) gilt:<br />
- Parameter p9546&#47;p9346 und p9547&#47;p9347 nach folgender Regel einstellen: p9546 &gt;= 2 x p9547; p9346 &gt;= 2 x p9347<br />
- Im Falle freigegebener Istwertsynchronisation (p9501.3 = 1) muss au&szlig;erdem diese Regel eingehalten werden: p9549 &lt;= p9547; p9349 &lt;= p9347<br />
Zu xxxx = 9578:<br />
- Informationen in r9790 beachten.<br />
Zu xxxx = 9601:<br />
yyyy = 1:<br />
Nur antriebsintegrierte Bewegungs&uuml;berwachungen (p9601.2 = 1) und erweiterte Funktionen ohne Anwahl (p9601.5 = 1) freigeben oder nur PROFIsafe (p9601.3 = 1) freigeben.<br />
yyyy = 2:<br />
Antriebsintegrierte Bewegungs&uuml;berwachungen freigeben (p9601.2 = 1).<br />
yyyy = 5:<br />
F&uuml;r die &Uuml;bertragung des SLS-Grenzwertes &uuml;ber PROFIsafe (p9501.24 = 1) auch PROFIsafe (p9601.3 = 1) und antriebsintegrierte Bewegungs&uuml;berwachungen (p9601.2 = 1) freigeben.<br />
yyyy = 6:<br />
F&uuml;r die Sichere Position &uuml;ber PROFIsafe (p9501.25 = 1) auch PROFIsafe (p9601.3 = 1) und antriebsintegrierte Bewegungs&uuml;berwachungen (p9601.2 = 1) freigeben.<br />
yyyy = 7:<br />
F&uuml;r die sichere Umschaltung der Getriebestufen (p9501.26 = 1) auch PROFIsafe (p9601.3 = 1) und antriebsintegrierte Bewegungs&uuml;berwachungen (p9601.2 = 1) freigeben.<br />
yyyy = 18:<br />
F&uuml;r die sicher begrenzte Beschleunigung (p9501.20 = 1) auch PROFIsafe (p9601.3 = 1) und antriebsintegrierte Bewegungs&uuml;berwachungen (p9601.2 = 1) freigeben.<br />
yyyy = 21:<br />
F&uuml;r die sicherer Stop 2 Erweitertes Stillsetzen und R&uuml;ckziehen (p9501.4) auch PROFIsafe (p9601.3 = 1) und antriebsintegrierte Bewegungs&uuml;berwachungen (p9601.2 = 1) freigeben.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201682">F201682</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): &Uuml;berwachungsfunktion nicht unterst&uuml;tzt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die in p9501, p9601 oder p9801 freigegebene &Uuml;berwachungsfunktion wird in dieser Firmware-Version nicht unterst&uuml;tzt.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
2: &Uuml;berwachungsfunktion SCA nicht unterst&uuml;tzt (p9501.7 und p9501.8 ... 15 und p9503).<br />
3: &Uuml;berwachungsfunktion SLS-Override nicht unterst&uuml;tzt (p9501.5).<br />
6: Freigabe Istwertsynchronisation nicht unterst&uuml;tzt (p9501.3).<br />
9: &Uuml;berwachungsfunktion durch Firmware nicht unterst&uuml;tzt oder Freigabebit nicht verwendet.<br />
13: SINUMERIK Safety Integrated mit SPL auf Hydraulic Module nicht unterst&uuml;tzt.<br />
14: &Uuml;berwachungsfunktion SLA und ncSI wird nicht unterst&uuml;tzt.<br />
20: Antriebsintegrierte Bewegungs&uuml;berwachungsfunktionen nur im Zusammenhang mit PROFIsafe unterst&uuml;tzt (p9501, p9601.1 ... 2 und p9801.1 ... 2).<br />
21: Freigabe einer sicheren Bewegungs&uuml;berwachungsfunktion (in p9501) bei freigegebenen Basisfunktionen &uuml;ber PROFIsafe (p9601.2 = 0, p9601.3 = 1) nicht unterst&uuml;tzt.<br />
45: Deaktivieren SOS&#47;SLS w&auml;hrend externem STOP A wird nicht unterst&uuml;tzt (p9501.23).<br />
46: Ansteuerung der Basisfunktionen &uuml;ber TM54F und gleichzeitige Freigabe der erweiterten Funktionen oder ncSI wird von dieser Firmware-Version nicht unterst&uuml;tzt.<br />
50: Umschaltzeiten bei SOS (p9569&#47;p9369, p9567&#47;p9367) werden nicht unterst&uuml;tzt.<br />
53: Funktion SS2E nicht unterst&uuml;tzt (p9501.18 ).<br />
54: Funktion SCA nicht unterst&uuml;tzt (p9501.28).<br />
57: Funktion &quot;Synchrone &Uuml;bertragung Sichere Position&quot; nicht unterst&uuml;tzt (p9501.29).<br />
58: Funktion &quot;Sicher begrenzte Beschleunigung&quot; (SLA) nicht unterst&uuml;tzt (p9501.20).<br />
9612: Die Einstellung p9612&#47;p9812 = 1 wird bei Ansteuerung &uuml;ber TM54F nicht unterst&uuml;tzt.<br />
Siehe auch: p9612 (SI PROFIsafe Ausfall Reaktion (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Betroffene &Uuml;berwachungsfunktion abw&auml;hlen (p9501, p9601, p9801).<br />
Zu St&ouml;rwert = 9612:<br />
- Parameter p9612&#47;p9812 = 0 einstellen.<br />
Hinweis:<br />
ESR: Extended Stop and Retract (Erweitertes Stillsetzen und R&uuml;ckziehen)<br />
SCA: Safe Cam (Sicherer Nocken) &#47; SN: Safe software cam (Sicherer Software-Nocken)<br />
SI: Safety Integrated<br />
SLS: Safely-Limited Speed (Sicher begrenzte Geschwindigkeit) &#47; SG: Safely reduced speed (Sicher reduzierte Geschwindigkeit)<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
SPL: Sichere Programmierbare Logik<br />
SS2E: Safety Stop 2 external (Externer STOP D)<br />
Siehe auch: p9501, p9503, p9601, p9612, r9771<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201683">F201683</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): SOS&#47;SLS-Freigabe fehlt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>In p9501 ist die sichere Grundfunktion &quot;SOS&#47;SLS&quot; nicht freigegeben, obwohl andere sichere &Uuml;berwachungen freigegeben sind.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Die Funktion &quot;SOS&#47;SLS&quot; freigeben (p9501.0) und POWER ON durchf&uuml;hren.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SLS: Safely-Limited Speed (Sicher begrenzte Geschwindigkeit) &#47; SG: Safely reduced speed (Sicher reduzierte Geschwindigkeit)<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
Siehe auch: p9501 (SI Motion Freigabe sichere Funktionen (Control Unit))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201684">F201684</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Sicher begrenzte Position Grenzwerte vertauscht</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>F&uuml;r die Funktion &quot;Sicher begrenzte Position&quot; (SLP) steht in p9534 ein kleinerer Wert als in p9535.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
1: Grenzwerte SLP1 vertauscht.<br />
2: Grenzwerte SLP2 vertauscht.<br />
Siehe auch: p9534, p9535<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Untere und obere Grenzwerte richtigstellen (p9535, p9534).<br />
- POWER ON durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Hinweis:<br />
SI: Safety Integrated<br />
SLP: Safely-Limited Position (Sicher begrenzte Position) &#47; SE: Safe software limit switches (Sicherer Software-Endschalter)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201685">F201685</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Sicher begrenzte Geschwindigkeit Grenzwert zu gro&szlig;</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Grenzwert f&uuml;r die Funktion &quot;Sicher begrenzte Geschwindigkeit&quot; (SLS) ist gr&ouml;&szlig;er als die Geschwindigkeit, die einer Gebergrenzfrequenz von 500 kHz entspricht.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
Maximal zul&auml;ssige Geschwindigkeit.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Grenzwerte f&uuml;r SLS richtigstellen und POWER ON durchf&uuml;hren.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SLS: Safely-Limited Speed (Sicher begrenzte Geschwindigkeit) &#47; SG: Safely reduced speed (Sicher reduzierte Geschwindigkeit)<br />
Siehe auch: p9531<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201688">F201688</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion CU: Istwertsynchronisation nicht zul&auml;ssig</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>- Die Freigabe der Istwertsynchronisation bei einem 1-Geber-System ist nicht zul&auml;ssig.<br />
- Gleichzeitige Freigabe der Istwertsynchronisation und &Uuml;berwachungsfunktion mit Absolutbezug (SCA&#47;SLP) ist nicht zul&auml;ssig.<br />
- Gleichzeitige Freigabe der Istwertsynchronisation und Sichere Position &uuml;ber PROFIsafe ist nicht zul&auml;ssig.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu einem nicht quittierbaren STOP A.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Entweder die Funktion &quot;Istwertsynchronisation&quot; abw&auml;hlen oder 2-Geber-System parameterieren.<br />
- Entweder die Funktion &quot;Istwertsynchronisation&quot; oder die &Uuml;berwachungsfunktionen mit Absolutbezug (SCA&#47;SLP) abw&auml;hlen und POWER ON durchf&uuml;hren.<br />
- Entweder die Funktion &quot;Istwertsynchronisation&quot; abw&auml;hlen oder &quot;Sichere Position &uuml;ber PROFIsafe&quot; nicht freigeben.<br />
Hinweis:<br />
SCA: Safe Cam (Sicherer Nocken) &#47; SN: Safe software cam (Sicherer Software-Nocken)<br />
SI: Safety Integrated<br />
SLP: Safely-Limited Position (Sicher begrenzte Position) &#47; SE: Safe software limit switches (Sicherer Software-Endschalter)<br />
SP: Safe Position (Sichere Position)<br />
Siehe auch: p9501, p9526<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201690">F201690</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Datensicherungsproblem beim NVRAM</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>Infeed: KEINE<br />
 (AUS1, AUS2)Servo: KEINE<br />
 (AUS1, AUS2, AUS3)Vector: KEINE<br />
 (AUS1, AUS2, AUS3)Hla: KEINE<br />
 (AUS1, AUS2, AUS3)</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>POWER ON</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>F&uuml;r die Speicherung der Parameter r9781 und r9782 (Safety-Logbuch) steht nicht gen&uuml;gend Speicherplatz im NVRAM auf dem Antrieb zur Verf&uuml;gung.<br />
Hinweis:<br />
Diese St&ouml;rung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
St&ouml;rwert (r0949, dezimal interpretieren):<br />
0: Es ist kein physikalisches NVRAM im Antrieb vorhanden.<br />
1: Es ist kein Speicherplatz im NVRAM mehr frei.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zu St&ouml;rwert = 0:<br />
- Control Unit mit NVRAM verwenden.<br />
Zu St&ouml;rwert = 1:<br />
- Funktionen abw&auml;hlen, die nicht ben&ouml;tigt werden und Speicherplatz im NVRAM belegen.<br />
- Technical Support kontaktieren.<br />
Hinweis:<br />
NVRAM: Non-Volatile Random Access Memory (Nichtfl&uuml;chtiger Speicher zum Lesen und Schreiben)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201691">A201691 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Ti und To ungeeignet f&uuml;r DP-Takt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die projektierten Zeiten f&uuml;r die PROFIBUS-Kommunikation sind unzul&auml;ssig und der DP-Takt wird als Istwerterfassungstakt f&uuml;r die sicheren Bewegungs&uuml;berwachungsfunktionen verwendet.<br />
Taktsynchroner PROFIBUS:<br />
Die Summe von Ti und To ist zu gro&szlig; f&uuml;r den eingestellten DP-Takt. Der DP-Takt sollte mindestens 1 Stromreglertakt gr&ouml;&szlig;er als die Summe von Ti und To sein.<br />
Kein taktsynchroner PROFIBUS:<br />
Der DP-Takt muss mindestens das 4-fache des Stromreglertaktes betragen.<br />
Achtung:<br />
Das nicht Beachten dieser Warnung kann zum sporadischen Auftreten der Meldung C01711 bzw. C30711 mit Wert 1020 ... 1021 f&uuml;hren.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Ti und To klein genug f&uuml;r den verwendeten DP-Takt projektieren oder die DP-Zykluszeit erh&ouml;hen.<br />
Alternative bei freigegebener antriebsintegrierter SI-&Uuml;berwachung (p9601&#47;p9801 &gt; 0):<br />
Den Istwerterfassungstakt p9511&#47;p9311 verwenden und damit unabh&auml;ngig vom DP-Takt einstellen. Der Istwerterfassungstakt muss mindestens das 4-fache des Stromreglertaktes betragen. Empfohlen wird ein Taktverh&auml;ltnis von mindestens 8:1.<br />
Siehe auch: p9511 (SI Motion Istwerterfassung Takt (Control Unit))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201693">A201693 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Safety-Parametrierung ge&auml;ndert Warmstart&#47;POWER ON erforderlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Es wurden Safety-Parameter ge&auml;ndert, die erst nach einem Warmstart oder POWER ON wirksam werden.<br />
Warnwert (r2124, dezimal interpretieren):<br />
Parameternummer des Safety-Parameters, aufgrund dessen &Auml;nderung ein Warmstart oder POWER ON notwendig ist.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Warmstart durchf&uuml;hren (p0009 = 30, p0976 = 2, 3).<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Hinweis:<br />
Vor der Durchf&uuml;hrung des Abnahmetests muss ein POWER ON bei allen Komponenten durchgef&uuml;hrt werden.<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201694">F201694 (A)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion CU: Firmware-Version Motor Module&#47;Hydraulic Module &auml;lter Control Unit</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Firmware-Version des Motor Modules&#47;Hydraulic Modules ist &auml;lter als die Version der Control Unit.<br />
Es ist m&ouml;glich, dass Safety-Funktionen nicht verf&uuml;gbar sind (r9771&#47;r9871).<br />
Hinweis:<br />
Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
Diese Meldung kann auch auftreten, wenn nach automatischem Firmware-Update noch kein POWER ON durchgef&uuml;hrt wurde (Warnung A01007).<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Firmware des Motor Modules&#47;Hydraulic Modules auf neuere Version hochr&uuml;sten.<br />
Siehe auch: r9390 (SI Motion Version sichere Bewegungsüberwachungen (Motor Module)), r9590 (SI Motion Version sichere Bewegungsüberwachungen (Control Unit))<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201695">A201695 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Sensor Module wurde getauscht</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Ein Sensor Module, das f&uuml;r die sicheren Bewegungs&uuml;berwachungen verwendet wird, wurde getauscht. Eine Quittierung des Hardware-Tausches ist erforderlich. Anschlie&szlig;end ist ein Abnahmetest durchzuf&uuml;hren.<br />
Hinweis:<br />
Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Folgende Schritte mit dem Inbetriebnahme-Tool STARTER durchf&uuml;hren:<br />
- Schaltfl&auml;che &quot;Hardware-Tausch quittieren&quot; in der Safety-Maske bet&auml;tigen.<br />
- Funktion &quot;RAM nach ROM kopieren&quot; ausf&uuml;hren.<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Alternativ folgende Schritte in der Expertenliste des Inbetriebnahme-Tools durchf&uuml;hren:<br />
- Kopierfunktion f&uuml;r Node-Identifier auf dem Antrieb starten (p9700 = 1D hex).<br />
- Hardware-CRC auf dem Antrieb best&auml;tigen (p9701 = EC hex).<br />
- Alle Parameter speichern (p0977 = 1).<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
Anschlie&szlig;end einen Abnahmetest durchf&uuml;hren (siehe Funktionshandbuch Safety Integrated).<br />
Bei SINUMERIK gilt:<br />
Der Tausch von Komponenten mit Safety-Funktionen wird durch das HMI unterst&uuml;tzt (Bedienbereich &quot;Diagnose&quot; --&gt; Softkey &quot;Alarmliste&quot; --&gt; Softkey &quot;SI HW best&auml;tigen&quot; usw.).<br />
Die genaue Vorgehensweise ist in folgender Literatur zu finden:<br />
SINUMERIK Funktionshandbuch Safety Integrated<br />
Siehe auch: p9700 (SI Motion Kopierfunktion), p9701 (SI Motion Datenänderung bestätigen)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201696">A201696 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Teststopp f&uuml;r Bewegungs&uuml;berwachungen im Hochlauf angew&auml;hlt</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Zwangsdynamisierung (Teststopp) f&uuml;r die sicheren Bewegungs&uuml;berwachungsfunktionen ist unzul&auml;ssigerweise bereits im Hochlauf angew&auml;hlt.<br />
Deshalb wird der Test erst nach erneuter Anwahl der Zwangsdynamisierung durchgef&uuml;hrt.<br />
Hinweis:<br />
Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
Siehe auch: p9705 (SI Motion Teststopp Signalquelle)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zwangsdynamisierung f&uuml;r die sicheren Bewegungs&uuml;berwachungen abw&auml;hlen und erneut anw&auml;hlen.<br />
Achtung:<br />
F&uuml;r die Anwahl des Teststopps d&uuml;rfen Eing&auml;nge des TM54F nicht verwendet werden.<br />
Hinweis:<br />
Die Signalquelle zur Anwahl der Zwangsdynamisierung wird &uuml;ber Binektoreingang p9705 eingestellt.<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201697">A201697 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion: Teststopp f&uuml;r Bewegungs&uuml;berwachungen erforderlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die in p9559 eingestellte Zeit zur Zwangsdynamisierung (Teststopp) f&uuml;r die sicheren Bewegungs&uuml;berwachungsfunktionen ist &uuml;berschritten. Eine neue Zwangsdynamisierung ist erforderlich.<br />
Nach der n&auml;chsten Anwahl der Zwangsdynamisierung wird die Meldung zur&uuml;ckgenommen und die &Uuml;berwachungszeit zur&uuml;ckgesetzt.<br />
Hinweis:<br />
- Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
- W&auml;hrend eines Hochlaufs werden die Abschaltpfade nicht automatisch gepr&uuml;ft, deshalb steht die Warnung nach dem Hochlauf immer an.<br />
- Der Test muss innerhalb des festgelegten maximalen Zeitintervalls (p9559, maximal 9000 Stunden) durchgef&uuml;hrt werden, um die normativen Anforderungen nach einer rechtzeitigen Fehleraufdeckung und die Bedingungen der Berechnung der Ausfallrate der Sicherheitsfunktionen (PFH-Wert) zu erf&uuml;llen. Ein Betrieb &uuml;ber diesen maximalen Zeitraum hinaus ist zul&auml;ssig, wenn sichergestellt werden kann, dass die Zwangsdynamisierung durchgef&uuml;hrt wird, bevor sich Personen in den Gefahrenbereich begeben und auf das Funktionieren der Sicherheitsfunktionen angewiesen sind.<br />
Siehe auch: p9559 (SI Motion Zwangsdynamisierung Timer (Control Unit)), r9765 (SI Motion Zwangsdynamisierung Restzeit (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Zwangsdynamisierung der sicheren Bewegungs&uuml;berwachungen durchf&uuml;hren.<br />
Die Signalquelle zur Anwahl der Zwangsdynamisierung wird &uuml;ber Binektoreingang p9705 eingestellt.<br />
Achtung:<br />
F&uuml;r die Anwahl der Zwangsdynamisierung d&uuml;rfen Eing&auml;nge des TM54F nicht verwendet werden.<br />
Hinweis:<br />
SI: Safety Integrated<br />
Siehe auch: p9705 (SI Motion Teststopp Signalquelle)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201698">A201698 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Inbetriebnahmemodus aktiv</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Inbetriebnahme der Funktion &quot;Safety Integrated&quot; ist angew&auml;hlt.<br />
Diese Meldung wird nach Beendigung der Safety-Inbetriebnahme zur&uuml;ckgenommen.<br />
Hinweis:<br />
- Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
- W&auml;hrend des Safety-Inbetriebnahmemodus ist die Funktion &quot;STO&quot; intern angew&auml;hlt.<br />
Siehe auch: p0010<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Keine notwendig.<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201699">A201699 (F)</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI P1 (CU): Teststopp f&uuml;r STO erforderlich</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>KEINE</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die in p9659 eingestellte Zeit zur Zwangsdynamisierung (Teststopp) f&uuml;r die Funktion &quot;STO&quot; ist &uuml;berschritten. Eine neue Zwangsdynamisierung ist erforderlich.<br />
Nach der n&auml;chsten Abwahl der Funktion &quot;STO&quot; wird die Meldung zur&uuml;ckgenommen und die &Uuml;berwachungszeit zur&uuml;ckgesetzt.<br />
Hinweis:<br />
- Diese Meldung f&uuml;hrt zu keiner Safety-Stoppreaktion.<br />
- Der Test muss innerhalb des festgelegten maximalen Zeitintervalls (p9659) durchgef&uuml;hrt werden, um die normativen Anforderungen nach einer rechtzeitigen Fehleraufdeckung und die Bedingungen der Berechnung der Ausfallrate der Sicherheitsfunktionen (PFH-Wert) zu erf&uuml;llen. Ein Betrieb &uuml;ber diesen maximalen Zeitraum hinaus ist zul&auml;ssig, wenn sichergestellt werden kann, dass die Zwangsdynamisierung durchgef&uuml;hrt wird, bevor sich Personen in den Gefahrenbereich begeben und auf das Funktionieren der Sicherheitsfunktionen angewiesen sind.<br />
Siehe auch: p9659 (SI Zwangsdynamisierung Timer), r9660 (SI Zwangsdynamisierung Restzeit)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>STO anw&auml;hlen und wieder abw&auml;hlen.<br />
Hinweis:<br />
CU: Control Unit<br />
SI: Safety Integrated<br />
STO: Safe Torque Off (Sicher abgeschaltetes Moment) &#47; SH: Safe standstill (Sicherer Halt)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201700">C201700</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP A ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>AUS2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP A stillgesetzt (STO &uuml;ber den Safety-Abschaltpfad der Control Unit).<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung vom zweiten &Uuml;berwachungskanal.<br />
- STO nicht aktiv nach parametrierter Zeit (p9557) nach Teststopp-Anwahl.<br />
- Folgereaktion der Meldung C01706 &quot;SI Motion CU: SAM&#47;SBR Grenze &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01701 &quot;SI Motion CU: STOP B ausgel&ouml;st&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf dem zweiten &Uuml;berwachungskanal beheben.<br />
- Diagnose bei der anstehenden Meldung C01706 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01714 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01701 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01715 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01716 durchf&uuml;hren.<br />
- Wert in p9557 (soweit vorhanden) &uuml;berpr&uuml;fen, eventuell den Wert vergr&ouml;&szlig;ern und POWER ON durchf&uuml;hren.<br />
- Abschaltpfad der Control Unit &uuml;berpr&uuml;fen (DRIVE-CLiQ-Kommunikation &uuml;berpr&uuml;fen falls vorhanden).<br />
- Motor Module bzw. Power Module bzw. Hydraulic Module tauschen.<br />
- Control Unit tauschen.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SAM: Safe Acceleration Monitor (Sichere &Uuml;berwachung auf Beschleunigung)<br />
SBR: Safe Brake Ramp (Sichere Bremsrampen&uuml;berwachung)<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201701">C201701</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP B ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
 (AUS3)</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP B stillgesetzt (Abbremsen an der AUS3-R&uuml;cklauframpe).<br />
Als Folge dieser St&ouml;rung wird nach Ablauf der in p9556 parametrierten Zeit oder Unterschreiten der in p9560 parametrierten Drehzahlschwelle die Meldung C01700 &quot;STOP A ausgel&ouml;st&quot; ausgegeben.<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung vom zweiten &Uuml;berwachungskanal.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01711 &quot;SI Motion CU: Defekt in einem &Uuml;berwachungskanal&quot;.<br />
- Folgereaktion der Meldung C01707 &quot;SI Motion CU: Toleranz f&uuml;r Sicheren Betriebshalt &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf dem zweiten &Uuml;berwachungskanal beheben.<br />
- Diagnose bei der anstehenden Meldung C01714 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01711 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01707 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01715 durchf&uuml;hren.<br />
- Diagnose bei der anstehenden Meldung C01716 durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201706">C201706</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): SAM&#47;SBR Grenze &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Bewegungs&uuml;berwachungsfunktionen mit Geber (p9506 = 0):<br />
- Nach dem Einleiten von STOP B (SS1) oder STOP C (SS2) hat die Geschwindigkeit die eingestellte Toleranz &uuml;berschritten.<br />
Der Antrieb wird durch die Meldung C01700 &quot;SI Motion: STOP A ausgel&ouml;st&quot; stillgesetzt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Das Bremsverhalten &uuml;berpr&uuml;fen und gegebenenfalls die Parametrierung der Funktion &quot;SAM&quot; bzw. &quot;SBR&quot; anpassen.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SAM: Safe Acceleration Monitor (Sichere &Uuml;berwachung auf Beschleunigung)<br />
SBR: Safe Brake Ramp (Sichere Rampen&uuml;berwachung)<br />
SI: Safety Integrated<br />
Siehe auch: p9548, p9581, p9582, p9583<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201707">C201707</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Toleranz f&uuml;r Sicheren Betriebshalt &uuml;berschritten</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Die Istposition hat sich weiter als die Stillstandstoleranz von der Sollposition entfernt.<br />
Der Antrieb wird durch die Meldung C01701 &quot;SI Motion: STOP B ausgel&ouml;st&quot; stillgesetzt.<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- Pr&uuml;fen, ob weitere Safety-St&ouml;rungen anstehen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
- &Uuml;berpr&uuml;fen ob die Stillstandstoleranz zur Genauigkeit und Regeldynamik der Achse passt.<br />
- POWER ON durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
Siehe auch: p9530<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201708">C201708</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP C ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>STOP2<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP C stillgesetzt (Abbremsen an der AUS3-R&uuml;cklauframpe).<br />
Nach Ablauf der parametrierten Zeit wird &quot;Sicherer Betriebshalt&quot; (SOS) aktiviert.<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung von &uuml;bergeordneter Steuerung.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
Siehe auch: p9552 (SI Motion Übergangszeit STOP C auf SOS (SBH) (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf der Steuerung beheben.<br />
- Diagnose bei der anstehenden Meldung C01714&#47;C01715&#47;C01716 durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201709">C201709</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP D ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP D stillgesetzt (Bremsen auf der Bahn).<br />
Nach Ablauf der parametrierten Zeit wird &quot;Sicherer Betriebshalt&quot; (SOS) aktiviert.<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung von &uuml;bergeordneter Steuerung.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
Siehe auch: p9553 (SI Motion Übergangszeit STOP D auf SOS (SBH) (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf der Steuerung beheben.<br />
- Diagnose bei der anstehenden Meldung C01714&#47;C01715&#47;C01716 durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201710">C201710</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): STOP E ausgel&ouml;st</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb wird &uuml;ber STOP E stillgesetzt (R&uuml;ckzugsbewegung).<br />
Nach Ablauf der parametrierten Zeit wird &quot;Sicherer Betriebshalt&quot; (SOS) aktiviert.<br />
M&ouml;gliche Ursachen:<br />
- Stoppanforderung von &uuml;bergeordneter Steuerung.<br />
- Folgereaktion der Meldung C01714 &quot;SI Motion CU: Sicher begrenzte Geschwindigkeit &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01715 &quot;SI Motion CU: Sicher begrenzte Position &uuml;berschritten&quot;.<br />
- Folgereaktion der Meldung C01716 &quot;SI Motion CU: Toleranz f&uuml;r sichere Bewegungsrichtung &uuml;berschritten&quot;.<br />
Siehe auch: p9554 (SI Motion Übergangszeit STOP E auf SOS (SBH) (Control Unit))<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>- St&ouml;rungsursache auf der Steuerung beheben.<br />
- Diagnose bei der anstehenden Meldung C01714&#47;C01715&#47;C01716 durchf&uuml;hren.<br />
Diese Meldung kann ohne POWER ON wie folgt quittiert werden (sichere Quittierung):<br />
- Terminal Module 54F (TM54F).<br />
- Onboard F-DI (nur CU310-2).<br />
- PROFIsafe.<br />
- Maschinensteuertafel.<br />
Hinweis:<br />
SI: Safety Integrated<br />
SOS: Safe Operating Stop (Sicherer Betriebshalt) &#47; SBH: Safe operating stop (Sicherer Betriebshalt)<br />
</td></tr>
</table><p></p><table><tr><td><b><a name="201711">C201711</a></b></td>
<td><b>&lt;Ortsangabe&gt;SI Motion P1 (CU): Defekt in einem &Uuml;berwachungskanal</b></td></tr>
<tr><td valign="top"><b>Antriebsobjekt:</b></td>
<td></td></tr>
<tr><td valign="top"><b>Reaktion:</b></td>
<td>KEINE<br />
</td></tr>
<tr><td valign="top"><b>Quittierung:</b></td>
<td>SOFORT ( (POWER ON, ))</td></tr>
<tr><td valign="top"><b>Ursache:</b></td>
<td>Der Antrieb hat beim kreuzweisen Vergleich der beiden &Uuml;berwachungskan&auml;le einen Unterschied zwischen Eingangsdaten oder Ergebnissen der &Uuml;berwachungen festgestellt und STOP F ausgel&ouml;st. Eine der &Uuml;berwachungen funktioniert nicht mehr zuverl&auml;ssig, d. h. es ist kein sicherer Betrieb mehr m&ouml;glich.<br />
Ist mindestens eine &Uuml;berwachungsfunktion aktiv, so wird nach Ablauf der parametrierten Zeitstufe die Meldung C01701 &quot;SI Motion: STOP B ausgel&ouml;st&quot; ausgegeben.<br />
Der Meldungswert, der zum STOP F gef&uuml;hrt hat, wird in r9725 angezeigt.<br />
Wird der Antrieb zusammen mit einer SINUMERIK betrieben, sind die Meldungswerte in der Meldung 27001 der SINUMERIK beschrieben, au&szlig;er folgender Meldungswerte, die nur im SINAMICS auftreten k&ouml;nnen:<br />
1007: Kommunikation mit PLC fehlerhaft (Lebenszeichen)<br />
1008: Kommunikation mit PLC fehlerhaft (CRC)<br />
Die nachfolgend beschriebenen Meldungswerte betreffen den Kreuzvergleich zwischen beiden &Uuml;berwachungskan&auml;len (antriebsintegrierte Sicherheitsfunktionen).<br />
Die Meldungswerte k&ouml;nnen auch in folgenden F&auml;llen auftreten, falls die explizit genannte Ursache nicht zutrifft:<br />
- Unterschiedlich parametrierte Taktzeiten (p9500&#47;p9300 bzw. p9511&#47;p9311).<br />
- Zu schnelle Taktzeiten (p9500&#47;p9300, p9511&#47;p9311).<br />
- Bei Meldungswerten 3, 44 ... 57, 232 und 1-Geber-System, unterschiedlich eingestellte Geberparameter.<br />
- Bei Meldungswerten 3, 44 ... 57, 232 und 2-Geber-System, nicht korrekt eingestellte Geberparameter.<br />
- Fehlerhafte Synchronisation.<br />
Meldungswert (r9749, dezimal interpretieren):<br />
0 bis 999: Nummer des kreuzweise verglichenen Datums, das zu dieser St&ouml;rung gef&uuml;hrt hat.<br />
Meldungswerte, die nachfolgend nicht aufgelistet werden, sind nur f&uuml;r Siemens-interne Fehlerdiagnose.<br />
0: Stoppanforderung vom anderen &Uuml;berwachungskanal.<br />
1: Zustandsabbild der &Uuml;berwachungsfunktionen SOS, SLS, SAM&#47;SBR, SDI oder SLP (Ergebnisliste 1) (r9710[0], r9710[1]).<br />
2: Zustandsabbild der &Uuml;berwachungsfunktion SCA oder n &lt; nx (Ergebnisliste 2) (r9711[0], r9711[1]).<br />
3: Differenz des Lageistwert (r9713[0&#47;1]) zwischen den beiden &Uuml;berwachungskan&auml;len ist gr&ouml;&szlig;er als die Toleranz in p9542&#47;p9342. Bei freigegebener Istwertsynchronisation (p9501.3&#47;p9301.3) ist die Differenz der Geschwindigkeit (basierend auf Lageistwert) gr&ouml;&szlig;er als die Toleranz in p9549&#47;p9349.<br />
4: Synchronisation des kreuzweisen Datenvergleichs zwischen den beiden Kan&auml;len fehlerhaft.<br />
5: Freigabe sichere Funktionen (p9501&#47;p9301). Safety-&Uuml;berwachungstakt zu klein (p9500&#47;p9300).<br />
6: Grenzwert f&uuml;r SLS1 (p9531[0]&#47;p9331[0]).<br />
7: Grenzwert f&uuml;r SLS2 (p9531[1]&#47;p9331[1]).<br />
8: Grenzwert f&uuml;r SLS3 (p9531[2]&#47;p9331[2]).<br />
9: Grenzwert f&uuml;r SLS4 (p9531[3]&#47;p9331[3]).<br />
10: Stillstandstoleranz (p9530&#47;p9330).<br />
11: Oberer Grenzwert f&uuml;r SLP1 (p9534[0]&#47;p9334[0]).<br />
12: Unterer Grenzwert f&uuml;r SLP1 (p9535[0]&#47;p9335[0]).<br />
13: Oberer Grenzwert f&uuml;r SLP2 (p9534[1]&#47;p9334[1]).<br />
14: Unterer Grenzwert f&uuml;r SLP2 (p9535[1]&#47;p9335[1]).<br />
31: Positionstoleranz (p9542&#47;p9342) bzw. (p9549&#47;p9349) bei freigegebener Istwertsynchronisation (p9501.3&#47;p9301.3).<br />
32: Positionstoleranz beim sicheren Referenzieren(p9544&#47;p9344).<br />
33: Zeit Geschwindigkeitsumschaltung (p9551&#47;p9351).<br />
35: Verz&ouml;gerungszeit STOP A (p9556&#47;p9356).<br />
36: Pr&uuml;fungszeit STO (p9557&#47;p9357).<br />
37: &Uuml;bergangszeit STOP C nach SOS (p9552&#47;p9352).<br />
38: &Uuml;bergangszeit STOP D nach SOS (p9553&#47;p9353).<br />
39: &Uuml;bergangszeit STOP E nach SOS (p9554&#47;p9354).<br />
40: Stoppreaktion bei SLS (p9561&#47;p9361).<br />
41: Stoppreaktion bei SLP1 (p9562[0]&#47;p9362[0]).<br />
42: Abschaltdrehzahl STO (p9560&#47;p9360).<br />
43: Speichertest Stoppreaktion (STOP A).<br />
44 ... 57: Allgemein<br />
M&ouml;gliche Ursache 1 (bei Inbetriebnahme bzw. Parameter&auml;nderung)<br />
Der Toleranzwert f&uuml;r die &Uuml;berwachungsfunktion ist zwischen den beiden &Uuml;berwachungskan&auml;len unterschiedlich.<br />
M&ouml;gliche Ursache 2 (bei laufendem Betrieb)<br />
Die Grenzwerte basieren auf dem aktuellen Istwert (r9713[0&#47;1]). Bei einer Abweichung der sicheren Istwerte zwischen den beiden &Uuml;berwachungskan&auml;len sind auch die im definierten Abstand liegenden Grenzwerte unterschiedlich (d. h. entspricht Meldungswert 3). Dies ist feststellbar durch Kontrolle der sicheren Istpositionen.<br />
Zul&auml;ssige Abweichung zwischen den beiden &Uuml;berwachungskan&auml;len: p9542&#47;p9342.<br />
44: Lageistwert (r9713[0&#47;1]) + Grenzwert SLS1 (p9531[0]&#47;p9331[0]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
45: Lageistwert (r9713[0&#47;1]) - Grenzwert SLS1 (p9531[0]&#47;p9331[0]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
46: Lageistwert (r9713[0&#47;1]) + Grenzwert SLS2 (p9531[1]&#47;p9331[1]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
47: Lageistwert (r9713[0&#47;1]) - Grenzwert SLS2 (p9531[1]&#47;p9331[1]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
48: Lageistwert (r9713[0&#47;1]) + Grenzwert SLS3 (p9531[2]&#47;p9331[2]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
49: Lageistwert (r9713[0&#47;1]) - Grenzwert SLS3 (p9531[2]&#47;p9331[2]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
50: Lageistwert (r9713[0&#47;1]) + Grenzwert SLS4 (p9531[3]&#47;p9331[3]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
51: Lageistwert (r9713[0&#47;1]) - Grenzwert SLS4 (p9531[3]&#47;p9331[3]) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
52: Stillstandsposition + Toleranz (p9530&#47;9330).<br />
53: Stillstandsposition - Toleranz (p9530&#47;9330).<br />
54: Lageistwert (r9713[0&#47;1]) + Grenzwert nx (p9546&#47;p9346) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300) + Toleranz (p9542&#47;p9342).<br />
55: Lageistwert (r9713[0&#47;1]) + Grenzwert nx (p9546&#47;p9346) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
56: Lageistwert (r9713[0&#47;1]) - Grenzwert nx (p9546&#47;p9346) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300).<br />
57: Lageistwert (r9713[0&#47;1]) - Grenzwert nx (p9546&#47;p9346) * Safety-&Uuml;berwachungstakt (p9500&#47;p9300) - Toleranz (p9542&#47;p9342).<br />
58: Aktuelle Stillsetzanforderung.<br />
75: Geschwindigkeitsgrenze nx (p9546, p9346).<br />
Bei freigegebener Funktion &quot;n &lt; nx: Hysterese und Filterung&quot; (p9501.16 = 1) kommt dieser Meldungswert auch bei unterschiedlicher Hysteresetoleranz (p9547&#47;p9347).<br />
76: Stoppreaktion bei SLS1 (p9563[0]&#47;p9363[0]).<br />
77: Stoppreaktion bei SLS2 (p9563[1]&#47;p9363[1]).<br />
78: Stoppreaktion bei SLS3 (p9563[2]&#47;p9363[2]).<br />
79: Stoppreaktion bei SLS4 (p9563[3]&#47;p9363[3]).<br />
81: Geschwindigkeitstoleranz f&uuml;r SAM (p9548&#47;p9348).<br />
82: SGEs f&uuml;r SLS-Korrekturfaktor.<br />
83: Abnahmetesttimer (p9558&#47;p9358).<br />
84: &Uuml;bergangszeit STOP F (p9555&#47;p9355).<br />
85: &Uuml;bergangszeit Busausfall (p9580&#47;p9380).<br />
86: Kennung 1-Geber-System (p9526&#47;p9326).<br />
87: Geberzuordnung zweiter Kanal (p9526&#47;p9326).<br />
89: Gebergrenzfrequenz.<br />
230: Filterzeitkonstante f&uuml;r n &lt; nx.<br />
231: Hysteresetoleranz f&uuml;r n &lt; nx.<br />
232: Gegl&auml;tteter Geschwindigkeitsistwert.<br />
233: Grenzwert nx &#47; Safety-&Uuml;berwachungstakt + Hysteresetoleranz.<br />
234: Grenzwert nx &#47; Safety-&Uuml;berwachungstakt.<br />
235: -Grenzwert nx &#47; Safety-&Uuml;berwachungstakt.<br />
236: -Grenzwert nx &#47; Safety-&Uuml;berwachungstakt - Hysteresetoleranz.<br />
237: SGA n &lt; nx.<br />
238: Geschwindigkeitsgrenzwert f&uuml;r SAM (p9568&#47;p9368).<br />
243: Funktionskonfiguration (p9507&#47;p9307).<br />
246: Spannungstoleranz Beschleunigung (p9589&#47;p9389).<br />
247: SDI Toleranz (p9564&#47;p9364).<br />
248: SDI positiv obere Grenze (7FFFFFFF hex).<br />
249: Lageistwert (r9713[0&#47;1]) - SDI Toleranz (p9564&#47;p9364).<br />
250: Lageistwert (r9713[0&#47;1]) + SDI Toleranz (p9564&#47;p9364).<br />
251: SDI negativ untere Grenze (80000001 hex).<br />
252: SDI Stoppreaktion (p9566&#47;p9366).<br />
253: SDI Verz&ouml;gerungszeit (p9565&#47;p9365).<br />
256: Zustandsabbild der &Uuml;berwachungsfunktionen SOS, SLS, SLP, Teststopp, SBR, SDI (Ergebnisliste 1 Erw) (r9710).<br />
257: Sicherheitsfunktionen bei Bewegungs&uuml;berwachungen ohne Anwahl (p9512&#47;p9312) unterschiedlich.<br />
259: Skalierungsfaktor f&uuml;r sichere Position &uuml;ber PROFIsafe (p9574&#47;p9374) oder PROFIsafe-Telegramm (p9611&#47;p9811) unterschiedlich.<br />
260: Modulowert inklusive Skalierung (p9505&#47;p9305 und p9574&#47;p9374) bei SP mit 16 Bit.<br />
263: Stoppreaktion bei SLP2 (p9562[1]&#47;p9362[1]).<br />
264: Positionstoleranz inklusive Skalierung (p9542&#47;p9342 und p9574&#47;p9374) bei SP mit 16 Bit.<br />
265: Zustandsabbild aller &Auml;nderungsfunktionen (Ergebnisliste 1) (r9710).<br />
266: Die Umschaltgeschwindigkeit auf SOS ist unterschiedlich (p9567&#47;p9367).<br />
267: Die &Uuml;bergangszeit auf SOS nach Stillstand ist unterschiedlich (p9569&#47;p9369).<br />
268: SLP Verz&ouml;gerungszeit ist unterschiedlich (p9577&#47;p9377).<br />
269: Faktor zur Erh&ouml;hung der Positionstoleranz beim Getriebeumschalten (p9543&#47;9343).<br />
270: Maske f&uuml;rs SGE-Abbild: alle Funktionen, die bei aktueller Parametrierung nicht unterst&uuml;tzt&#47;freigegeben sind (p9501&#47;p9301, p9601&#47;p9801 und p9506&#47;p9306).<br />
271: Maske f&uuml;rs SGE-Abbild: Abw&auml;hlen aller BIts f&uuml;r die Funktion &quot;Sichere Getriebeumschaltung&quot;.<br />
272: Aktivierung der erhohten Positionstoleranz bei der Funktion &quot;Sichere Getriebeumschaltung&quot; unterschiedlich.<br />
273: Geschwindigkeitsgrenzwert f&uuml;r die Abflachung der Rampe bei SAM&#47;SBR unterschiedlich.<br />
274: SGA SCA, Nocken 1 bis 15.<br />
275: SGA SCA, Nocken 16 bis 30.<br />
276: Grenzwert f&uuml;r SLA1 (p9578&#47;p9378).<br />
277: Stoppreaktion bei SLA1 (p9579&#47;p9379).<br />
278: Oberer Grenzwert f&uuml;r SLA1.<br />
279: Unterer Grenzwert f&uuml;r SLA1.<br />
280: Oberer Grenzwert f&uuml;r SLA1 (Feinaufl&ouml;sung).<br />
281: Unterer Grenzwert f&uuml;r SLA1(Feinaufl&ouml;sung).<br />
282: SLA Filterzeit.<br />
283: Beschleunigungsistwert (Feinaufl&ouml;sung).<br />
1000: Kontrolltimer abgelaufen. Es sind zu viele Signalver&auml;nderungen an den sicherheitsgerichteten Eing&auml;ngen aufgetreten.<br />
1001: Initialisierungsfehler des Kontrolltimers.<br />
1002:<br />
Anwenderzustimmung nach Ablauf des Timers unterschiedlich.<br />
Die Anwenderzustimmung ist nicht konsistent. Der Status der Anwenderzustimmung ist nach Ablauf einer Zeit von 4 s in beiden &Uuml;berwachungskan&auml;len unterschiedlich.<br />
1003:<br />
Referenztoleranz &uuml;berschritten.<br />
Bei gesetzter Anwenderzustimmung ist die Differenz zwischen dem neu ermittelten Referenzpunkt nach Hochlauf (Absolutwertgeber) oder Referenzpunktfahrt (abstandscodiertes bzw. inkrementelles Messsystem) und der sicheren Istposition (gespeicherter Wert + Verfahrweg) gr&ouml;&szlig;er als die Referenztoleranz (p9544). In diesem Fall wird die Anwenderzustimmung weggenommen.<br />
1004:<br />
Plausibilit&auml;tsfehler bei Anwenderzustimmung.<br />
1. Bei bereits gesetzter Anwenderzustimmung wurde nochmals das Setzen angesto&szlig;en. In diesem Fall wird die Anwenderzustimmung weggenommen.<br />
2. Die Anwenderzustimmung wurde gesetzt, obwohl die Achse noch nicht referenziert war.<br />
1005: STO bereits aktiv bei Teststopp-Anwahl.<br />
1011: Abnahmeteststatus zwischen den &Uuml;berwachungskan&auml;len unterschiedlich.<br />
1012: Plausibilit&auml;tsverletzung des Geberistwerts.<br />
1014: Fehler bei der Synchronisation des SGA f&uuml;r die Funktion &quot;Sicherer Nocken&quot;.<br />
1015: Das Getriebeschalten (Bit 27 im PROFIsafe-Telegramm) dauert l&auml;nger als 2 min.<br />
1020: Ausfall der zyklischen Kommunikation zwischen den &Uuml;berwachungskan&auml;len.<br />
1021: Ausfall der zyklischen Kommunikation zwischen &Uuml;berwachungskanal und Sensor Module.<br />
1022: Lebenszeichenfehler f&uuml;r DRIVE-CLiQ-Geber &Uuml;berwachungskanal 1.<br />
1023: Fehler bei Wirksamkeitstests im DRIVE-CLiQ-Geber.<br />
1024: Lebenszeichenfehler f&uuml;r HTL&#47;TTL-Geber.<br />
1032: Lebenszeichenfehler f&uuml;r DRIVE-CLiQ-Geber &Uuml;berwachungskanal 2.<br />
1033: Fehler bei der Pr&uuml;fung des Offsets zwischen POS1 und POS2 f&uuml;r DRIVE-CLiQ-Geber &Uuml;berwachungskanal 1.<br />
1034: Fehler bei der Pr&uuml;fung des Offsets zwischen POS1 und POS2 f&uuml;r DRIVE-CLiQ-Geber &Uuml;berwachungskanal 2.<br />
1039: &Uuml;berlauf bei der Positionsberechnung.<br />
1041: Strombetrag zu gering (geberlos).<br />
1042: Plausibilit&auml;tsfehler Strom&#47;Spannung.<br />
1043: Zu viele Beschleunigungsvorg&auml;nge.<br />
1044: Plausibilit&auml;tsfehler Stromistwerte.<br />
5000 ... 5140:<br />
PROFIsafe-Meldungswerte.<br />
Bei diesen Meldungswerten werden Failsafe-Ansteuersignale (Failsafe Values) an die Sicherheitsfunktionen &uuml;bertragen.<br />
5000, 5014, 5023, 5024, 5030 ... 5032, 5042, 5043, 5052, 5053, 5068, 5072, 5073, 5082 ... 5087, 5090, 5091, 5122 ... 5125, 5132 ... 5135, 5140: Ein interner Softwarefehler ist aufgetreten (Nur f&uuml;r Siemens-interne Fehlerdiagnose).<br />
5012: Fehler bei der Initialisierung des PROFIsafe-Treibers.<br />
5013: Das Ergebnis der Initialisierung ist auf beiden Controllern unterschiedlich.<br />
5022: Fehler bei der Auswertung der F-Parameter. Die Werte der &uuml;bertragenen F-Parameter stimmen nicht mit den erwarteten Werten im PROFIsafe-Treiber &uuml;berein.<br />
5025: Das Ergebnis der F-Parametrierung ist auf beiden Controllern unterschiedlich.<br />
5026: CRC-Fehler bei den F-Parametern. Der &uuml;bertragene CRC-Wert der F-Parameter stimmt nicht mit dem im PST berechneten Wert &uuml;berein.<br />
5065: Beim Empfangen des PROFIsafe-Telegramms wurde ein Kommunikationsfehler festgestellt.<br />
5066: Beim Empfangen des PROFIsafe-Telegramms wurde ein Zeit&uuml;berwachungsfehler festgestellt.<br />
6000 ... 6166:<br />
PROFIsafe-Meldungswerte (PROFIsafe-Treiber f&uuml;r PROFIBUS DP V1&#47;V2 und PROFINET).<br />
Bei diesen Meldungswerten werden Failsafe-Ansteuersignale (Failsafe Values) an die Sicherheitsfunktionen &uuml;bertragen. Ist &quot;Stopp B nach Ausfall der PROFIsafe Kommunikation&quot; (9612) parametriert, wird die &Uuml;bertragung der Failsafe Values verz&ouml;gert.<br />
Die Bedeutung der einzelnen Meldungswerte ist in der Safety-St&ouml;rung F01611 beschrieben.<br />
7000: Differenz der sicheren Position gr&ouml;&szlig;er als die parametrierte Toleranz (p9542&#47;p9342).<br />
7001: Skalierungswert f&uuml;r die sichere Position in der 16-Bit-Darstellung zu klein (p9574&#47;p9374).<br />
7002: Taktz&auml;hler f&uuml;r die &Uuml;bertragung der sicheren Position in beiden &Uuml;berwachungskan&auml;len unterschiedlich.<br />
7003: Fehler bei der Bereitstellung der Daten f&uuml;r die Funktion &quot;Synchrone Sichere Position &uuml;ber PROFIsafe&quot;.<br />
7004: PROFIsafe-Takt nicht richtig auf den DP-Takt einsynchronisiert.<br />
Siehe auch: p9555 (SI Motion Übergangszeit STOP F auf STOP B (Control Unit)), r9725 (SI Motion Diagnose STOP F)<br />
</td></tr>
<tr><td valign="top"><b>Abhilfe:</b></td>
<td>Allgemein gilt:<br />
Die &Uuml;berwachungstakte in beiden Kan&auml;len und die Achstypen sind auf Gleichheit zu &uuml;berpr&uuml;fen und gegebenenfalls gleich einzustellen. Tritt der Fehler trotzdem weiterhin auf, kann eine Vergr&ouml;&szlig;erung der &Uuml;berwachungstakte eine Abhilfe sein.<br />
Zu Meldungswert = 0:<br />
- In diesem &Uuml;berwachungskanal wurde kein Fehler festgestellt. Fehlermeldung des anderen &Uuml;berwachungskanal beachten (bei HM: C30711).<br />
Zu Meldungswert = 3:<br />
Inbetriebnahmephase:<br />
- Geberparameter pr&uuml;fen und gegebenenfalls korrigieren (p9516&#47;p9316, p9517&#47;p9317, p9518&#47;p9318, p9520&#47;p9320, p9521&#47;p9321, p9522&#47;p9322, p9526&#47;p9326).<br />
Im Betrieb:<br />
- Kontrolle des mechanischen Aufbaus und der Gebersignale.<br />
Zu Meldungswert = 4:<br />
- Die &Uuml;berwachungstakte in beiden Kan&auml;len sind auf Gleichheit zu &uuml;berpr&uuml;fen und gegebenenfalls gleich einzustellen. In Kombination mit Meldungswert 5 vom anderen &Uuml;berwachungskanal (bei HM: C30711) m&uuml;ssen die &Uuml;berwachungstakte gr&ouml;&szlig;er eingestellt werden.<br />
Zu Meldungswert = 11 ... 14:<br />
- Die Grenzwerte in p9534&#47;p9334 oder p9535&#47;p9335 sind ungleich oder zu hoch eingestellt. Werte korrigieren.<br />
Zu Meldungswert = 232:<br />
- Hysteresetoleranz (p9547&#47;p9347) vergr&ouml;&szlig;ern. Eventuell die Filterung gr&ouml;&szlig;er einstellen (p9545&#47;p9345).<br />
Zu Meldungswert = 274, 275:<br />
- Die Nockentoleranz p9540&#47;p9340 und&#47;oder die Positionstoleranz p9542&#47;p9342 vergr&ouml;&szlig;ern.<br />
Zu Meldungswert = 278, 279, 280, 281:<br />
- Kontrolle, ob beide Kan&auml;le die gleiche Beschleunigungsgrenze eingestellt haben. Unterschiedliches Ergebnis ist abh&auml;ngig, ob SLA freigegeben und nicht angew&auml;hlt oder freigegeben und angew&auml;hlt ist. Hier ist ein anderer Meldungswert m&ouml;glich.<br />
Zu Meldungswert = 1 ... 999:<br />
- Wenn der Meldungswert unter Ursache aufgelistet ist: &Uuml;berpr&uuml;fen der kreuzweise verglichenen Parameter, auf die sich der Meldungswert bezieht.<br />
- Safety-Parameter kopieren.<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Software des Hydraulic Modules hochr&uuml;sten.<br />
- Software der Control Unit hochr&uuml;sten.<br />
- Korrektur der Geberbewertung. Die Istwerte sind aufgrund von mechanischen Fehlern (Keilriemen, Fahren auf mechanische Begrenzung, Verschlei&szlig; und zu enge Fenstereinstellung, Geberfehler, ...) unterschiedlich.<br />
Hinweis:<br />
Bei SINAMICS Firmware-Version &gt;= 4.7 wird die KDV-Liste bei Einstellung von p9567 &gt; 0 vergr&ouml;&szlig;ert. Dies kann bei nicht kompatibler Firmware-Version der SINUMERIK zum Fehler beim kreuzweisen Datenvergleich f&uuml;hren (wird mit Meldungswert &gt;= 237 angezeigt). Gegebenenfalls muss p9567 = 0 eingestellt werden oder die Firmware-Version der SINUMERIK hochger&uuml;stet werden.<br />
Zu Meldungswert = 1000:<br />
- Untersuchen des zum sicherheitsgerichteten Eingang zugeh&ouml;rigen Signals (Kontaktprobleme).<br />
Zu Meldungswert = 1001:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Software des Hydraulic Modules hochr&uuml;sten.<br />
- Software der Control Unit hochr&uuml;sten.<br />
Zu Meldungswert = 1002:<br />
- Sichere Quittierung durchf&uuml;hren, Anwenderzustimmung auf beiden &Uuml;berwachungskan&auml;len gleichzeitig setzen (innerhalb von 4 s).<br />
Zu Meldungswert = 1003:<br />
- Achsmechanik kontrollieren. Gegebenenfalls wurde die Achse im ausgeschalteten Zustand verschoben und die zuletzt abgespeicherte Istposition stimmt nicht mehr mit der neuen Istposition beim n&auml;chsten Hochlauf &uuml;berein.<br />
- Toleranz f&uuml;r Istwertvergleich beim Referenzieren erh&ouml;hen (p9544).<br />
Anschlie&szlig;end Istwerte kontrollieren, POWER ON durchf&uuml;hren und Anwenderzustimmung wieder setzen.<br />
Zu Meldungswert = 1004:<br />
Bei 1. gilt: Sichere Quittierung durchf&uuml;hren. Anwenderzustimmung erneut setzen.<br />
Bei 2. gilt: Sichere Quittierung durchf&uuml;hren. Anwenderzustimmung erst setzen, wenn die Achse referenziert ist.<br />
Zu Meldungswert = 1005: Pr&uuml;fen der Bedingungen f&uuml;r STO abw&auml;hlen.<br />
Zu Meldungswert = 1007:<br />
- Pr&uuml;fen der PLC auf korrekten Betriebszustand (Run-Zustand, Grundprogramm).<br />
Zu Meldungswert = 1008:<br />
- Pr&uuml;fen, ob falsche oder &uuml;berschneidende Adressbereiche im SINUMERIK-Maschinendatum MD10393 eingestellt sind.<br />
Zu Meldungswert = 1011:<br />
- F&uuml;r Diagnose siehe Parameter (r9571).<br />
Zu Meldungswert = 1012:<br />
- Firmware-Version des Sensor Modules auf eine neuere Version hochr&uuml;sten.<br />
- Bei 1-Geber-System gilt: Geberparameter auf Gleichheit pr&uuml;fen (p9515&#47;p9315, p9519&#47;p9319, p9523&#47;p9323, p9524&#47;p9324, p9525&#47;p9325, p9529&#47;p9329).<br />
- Bei 1-Geber-System und 2-Geber-System gilt: Um die Geberparameter aus p04xx korrekt zu kopieren, muss p9700 = 46 und p9701 = 172 eingestellt werden.<br />
- F&uuml;r DQI-Geber gilt: Gegebenenfalls die Firmware-Version der Control Unit auf eine neuere Version hochr&uuml;sten f&uuml;r die der DQI-Geber freigegeben ist.<br />
- Der parametrierte Geber entspricht dem angeschlossenen Geber nicht, Geber umtauschen.<br />
- EMV-gerechten Schaltschrankaufbau und Leitungsverlegung pr&uuml;fen.<br />
- POWER ON bei allen Komponenten (Aus-&#47;Einschalten) oder Warmstart (p0009 = 30, p0976 = 2, 3) durchf&uuml;hren.<br />
- Hardware tauschen.<br />
Zu Meldungswert = 1014:<br />
- Istwerte des Gebers kontrollieren. Gegebenenfalls Positionstoleranz (p9542) und&#47;oder Nockentoleranz (p9540) erh&ouml;hen.<br />
Zu Meldungswert = 1020, 1021,1024:<br />
- Pr&uuml;fen der Kommunikationsverbindung.<br />
- Gegebenenfalls die &Uuml;berwachungstakte gr&ouml;&szlig;er einstellen (p9500, p9511).<br />
- POWER ON bei allen Komponenten (Aus-&#47;Einschalten) oder Warmstart (p0009 = 30, p0976 = 2, 3) durchf&uuml;hren.<br />
- Hardware tauschen.<br />
Zu Meldungswert = 1033:<br />
- Gegebenenfalls die Firmware-Version der Control Unit auf eine neuere Version hochr&uuml;sten f&uuml;r die der DQI-Geber freigegeben ist.<br />
Zu Meldungswert = 1039:<br />
- &Uuml;berpr&uuml;fen der Umrechnungsfaktoren wie Spindelsteigung oder Getriebefaktoren.<br />
Zu Meldungswert = 1041:<br />
- &Uuml;berpr&uuml;fen ob gen&uuml;gend Strom im Motor (&gt; r9785[0]) vorhanden ist.<br />
- Minimalstrom reduzieren (p9588).<br />
- Bei Synchronmotoren den Betrag von p9783 erh&ouml;hen.<br />
- &Uuml;berpr&uuml;fen, ob die Funktion &quot;Geregelter Betrieb mit HF-Signalinjektion&quot; aktiviert ist (p1750.5 = 1) und gegebenenfalls deaktivieren.<br />
Zu Meldungswert = 1042:<br />
- Hochlaufgeber Hochlaufzeit&#47;R&uuml;cklaufzeit erh&ouml;hen (p1120&#47;p1121).<br />
- Strom-&#47;Drehzahlregelung auf korrekte Einstellung pr&uuml;fen (Momentenbildender&#47;Feldbildender Strom und Drehzahlistwert darf nicht schwingen).<br />
- Dynamik des Sollwertes reduzieren.<br />
- Strom und Spannungsbetrag pr&uuml;fen und so das Verhalten der Regelung einstellen, dass diese gr&ouml;&szlig;er als 3% der Umrichternnendaten im Betriebsfall bzw. im Fehlerfall sind.<br />
- Minimalstrom erh&ouml;hen (p9588)<br />
Zu Meldungswert = 1043:<br />
- Spannungstoleranz erh&ouml;hen (p9589). Beim Betrieb eines Reluktanzmotors sind die Reglereinstellungen meistens dynamischer gew&auml;hlt. Wenn es bei Werkseinstellung von p9589 zu dieser Meldung kommt, dann ist als Abhilfe die Beschleunigungsgrenze zu erh&ouml;hen (p9589 = 500 ... 1000 %). Dies liefert erfahrungsgem&auml;&szlig; ein robustes Verhalten.<br />
- Hochlaufgeber Hochlaufzeit&#47;R&uuml;cklaufzeit erh&ouml;hen (p1120&#47;p1121).<br />
- Strom-&#47;Drehzahlregelung auf korrekte Einstellung pr&uuml;fen (Momentenbildender&#47;Feldbildender Strom und Drehzahlistwert darf nicht schwingen).<br />
- Dynamik des Sollwertes reduzieren.<br />
Zu Meldungswert = 5000, 5014, 5023, 5024, 5030, 5031, 5032, 5042, 5043, 5052, 5053, 5068, 5072, 5073, 5082 ... 5087, 5090, 5091, 5122 ... 5125, 5132 ... 5135, 5140:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Hydraulic Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
- Firmware auf neuere Version hochr&uuml;sten.<br />
- Technical Support kontaktieren.<br />
- Control Unit austauschen.<br />
Zu Meldungswert = 5012:<br />
- Einstellung der PROFIsafe-Adresse der Control Unit (p9610) und des Hydraulic Modules (p9810) pr&uuml;fen. Die PROFIsafe-Adresse darf nicht 0 oder FFFF sein!<br />
Zu Meldungswert = 5013, 5025:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Einstellung der PROFIsafe-Adresse der Control Unit (p9610) und des Hydraulic Modules (p9810) pr&uuml;fen.<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Hydraulic Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Zu Meldungswert = 5022:<br />
- Einstellung der Werte der F-Parameter am PROFIsafe-Slave pr&uuml;fen (F_SIL, F_CRC_Length, F_Par_Version, F_Source_Add, F_Dest_add, F_WD_Time).<br />
Zu Meldungswert = 5026:<br />
- Einstellung der Werte der F-Parameter und den daraus errechneten F-Parameter-CRC (CRC1) am PROFIsafe-Slave pr&uuml;fen und aktualisieren.<br />
Zu Meldungswert = 5065:<br />
- Projektierung und -Kommunikation am PROFIsafe-Slave pr&uuml;fen (lfdNr&#47;CRC).<br />
- Einstellung des Wertes f&uuml;r F-Parameter F_WD_Time am PROFIsafe-Slave pr&uuml;fen und eventuell vergr&ouml;&szlig;ern.<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Hydraulic Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Zu Meldungswert = 5066:<br />
- Einstellung des Wertes f&uuml;r F-Parameter F_WD_Time am PROFIsafe-Slave pr&uuml;fen und eventuell vergr&ouml;&szlig;ern.<br />
- Diagnoseinformation im F-Host auswerten.<br />
- PROFIsafe-Verbindung &uuml;berpr&uuml;fen.<br />
Zu Meldungswert = 6000 ... 6999:<br />
Siehe Beschreibung der Meldungswerte bei Safety-St&ouml;rung F01611.<br />
Zu Meldungswert = 7000:<br />
- Parametrierte Toleranz vergr&ouml;&szlig;ern (p9542&#47;p9342).<br />
- Istposition von CU (r9713[0] und zweitem Kanal r9713[1] ermitteln und die Differenz auf Plausibilit&auml;t pr&uuml;fen.<br />
- Differenz der Istposition von CU (r9713[0] und zweitem Kanal r9713[1] bei einem 2-Geber-System reduzieren.<br />
Zu Meldungswert = 7001:<br />
- Skalierungswert f&uuml;r die sichere Position in der 16-Bit-Darstellung erh&ouml;hen (p9574&#47;p9374).<br />
- Gegebenenfalls den Verfahrbereich reduzieren.<br />
Zu Meldungswert = 7002:<br />
- POWER ON bei allen Komponenten durchf&uuml;hren (Aus-&#47;Einschalten).<br />
- Pr&uuml;fen, ob St&ouml;rungen in der DRIVE-CLiQ-Kommunikation zwischen der Control Unit und dem betroffenen Hydraulic Module vorliegen und gegebenenfalls Diagnose bei den betreffenden St&ouml;rungen durchf&uuml;hren.<br />
Diese Meldung kann wie folgt quittiert werden:<br />
- Antriebsintegrierte Bewegungs&uuml;berwachungen: &Uuml;ber Terminal Module 54F (TM54F) oder PROFIsafe<br />
- Bewegungs&uuml;berwachungen mit SINUMERIK: &Uuml;ber Maschinensteuertafel<br />
Zu Meldungswert = 7003, 7004:<br />
- Gegebenenfalls die Einstellungen der Zeiten f&uuml;r Tdp, Ti und To anpassen oder &Uuml;berwachungstakt p9500 vergr&ouml;&szlig;ern (Regel Tdp = 2 x n x p9500, n= 1, 2, 3, ... ).<br />
Siehe auch: p9300 (SI Motion Überwachungstakt (Motor Module)), p9500 (SI Motion Überwachungstakt (Control Unit))<br />
</td></tr>
</table><p></p></body></html>